{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}master
       {txt}log:  {res}/Users/billy/Desktop/kyLegislation/logs/master.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}14 Jul 2018, 18:39:27
{txt}
{com}. 
. // Move to root directory
. loc root ~/Desktop/kyLegislation
{txt}
{com}. 
. // Set global for location of log files
. glo logs `root'/logs
{txt}
{com}. 
. // Set global for location of raw data sets that are used in this project 
. glo raw `root'/data/raw/2018/regular
{txt}
{com}. 
. // Set global for location of clean data sets that are used in this project
. glo clean `root'/data/clean/2018
{txt}
{com}. 
. // Set global for location of data sets that get used for analysis
. glo analysis `root'/data/clean/analysis
{txt}
{com}. 
. // Set global for location of results
. glo results `root'/results
{txt}
{com}. 
. // Set global for location of project's source code
. glo src `root'/src
{txt}
{com}. 
. // Stores stub for merge command to get party affiliation joined to the data
. loc mrgcmd merge 1:1 _nodelab using
{txt}
{com}. 
. // Stores the options to pass to the merge command to join party affilation data
. loc mrgopts nogen keepus(name party nodepos)
{txt}
{com}. 
. // Constructs the command to join house members' party affiliations to the data
. glo mrghouse `mrgcmd' `"$clean/houseMembers.dta"', `mrgopts'
{txt}
{com}. 
. // Constructs the command to join senate members' party affiliations to the data
. glo mrgsenate `mrgcmd' `"$clean/senateMembers.dta"', `mrgopts'
{txt}
{com}. 
. // Reference for weighted networks for the house
. glo housewgt housenonedwgt houseedwgt
{txt}
{com}. 
. // Reference for unweighted networks for the house
. glo houseunwgt housenonedunwgt houseedunwgt
{txt}
{com}. 
. // Reference for weighted networks for the senate
. glo senatewgt senatenonedwgt senateedwgt
{txt}
{com}. 
. // Reference for unweighted networks for the senate
. glo senateunwgt senatenonedunwgt senateedunwgt
{txt}
{com}. 
. // Reference to get node id for house education committee chair
. glo hedchair su _nodeid if name == "John Carney"
{txt}
{com}. 
. // Reference to get node id for house education committee vice chair
. glo hedvicechair su _nodeid if name == "Steve Riley"
{txt}
{com}. 
. // Reference to get node id for senate education committee chair
. glo sedchair su _nodeid if name == "George Wise"
{txt}
{com}. 
. // Reference to get node id for senate education committee vice chair
. glo sedvicechair su _nodeid if name == "Stephen West"
{txt}
{com}. 
. // Reference to senate president
. glo spres su _nodeid if name == "Robert Stivers"
{txt}
{com}. 
. // Reference to find id for house speaker pro tempore
. glo sprotemp su _nodeid if name == "Jimmy Higdon"
{txt}
{com}. 
. // Reference to senate majority leader
. glo smajldr su _nodeid if name == "Damon Thayer"
{txt}
{com}. 
. // Reference to senate majority whip
. glo smajwhip su _nodeid if name == "Mike Wilson"
{txt}
{com}. 
. // Reference to senate minority leader
. glo sminldr su _nodeid if name == "Ray Jones"
{txt}
{com}. 
. // Reference to senate minority whip
. glo sminwhip su _nodeid if name == "Dennis Parrett"
{txt}
{com}. 
. // Reference to speaker of the house
. glo hpres su _nodeid if name == ""
{txt}
{com}. 
. // Reference to find id for house speaker pro tempore
. glo hprotemp su _nodeid if name == "David Osborne"
{txt}
{com}. 
. // Reference to house majority leader
. glo hmajldr su _nodeid if name == "Jonathan Shell"
{txt}
{com}. 
. // Reference to house majority whip
. glo hmajwhip su _nodeid if name == "Kevin Bratcher"
{txt}
{com}. 
. // Reference to house minority leader
. glo hminldr su _nodeid if name == "Rocky Adkins"
{txt}
{com}. 
. // Reference to house minority whip
. glo hminwhip su _nodeid if name == "Wilson Stone"
{txt}
{com}. 
. // Macro that contains the names of the global macros for senate leadership
. glo senateldrshp spres sprotemp smajldr smajwhip sminldr sminwhip sedchair sedvicechair
{txt}
{com}. 
. // Macro that contains the names of the global macros for house leadership
. glo houseldrshp hprotemp hmajldr hmajwhip hminldr hminwhip hedchair hedvicechair
{txt}
{com}. 
. // Run the script that cleans the legiscan data
. do `"$src/cleanData.do"'
{txt}
{com}. // Creates a log file
. log using `"$logs/dataCleaning.txt"', replace text name(cleaning)
{txt}{.-}
      name:  {res}cleaning
       {txt}log:  {res}/Users/billy/Desktop/kyLegislation/logs/dataCleaning.txt
  {txt}log type:  {res}text
 {txt}opened on:  {res}14 Jul 2018, 18:39:27
{txt}
{com}. 
. // Set macro with file names
. loc files : dir `"$raw"' files "*.csv", respect
{txt}
{com}. 
. // Loop over the files
. foreach f of loc files {c -(}
{txt}  2{com}. 
.         // Remove the file suffix from the file name
.         loc file : subinstr loc f ".csv" "", all
{txt}  3{com}.         
.         // Read in the file
.         import delimited using `"$raw/`file'.csv"', varn(1) case(l) clear
{txt}  4{com}.         
.         // Logic for bills file
.         if `"`file'"' == "bills" {c -(}
{txt}  5{com}.         
.                 // Create an indicator for education bills by searching for :
.                 // educ
.                 // school
.                 // schools
.                 // epsb
.                 // kde
.                 g byte ised = ustrregexm(title, "(educ)|(schools?)|(epsb)|(kde)", 1)
{txt}  6{com}.         
.                 // Create a year indicator
.                 g int year = 2018
{txt}  7{com}.                 
.                 // Keep only the necessary subset of the data
.                 keep bill_number ised bill_id year
{txt}  8{com}. 
.                 // Create an indicator for the house chamber bills
.                 g byte house = substr(bill_number, 1, 1) == "H"
{txt}  9{com}. 
.                 // Create an indicator for the senate chamber bills
.                 g byte senate = substr(bill_number, 1, 1) == "S"
{txt} 10{com}.                 
.                 // Drop all records that are not bills (e.g., resolutions, chamber rules)
.                 drop if !ustrregexm(bill_number, "[SH]B[0-9]+")
{txt} 11{com}. 
.                 // Sorts the data
.                 sort year house senate bill_id
{txt} 12{com}. 
.         {c )-} // End Logic for Bills file
{txt} 13{com}.         
.         // Logic for the people file
.         else if `"`file'"' == "people" {c -(}
{txt} 14{com}.         
.                 // Make sponsor id variable a string
.                 tostring sponsor_id, replace
{txt} 15{com}.         
.                 // Create a person ID
.                 g peopleid = sponsor_id
{txt} 16{com}.                 
.                 // Create indicator for the house
.                 g byte house = role == "Rep"
{txt} 17{com}.                 
.                 // Create indicator for the senate
.                 g byte senate = role == "Sen"
{txt} 18{com}.                 
.                 // Set the year value
.                 g int year = 2018
{txt} 19{com}.                 
.                 // Keep smallest subset of variables possible
.                 keep name party role district house senate sponsor_id peopleid year
{txt} 20{com}. 
.                 // Make role numeric
.                 replace role = cond(role == "Rep", "0", "1")
{txt} 21{com}. 
.                 // Defines value labels
.                 la def role 0 "Representative" 1 "Senator", modify
{txt} 22{com}. 
.                 // Make the party variable numeric
.                 replace party = cond(party == "D", "1", cond(party == "I", "-1", "0"))
{txt} 23{com}. 
.                 // Define value labels
.                 la def party 1 "Democrat" 0 "Republican" -1 "Independent", modify
{txt} 24{com}. 
.                 // Strip house/senate designation from districts
.                 replace district = ustrregexra(district, "(HD-)|(SD-)|(NA)", "")
{txt} 25{com}. 
.                 // Create variable used to join the data later
.                 g _nodelab = "_" + sponsor_id
{txt} 26{com}.                 
.                 // Loop over variables that need to get cast as numeric
.                 destring role party district, replace 
{txt} 27{com}.                 
.                 // Create node positions for later
.                 g byte nodepos = cond(party == 1, 2, 7)
{txt} 28{com}. 
.                 // Apply value labels
.                 la val party party
{txt} 29{com}.                 la val role role
{txt} 30{com}. 
.                 // Drop any duplicate records
.                 duplicates drop
{txt} 31{com}.                 
.                 // Test the primary key assumption
.                 isid sponsor_id year
{txt} 32{com}.                 
.                 // Sort the data
.                 sort sponsor_id year
{txt} 33{com}. 
.         {c )-} // End Logic for the People files
{txt} 34{com}.         
.         // Logic for sponsorship dataset
.         else if `"`file'"' == "sponsors" {c -(}
{txt} 35{com}.         
.                 // Add a year indicator to the data
.                 g int year = 2018
{txt} 36{com}.                 
.                 // Add indicator for sponsorship to the dataset
.                 g byte didsponsor = 1
{txt} 37{com}.                 
.                 // Make sure sponsor id field is string
.                 tostring sponsor_id, replace
{txt} 38{com}.         
.         {c )-} // End ELSE block for sponsors dataset
{txt} 39{com}.         
.         // Optimize the storage of the data
.         compress
{txt} 40{com}.         
.         // Save these data
.         save `"$clean/`file'.dta"', replace
{txt} 41{com}.         
. {c )-} // End Loop over the files
{res}{text}(16 vars, 138 obs)
sponsor_id was {res:int} now {res:str5}
(138 real changes made)
(138 real changes made)
(138 real changes made)
role: all characters numeric; {res}replaced {txt}as {res}byte
{txt}party: all characters numeric; {res}replaced {txt}as {res}byte
{txt}district: all characters numeric; {res}replaced {txt}as {res}byte

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
  (0 bytes saved)
file ~/Desktop/kyLegislation/data/clean/2018/people.dta saved
{res}{text}(3 vars, 9,357 obs)
  (0 bytes saved)
file ~/Desktop/kyLegislation/data/clean/2018/history.dta saved
{res}{text}(7 vars, 799 obs)
  (0 bytes saved)
file ~/Desktop/kyLegislation/data/clean/2018/rollcalls.dta saved
{res}{text}(3 vars, 55,744 obs)
  (0 bytes saved)
file ~/Desktop/kyLegislation/data/clean/2018/votes.dta saved
{res}{text}(2 vars, 9,215 obs)
sponsor_id was {res:int} now {res:str5}
  (0 bytes saved)
file ~/Desktop/kyLegislation/data/clean/2018/sponsors.dta saved
{res}{text}(4 vars, 1,574 obs)
(701 observations deleted)
  variable {bf}bill_number{sf} was {bf}{res}str6{sf}{txt} now {bf}{res}str5{sf}
{txt}  (873 bytes saved)
file ~/Desktop/kyLegislation/data/clean/2018/bills.dta saved

{com}. 
. // Load the people data set to construct the person bill data set
. use `"$clean/people.dta"', clear
{txt}
{com}. 
. // Preserve the state of the people data set
. preserve
{txt}
{com}. 
.         // Keep only the house members
.         keep if house == 1
{txt}(38 observations deleted)

{com}.         
.         // Save a version of the file for only the house members
.         save `"$clean/houseMembers.dta"', replace
{txt}file ~/Desktop/kyLegislation/data/clean/2018/houseMembers.dta saved

{com}.         
. // Restore the data set and preserve again
. restore, preserve
{txt}
{com}. 
.         // Keep only the senate members
.         keep if house != 1
{txt}(100 observations deleted)

{com}.         
.         // Save a version of the file for only the senate members
.         save `"$clean/senateMembers.dta"', replace
{txt}file ~/Desktop/kyLegislation/data/clean/2018/senateMembers.dta saved

{com}.         
. // Restore the data to original state
. restore
{txt}
{com}. 
. // Don't retain the _nodelab variable for this part of the process
. drop _nodelab
{txt}
{com}. 
. // Preserve these data in memory
. preserve
{txt}
{com}. 
.         // Join all bill data to all individuals in each chamber
.         joinby year house senate using `"$clean/bills.dta"'
{txt}
{com}.         
.         // Add note to data set
.         note : `"people file joined with bills using joinby year house senate using `"$clean/bills.dta"'"'
{res}{txt}
{com}.         
.         // Make sure sponsor ID is still string
.         tostring sponsor_id, replace
{txt}sponsor_id already string; no {res}replace
{txt}
{com}.         
.         // Join the sponsorship data to this file
.         merge 1:1 sponsor_id year bill_id using `"$clean/sponsors.dta"', keep(1 3) nogen
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}          67,775
{txt}{col 9}from master{col 30}{res}          67,775{txt}  
{col 9}from using{col 30}{res}               0{txt}  

{col 5}matched{col 30}{res}           2,909{txt}  
{col 5}{hline 41}

{com}. 
.         // Save the file
.         save `"$clean/sponsorBills.dta"', replace
{txt}file ~/Desktop/kyLegislation/data/clean/2018/sponsorBills.dta saved

{com}.         
.         // Loop over sponsor data
.         foreach d in name party role district {c -(}
{txt}  2{com}.         
.                 // Rename the data
.                 rename `d' cospons`d'
{txt}  3{com}.                 
.         {c )-} // End Loop over sponsor data
{res}{txt}
{com}.         
.         // Add variable labels
.         la var cosponsname "Cosponsoring Legislator Name"
{txt}
{com}.         la var cosponsparty "Cosponsoring Legislator Party" 
{txt}
{com}.         la var cosponsrole "Cosponsoring Legislator Chamber"
{txt}
{com}.         la var cosponsdistrict "Cosponsoring Legislator District"
{txt}
{com}. 
.         // Add another note
.         note : "This version of the file is modified to indicate cosponsors"
{res}{txt}
{com}.                 
.         // Renames some of the variables
.         rename (sponsor_id didsponsor)(cosponsid didcosponsor)
{res}{txt}
{com}.         
.         // Drops variables that are not needed in the cosponsorship file
.         drop bill_number ised peopleid
{txt}
{com}.         
.         // Save the data in a new file
.         save `"$clean/cosponsorsBills.dta"', replace
{txt}file ~/Desktop/kyLegislation/data/clean/2018/cosponsorsBills.dta saved

{com}.         
. // Restore the data
. restore
{txt}
{com}. 
. // Load the file with the sponsors and bill indicators
. use `"$clean/sponsorBills.dta"', clear
{txt}
{com}. 
. // Drops the people ID
. drop peopleid
{txt}
{com}. 
. // Joins the data with the cosponsors 
. joinby bill_id year house senate using `"$clean/cosponsorsBills.dta"'
{txt}
{com}. 
. // Drops all duplicate records
. duplicates drop

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)

{com}. 
. // Sets the cosponsorship indicators to use non-missing values
. foreach v in didcosponsor didsponsor {c -(}
{txt}  2{com}. 
.         // Sets the values to 0 if they are missing
.         replace `v' = 0 if mi(`v')
{txt}  3{com}.         
. {c )-} // End Loop over the cosponsorship indicators
{txt}(6,182,734 real changes made)
(6,182,734 real changes made)

{com}. 
. // Label the variables in the data set
. la var sponsor_id "Legiscan Person ID"
{txt}
{com}. la var name "Legislator Name"
{txt}
{com}. la var party "Legislator Party"
{txt}
{com}. la var role "Legislator Chamber"
{txt}
{com}. la var district "Legislator District"
{txt}
{com}. la var house "Indicator for House Bills/Resolutions"
{txt}
{com}. la var senate "Indicator for Senate Bills/Resolutions"
{txt}
{com}. la var year "Legislative Session Year"
{txt}
{com}. la var bill_number "KY Legislation Identifier"
{txt}
{com}. la var bill_id "Legiscan Unique ID for KY Legislation"
{txt}
{com}. la var ised "Indicator of whether or not the bill is education related"
{txt}
{com}. la var didsponsor "Indicator of whether or not the legislator sponsored the bill"
{txt}
{com}. la var cosponsid "Legiscan Person ID for Bill Cosponsors"
{txt}
{com}. la var didcosponsor "Indicator of whether or not the cosponsor cosponsored the bill"
{txt}
{com}. 
. /*
> 
> Check things from this point down to make sure the adjacency matrix gets 
> constructed correctly.  Make sure that nwcommands are installed and available
> in the Stata instance.
> 
> */
. 
. // Drops cases where the individual is listed as sponsor and cosponsor
. drop if name == cosponsname
{txt}(70,684 observations deleted)

{com}. 
. // Creates a dyad indicator.  These can be used to create weights
. // Value should be 1 if name and cosponsname both sponsored the bill
. // Value should be -1 if name sponsored the bill and cosponsname did not sponsor
. // Value should be 0 if neither name nor cosponsname sponsored the bill
. // Attempting to only map positive ties
. bys sponsor_id bill_id (cosponsid): g byte dyad =                                                        ///   
> cond(sponsor_id == cosponsid, ., cond(didsponsor + didcosponsor == 2, 1, 0))   
{txt}
{com}. // cond(didsponsor + didcosponsor == 1, -1, 0)))
. 
. // Sort once for the next two operations
. sort sponsor_id cosponsid year
{txt}
{com}. 
. // Creates a within year weight for each pair of legislators
. by sponsor_id cosponsid year: egen nwwiyrwgt = total(dyad)
{txt}
{com}. 
. // Creates a within year weight for each pair of legislators for education bills
. by sponsor_id cosponsid year: egen nwwiyrwgted = total(dyad) if ised == 1
{txt}(5885658 missing values generated)

{com}. 
. // Sort once for the next two operations
. sort sponsor_id cosponsid
{txt}
{com}. 
. // Creates a between year weight for each pair of legislators
. by sponsor_id cosponsid: egen nwbeyrwgt = total(dyad)
{txt}
{com}. 
. // Creates a between year weight for each pair of legislators for education bills
. by sponsor_id cosponsid: egen nwbeyrwgted = total(dyad) if ised == 1
{txt}(5885658 missing values generated)

{com}. 
. // Subtract education legislation from the total legislation measures
. replace nwwiyrwgt = nwwiyrwgt - nwwiyrwgted
{txt}(5,923,718 real changes made, 5,885,658 to missing)

{com}. replace nwbeyrwgt = nwbeyrwgt - nwbeyrwgted
{txt}(5,923,718 real changes made, 5,885,658 to missing)

{com}. 
. // Generate binary indicator for unweighted network for non-education legislation
. g byte nonedpair = nwwiyrwgt > 0
{txt}
{com}. 
. // Generate binary indicator for unweighted network for education legislation
. g byte isedpair = nwwiyrwgted > 0
{txt}
{com}. 
. // Add variable labels to the variables just created
. la var dyad "Cosponsorship Dyad Indicator"
{txt}
{com}. la var nwwiyrwgt "Within year network weight"
{txt}
{com}. la var nwwiyrwgted "Within year network weight for education legislation"
{txt}
{com}. la var nwbeyrwgt "Between year network weight"
{txt}
{com}. la var nwbeyrwgted "Between year network weight for education legislation"
{txt}
{com}. la var nonedpair "Binary Indicator for Non-Education Legislative Ties"
{txt}
{com}. la var isedpair "Binary Indicator for Education Legislative Ties"
{txt}
{com}. 
. // Compress the data set
. compress
  {txt}variable {bf}nwwiyrwgt{sf} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}nwwiyrwgted{sf} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}nwbeyrwgt{sf} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}nwbeyrwgted{sf} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
{txt}  (76,395,696 bytes saved)

{com}. 
. // Keeps a subset of the data
. keep sponsor_id name party district house year bill_number bill_id ised          ///   
> didsponsor cosponsname cosponsparty cosponsdistrict didcosponsor dyad            ///   
> nwwiyrwgt nwbeyrwgt nwwiyrwgted nwbeyrwgted cosponsid nonedpair isedpair         ///   
> nodepos
{txt}
{com}. 
. // Saves the full 
. save `"$clean/sponsorBillPeople.dta"', replace
{txt}file ~/Desktop/kyLegislation/data/clean/2018/sponsorBillPeople.dta saved

{com}. 
. // Only keeps the records needed to construct the adjacency matrix
. keep if ised == 1
{txt}(5,885,658 observations deleted)

{com}. 
. // Drops other variables that are unnecessary
. drop ised bill_number bill_id didsponsor dyad didcosponsor 
{txt}
{com}. 
. // Drop duplicated records from 70,103,624 records to 201,280 records 
. duplicates drop

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(469,344 observations deleted)

{com}. 
. // Test primary key assumption
. isid sponsor_id cosponsid year
{txt}
{com}. 
. // Sorts the data to make it faster to subset later
. sort year house sponsor_id cosponsid
{txt}
{com}. 
. // Preserve the current state of the data
. preserve
{txt}
{com}. 
.         // Keep only records for the house
.         keep if house == 1
{txt}(1,406 observations deleted)

{com}. 
.         // Saves the file used for the analysis
.         save `"$analysis/kyHouseData.dta"', replace
{txt}file ~/Desktop/kyLegislation/data/clean/analysis/kyHouseData.dta saved

{com}. 
. // Restore the dataset and preserve again
. restore, preserve
{txt}
{com}.         
.         // Keep only records for the house
.         keep if house == 0
{txt}(9,900 observations deleted)

{com}. 
.         // Saves the file used for the analysis
.         save `"$analysis/kySenateData.dta"', replace
{txt}file ~/Desktop/kyLegislation/data/clean/analysis/kySenateData.dta saved

{com}. 
. // Restore the dataset and preserve again
. restore, preserve
{txt}
{com}. 
.         // Saves the file used for the analysis
.         save `"$analysis/kyLegislationData.dta"', replace
{txt}file ~/Desktop/kyLegislation/data/clean/analysis/kyLegislationData.dta saved

{com}. 
. // Restore the dataset to original state
. restore
{txt}
{com}.                 
. // Close the log file
. log c cleaning          
      {txt}name:  {res}cleaning
       {txt}log:  {res}/Users/billy/Desktop/kyLegislation/logs/dataCleaning.txt
  {txt}log type:  {res}text
 {txt}closed on:  {res}14 Jul 2018, 18:41:42
{txt}{.-}

{com}.                 
. 
{txt}end of do-file

{com}. 
. // Run the script that constructs the networks
. do `"$src/createNetworks.do"'
{txt}
{com}. // Creates a log file
. log using `"$logs/createNetworks.txt"', replace text name(building)
{txt}{.-}
      name:  {res}building
       {txt}log:  {res}/Users/billy/Desktop/kyLegislation/logs/createNetworks.txt
  {txt}log type:  {res}text
 {txt}opened on:  {res}14 Jul 2018, 18:41:42
{txt}
{com}. 
. // Make sure any existing network data is cleared prior to creating new networks
. cap nwclear
{txt}
{com}. 
. // Saves the file used for the analysis
. use `"$analysis/kyHouseData.dta"', clear
{txt}
{com}. 
. // Indicate records that do not have any ties in the education subnetworks
. bys sponsor_id (cosponsid): egen connections = total(nwwiyrwgted)
{txt}
{com}. 
. // Get the sponsor ids for individuals who do not have any connections in the network
. levelsof sponsor_id if connections == 0, loc(unconnected)
{res}{txt}`"11085"' `"11086"' `"1123"' `"1125"' `"1138"' `"1141"' `"1146"' `"1159"' `"1163"' `"1166"' `"1168"' `"1182"' `"1186"' `"1188"' `"1194"' `"1196"' `"1202"' `"1206"' `"1207"' `"1209"' `"1215"' `"14421"' `"14422"' `"14425"' `"14426"' `"14429"' `"14430"' `"14433"' `"16049"' `"16110"' `"16616"' `"16670"' `"17926"' `"18249"' `"18250"' `"18254"' `"18339"' `"18488"' `"18489"' `"18491"' `"18492"' `"18494"' `"19375"'

{com}. 
. // Preserves the current state of the data
. preserve 
{txt}
{com}. 
.         // Creates non-education weighted network for the house
.         nwfromedge sponsor_id cosponsid nwwiyrwgt, name(housenonedwgt) 

{txt}{it:Loading successful}
{res}{hline 50}
{txt}   Network name: {res} housenonedwgt
{txt}   Network id: {res} 1
{txt}   Directed: {res}false
{txt}   Nodes: {res}100
{txt}   Edges: {res}3833
{txt}   Minimum value: {res} 0
{txt}   Maximum value: {res} 28
{txt}   Density: {res} .7743434343434343
{txt}
{com}.         
. // Restores and preserves original data again   
. restore, preserve
{txt}
{com}. 
.         // Creates non-education unweighted network for the house
.         nwfromedge sponsor_id cosponsid nonedpair, name(housenonedunwgt) 

{txt}{it:Loading successful}
{res}{hline 50}
{txt}   Network name: {res} housenonedunwgt
{txt}   Network id: {res} 2
{txt}   Directed: {res}false
{txt}   Nodes: {res}100
{txt}   Edges: {res}3833
{txt}   Minimum value: {res} 0
{txt}   Maximum value: {res} 1
{txt}   Density: {res} .7743434343434343
{txt}
{com}. 
. // Restores and preserves original data again   
. restore, preserve
{txt}
{com}. 
.         // Loop over sponsor ids for unconnected individuals
.         foreach person of loc unconnected {c -(}
{txt}  2{com}.         
.                 di `"`person'"'
{txt}  3{com}.         
.                 // Remove the unconnected individuals from the file
.                 drop if sponsor_id == `"`person'"' | cosponsid == `"`person'"'
{txt}  4{com}.                 
.         {c )-} // End Loop to remove unconnected nodes       
11085
{txt}(198 observations deleted)
11086
(196 observations deleted)
1123
(194 observations deleted)
1125
(192 observations deleted)
1138
(190 observations deleted)
1141
(188 observations deleted)
1146
(186 observations deleted)
1159
(184 observations deleted)
1163
(182 observations deleted)
1166
(180 observations deleted)
1168
(178 observations deleted)
1182
(176 observations deleted)
1186
(174 observations deleted)
1188
(172 observations deleted)
1194
(170 observations deleted)
1196
(168 observations deleted)
1202
(166 observations deleted)
1206
(164 observations deleted)
1207
(162 observations deleted)
1209
(160 observations deleted)
1215
(158 observations deleted)
14421
(156 observations deleted)
14422
(154 observations deleted)
14425
(152 observations deleted)
14426
(150 observations deleted)
14429
(148 observations deleted)
14430
(146 observations deleted)
14433
(144 observations deleted)
16049
(142 observations deleted)
16110
(140 observations deleted)
16616
(138 observations deleted)
16670
(136 observations deleted)
17926
(134 observations deleted)
18249
(132 observations deleted)
18250
(130 observations deleted)
18254
(128 observations deleted)
18339
(126 observations deleted)
18488
(124 observations deleted)
18489
(122 observations deleted)
18491
(120 observations deleted)
18492
(118 observations deleted)
18494
(116 observations deleted)
19375
(114 observations deleted)

{com}. 
.         // Creates education weighted network for the house
.         nwfromedge sponsor_id cosponsid nwwiyrwgted, name(houseedwgt) 

{txt}{it:Loading successful}
{res}{hline 50}
{txt}   Network name: {res} houseedwgt
{txt}   Network id: {res} 3
{txt}   Directed: {res}false
{txt}   Nodes: {res}57
{txt}   Edges: {res}389
{txt}   Minimum value: {res} 0
{txt}   Maximum value: {res} 4
{txt}   Density: {res} .243734335839599
{txt}
{com}.         
. // Restores and preserves original data again   
. restore, preserve
{txt}
{com}. 
.         // Loop over sponsor ids for unconnected individuals
.         foreach person of loc unconnected {c -(}
{txt}  2{com}.         
.                 // Remove the unconnected individuals from the file
.                 drop if sponsor_id == `"`person'"' | cosponsid == `"`person'"'
{txt}  3{com}.                 
.         {c )-} // End Loop to remove unconnected nodes       
{txt}(198 observations deleted)
(196 observations deleted)
(194 observations deleted)
(192 observations deleted)
(190 observations deleted)
(188 observations deleted)
(186 observations deleted)
(184 observations deleted)
(182 observations deleted)
(180 observations deleted)
(178 observations deleted)
(176 observations deleted)
(174 observations deleted)
(172 observations deleted)
(170 observations deleted)
(168 observations deleted)
(166 observations deleted)
(164 observations deleted)
(162 observations deleted)
(160 observations deleted)
(158 observations deleted)
(156 observations deleted)
(154 observations deleted)
(152 observations deleted)
(150 observations deleted)
(148 observations deleted)
(146 observations deleted)
(144 observations deleted)
(142 observations deleted)
(140 observations deleted)
(138 observations deleted)
(136 observations deleted)
(134 observations deleted)
(132 observations deleted)
(130 observations deleted)
(128 observations deleted)
(126 observations deleted)
(124 observations deleted)
(122 observations deleted)
(120 observations deleted)
(118 observations deleted)
(116 observations deleted)
(114 observations deleted)

{com}. 
.         // Creates education unweighted network for the house
.         nwfromedge sponsor_id cosponsid isedpair, name(houseedunwgt) 

{txt}{it:Loading successful}
{res}{hline 50}
{txt}   Network name: {res} houseedunwgt
{txt}   Network id: {res} 4
{txt}   Directed: {res}false
{txt}   Nodes: {res}57
{txt}   Edges: {res}389
{txt}   Minimum value: {res} 0
{txt}   Maximum value: {res} 1
{txt}   Density: {res} .243734335839599
{txt}
{com}.                 
. // Restores the data to its original state      
. restore
{txt}
{com}. 
. // Confirms that all of the networks above are accessible
. nwds
{res}{txt}{col 1}houseno~dwgt{col 15}houseno~nwgt{col 29}houseedwgt{col 43}houseedunwgt

{com}. 
. // Saves the networks for the house
. nwsave $analysis/houseNetworks, replace
{res}{txt}file ~/Desktop/kyLegislation/data/clean/analysis/houseNetworks.dta saved

{com}. 
. // Makes sure that all network data is cleared from memory before constructing
. // Senate networks
. nwclear
{txt}
{com}. 
. // Loads the data for the Kentucky Senate Legislation
. use `"$analysis/kySenateData.dta"', clear
{txt}
{com}. 
. // Indicate records that do not have any ties in the education subnetworks
. bys sponsor_id (cosponsid): egen connections = total(nwwiyrwgted)
{txt}
{com}. 
. // Get the sponsor ids for individuals who do not have any connections in the network
. levelsof sponsor_id if connections == 0, loc(unconnected)
{res}{txt}`"11083"' `"11093"' `"11096"' `"1219"' `"1220"' `"1226"' `"1228"' `"1229"' `"1232"' `"1241"' `"1244"' `"1248"' `"1249"' `"14434"' `"14435"' `"14645"' `"14647"'

{com}. 
. // Preserves the current state of the data
. preserve
{txt}
{com}. 
.         // Creates non-education weighted network for the senate
.         nwfromedge sponsor_id cosponsid nwwiyrwgt, name(senatenonedwgt) keeporiginal

{txt}{it:Loading successful}
{res}{hline 50}
{txt}   Network name: {res} senatenonedwgt
{txt}   Network id: {res} 1
{txt}   Directed: {res}false
{txt}   Nodes: {res}38
{txt}   Edges: {res}479
{txt}   Minimum value: {res} 0
{txt}   Maximum value: {res} 12
{txt}   Density: {res} .6813655761024182
{txt}
{com}. 
. // Restores and preserves original data again   
. restore, preserve
{txt}
{com}. 
.         // Creates non-education unweighted network for the senate
.         nwfromedge sponsor_id cosponsid nonedpair, name(senatenonedunwgt) keeporiginal

{txt}{it:Loading successful}
{res}{hline 50}
{txt}   Network name: {res} senatenonedunwgt
{txt}   Network id: {res} 2
{txt}   Directed: {res}false
{txt}   Nodes: {res}38
{txt}   Edges: {res}479
{txt}   Minimum value: {res} 0
{txt}   Maximum value: {res} 1
{txt}   Density: {res} .6813655761024182
{txt}
{com}. 
. // Restores and preserves original data again   
. restore, preserve
{txt}
{com}. 
.         // Loop over sponsor ids for unconnected individuals
.         foreach person of loc unconnected {c -(}
{txt}  2{com}.         
.                 // Remove the unconnected individuals from the file
.                 drop if sponsor_id == `"`person'"' | cosponsid == `"`person'"'
{txt}  3{com}.                 
.         {c )-} // End Loop to remove unconnected nodes       
{txt}(74 observations deleted)
(72 observations deleted)
(70 observations deleted)
(68 observations deleted)
(66 observations deleted)
(64 observations deleted)
(62 observations deleted)
(60 observations deleted)
(58 observations deleted)
(56 observations deleted)
(54 observations deleted)
(52 observations deleted)
(50 observations deleted)
(48 observations deleted)
(46 observations deleted)
(44 observations deleted)
(42 observations deleted)

{com}. 
.         // Creates education weighted network for the senate
.         nwfromedge sponsor_id cosponsid nwwiyrwgted, name(senateedwgt) keeporiginal

{txt}{it:Loading successful}
{res}{hline 50}
{txt}   Network name: {res} senateedwgt
{txt}   Network id: {res} 3
{txt}   Directed: {res}false
{txt}   Nodes: {res}21
{txt}   Edges: {res}61
{txt}   Minimum value: {res} 0
{txt}   Maximum value: {res} 3
{txt}   Density: {res} .2904761904761905
{txt}
{com}.         
. // Restores and preserves original data again   
. restore, preserve
{txt}
{com}. 
.         // Loop over sponsor ids for unconnected individuals
.         foreach person of loc unconnected {c -(}
{txt}  2{com}.         
.                 // Remove the unconnected individuals from the file
.                 drop if sponsor_id == `"`person'"' | cosponsid == `"`person'"'
{txt}  3{com}.                 
.         {c )-} // End Loop to remove unconnected nodes       
{txt}(74 observations deleted)
(72 observations deleted)
(70 observations deleted)
(68 observations deleted)
(66 observations deleted)
(64 observations deleted)
(62 observations deleted)
(60 observations deleted)
(58 observations deleted)
(56 observations deleted)
(54 observations deleted)
(52 observations deleted)
(50 observations deleted)
(48 observations deleted)
(46 observations deleted)
(44 observations deleted)
(42 observations deleted)

{com}. 
.         // Creates education unweighted network for the senate
.         nwfromedge sponsor_id cosponsid isedpair, name(senateedunwgt) keeporiginal

{txt}{it:Loading successful}
{res}{hline 50}
{txt}   Network name: {res} senateedunwgt
{txt}   Network id: {res} 4
{txt}   Directed: {res}false
{txt}   Nodes: {res}21
{txt}   Edges: {res}61
{txt}   Minimum value: {res} 0
{txt}   Maximum value: {res} 1
{txt}   Density: {res} .2904761904761905
{txt}
{com}.         
. // Restores the data to its original state      
. restore
{txt}
{com}. 
. // Confirms that all of the networks above are accessible
. nwds
{res}{txt}{col 1}senaten~dwgt{col 15}senaten~nwgt{col 29}senateedwgt{col 43}senateedun~t

{com}. 
. // Saves the networks
. nwsave $analysis/senateNetworks, replace
{res}{txt}file ~/Desktop/kyLegislation/data/clean/analysis/senateNetworks.dta saved

{com}. 
. // Close the log file
. log c building
      {txt}name:  {res}building
       {txt}log:  {res}/Users/billy/Desktop/kyLegislation/logs/createNetworks.txt
  {txt}log type:  {res}text
 {txt}closed on:  {res}14 Jul 2018, 18:41:45
{txt}{.-}

{com}. 
{txt}end of do-file

{com}. 
. // Run the script that does the analysis
. do `"$src/networkAnalytics.do"'
{txt}
{com}. // Creates a log file
. log using `"$logs/analysis.txt"', replace text name(analyze)
{txt}{.-}
      name:  {res}analyze
       {txt}log:  {res}/Users/billy/Desktop/kyLegislation/logs/analysis.txt
  {txt}log type:  {res}text
 {txt}opened on:  {res}14 Jul 2018, 18:41:45
{txt}
{com}. 
. /*
> 
> For whatever reason, it doesn't seem to be possible to save any covariates or 
> other metadata with the network in a way that it gets retained.  That said, the 
> only thing that should be needed in any of the networks is the party affiliation.
> To add that, just use one of the commands below depending on the networks being
> used at the time:
> 
> */
. 
. // Join Senate party affiliation data
. // merge 1:1 _nodelab using `"$clean/senateMembers.dta"', nogen keepus(name party)
. 
. // Join House party affiliation data
. // merge 1:1 _nodelab using `"$clean/houseMembers.dta"', nogen keepus(name party)
. 
. // Make sure any existing network data is cleared prior to creating new networks
. cap nwclear
{txt}
{com}. 
. // Open log file to store results
. log using `"$results/analysisLogs/houseResults.txt"', replace text name(house)
{txt}(note: file /Users/billy/Desktop/kyLegislation/results/analysisLogs/houseResults.txt not found)
{.-}
      name:  {res}house
       {txt}log:  {res}/Users/billy/Desktop/kyLegislation/results/analysisLogs/houseResults.txt
  {txt}log type:  {res}text
 {txt}opened on:  {res}14 Jul 2018, 18:41:45
{txt}
{com}. 
. // Loads networks into Mata and also adds Stata variables in not useful format
. nwuse `"$analysis/houseNetworks"', nwclear

{txt}{it:Loading successful}
{res}{txt}(4 networks)
{hline 20}
      {res}housenonedwgt
      {res}housenonedunwgt
      {res}houseedwgt
      {res}houseedunwgt
{txt}
{com}. 
. // Need to load each network individually and then join the attributes to the
. // data in order to label the nodes and look at party affiliations
. foreach network in $housewgt $houseunwgt {c -(}
{txt}  2{com}. 
.         // Clear the data out of Stata's memory
.         clear
{txt}  3{com}. 
.         // Display the network being iterated on
.         di as res _n(2) "The following results are for the network named `network'." _n(2)
{txt}  4{com}. 
.         // Loads the network
.         nwload `network'
{txt}  5{com}. 
.         // Joins the name and party attributes
.         $mrghouse
{txt}  6{com}.                 
.         // Print info prior to results
.         di as res _n "Summary of the Network - `network'" _n
{txt}  7{com}.         
.         // Summary of the network
.         nwsummarize `network'
{txt}  8{com}. 
.         // Iterate over the house leadership macros
.         foreach leader in $houseldrshp {c -(}
{txt}  9{com}.         
.                 // Execute the command for this leader
.                 $`leader'
{txt} 10{com}.                 
.                 // Set the value of the node id for this leader
.                 loc leaderid `r(mean)'
{txt} 11{com}. 
.                 // Test whether or not this individual has any neighbors
.                 if `r(N)' != 0 {c -(}
{txt} 12{com}.         
.                         // Print info prior to results
.                         di as res _n "Estimation of Neighbors of the House leader `leader' Based on the Network - `network'" _n
{txt} 13{com}. 
.                         // Extract the neighbors of this leader
.                         nwneighbor `network', ego(`leaderid')
{txt} 14{com}.                         
.                 {c )-} // End IF Block for node with neighbors
{txt} 15{com}.                 
.                 // Or print a message with info
.                 else di as err "House leader `leader' has no neighbors in the network `network'"
{txt} 16{com}.         
.         {c )-} // End Loop over the leadership positions to estimate neighbors
{txt} 17{com}.         
.         // Print info prior to results
.         di as res _n "Estimation of Reachability Network Based On - `network'" _n
{txt} 18{com}.         
.         // Estimate reachability network from this network
.         nwreach `network', name(`network'_reach) 
{txt} 19{com}. 
.         // Print info prior to results
.         di as res _n "Summary of the Reachability Network Estimated From - `network'" _n
{txt} 20{com}.         
.         // Summarize the reachability of the network
.         nwsummarize `network'_reach, matonly
{txt} 21{com}.         
.         // Print info prior to results
.         di as res _n "Estimation of Closeness Measures for the Network - `network'" _n
{txt} 22{com}.         
.         // Estimate closeness metrics
.         nwcloseness `network', generate(close far near) unconnected(max)
{txt} 23{com}.         
.         // Estimate Katz distance metric
.         // nwkatz `network', generate(katz)
. 
.         // Print info prior to results
.         di as res _n "Estimation of Degree Centrality Measures for the Network - `network'" _n
{txt} 24{com}.         
.         // Estimate degree centrality metric for unweighted networks
.         if regexm(`"`network'"', "un") nwdegree `network', generate(degree) isolates standardize
{txt} 25{com}. 
.         // Estimates degree centrality metric for weighted networks
.         else nwdegree `network', generate(degree) isolates standardize valued
{txt} 26{com}.         
.         // Print info prior to results
.         di as res _n "Estimation of Betweenness Centrality Measures for the Network - `network'" _n
{txt} 27{com}.         
.         // Estimate betweenness centrality
.         nwbetween `network', generate(between) standardize
{txt} 28{com}.         
.         // Print info prior to results
.         di as res _n "Estimation of Geodesic Paths for the Network - `network'" _n
{txt} 29{com}.         
.         // Estimates shortest paths between nodes
.         nwgeodesic `network', unconnected(max) 
{txt} 30{com}.         
.         // Print info prior to results
.         di as res _n "Estimation of the Number of Components in the Network - `network'" _n
{txt} 31{com}.         
.         // Estimates number of components in network
.         nwcomponents `network', generate(`network'_component)
{txt} 32{com}.         
.         // Print info prior to results
.         di as res _n "Estimation of the Largest Component in the Network - `network'" _n
{txt} 33{com}.         
.         // Estimates members of the largest component
.         nwcomponents `network', lgc generate(`network'_lgc)
{txt} 34{com}.         
.         // Print info prior to results
.         di as res _n "Estimation of Eigenvector Centrality within the Network - `network'" _n
{txt} 35{com}. 
.         // Estimates the eigenvector centrality
.         nwevcent `network', generate(`network'_eigencent)
{txt} 36{com}.                 
. {c )-} // End Loop over house networks


{res}The following results are for the network named housenonedwgt.



{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             100{txt}  
{col 5}{hline 41}

{res}Summary of the Network - housenonedwgt

{hline 50}
{txt}   Network name: {res} housenonedwgt
{txt}   Network id: {res} 4
{txt}   Directed: {res}false
{txt}   Nodes: {res}100
{txt}   Edges: {res}3833
{txt}   Minimum value: {res} 0
{txt}   Maximum value: {res} 28
{txt}   Density: {res} .7743434343434343

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          1          28           .         28         28

Estimation of Neighbors of the House leader hprotemp Based on the Network - housenonedwgt



{hline 40}
{txt}  Network: {res}housenonedwgt
{hline 40}
{txt}    Ego        : {res}28
{txt}    Neighbors  : {res}{res}1{txt} , {res}2{txt} , {res}3{txt} , {res}4{txt} , {res}5{txt} , {res}7{txt} , {res}8{txt} , {res}9{txt} , {res}10{txt} , {res}11{txt} , {res}12{txt} , {res}13{txt} , {res}14{txt} , {res}15{txt} , {res}16{txt} , {res}17{txt} , {res}18{txt} , {res}19{txt} , {res}20{txt} , {res}21{txt} , {res}22{txt} , {res}23{txt} , {res}25{txt} , {res}26{txt} , {res}27{txt} , {res}31{txt} , {res}33{txt} , {res}34{txt} , {res}35{txt} , {res}36{txt} , {res}39{txt} , {res}40{txt} , {res}41{txt} , {res}43{txt} , {res}45{txt} , {res}46{txt} , {res}47{txt} , {res}48{txt} , {res}49{txt} , {res}50{txt} , {res}51{txt} , {res}52{txt} , {res}53{txt} , {res}54{txt} , {res}55{txt} , {res}56{txt} , {res}57{txt} , {res}58{txt} , {res}59{txt} , {res}60{txt} , {res}61{txt} , {res}62{txt} , {res}63{txt} , {res}64{txt} , {res}65{txt} , {res}66{txt} , {res}67{txt} , {res}68{txt} , {res}69{txt} , {res}70{txt} , {res}72{txt} , {res}73{txt} , {res}75{txt} , {res}76{txt} , {res}77{txt} , {res}78{txt} , {res}79{txt} , {res}80{txt} , {res}81{txt} , {res}82{txt} , {res}83{txt} , {res}84{txt} , {res}85{txt} , {res}86{txt} , {res}87{txt} , {res}88{txt} , {res}89{txt} , {res}90{txt} , {res}91{txt} , {res}92{txt} , {res}93{txt} , {res}94{txt} , {res}95{txt} , {res}96{txt} , {res}97{txt} , {res}98{txt} , {res}99{txt} , {res}100
{hline 40}

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          1          55           .         55         55

Estimation of Neighbors of the House leader hmajldr Based on the Network - housenonedwgt



{hline 40}
{txt}  Network: {res}housenonedwgt
{hline 40}
{txt}    Ego        : {res}55
{txt}    Neighbors  : {res}{res}1{txt} , {res}2{txt} , {res}3{txt} , {res}4{txt} , {res}5{txt} , {res}7{txt} , {res}8{txt} , {res}9{txt} , {res}10{txt} , {res}11{txt} , {res}13{txt} , {res}14{txt} , {res}15{txt} , {res}17{txt} , {res}18{txt} , {res}19{txt} , {res}21{txt} , {res}22{txt} , {res}26{txt} , {res}27{txt} , {res}28{txt} , {res}31{txt} , {res}33{txt} , {res}34{txt} , {res}35{txt} , {res}36{txt} , {res}39{txt} , {res}41{txt} , {res}42{txt} , {res}43{txt} , {res}45{txt} , {res}46{txt} , {res}47{txt} , {res}48{txt} , {res}49{txt} , {res}50{txt} , {res}51{txt} , {res}52{txt} , {res}54{txt} , {res}56{txt} , {res}57{txt} , {res}58{txt} , {res}59{txt} , {res}60{txt} , {res}62{txt} , {res}63{txt} , {res}64{txt} , {res}65{txt} , {res}67{txt} , {res}68{txt} , {res}69{txt} , {res}70{txt} , {res}72{txt} , {res}75{txt} , {res}76{txt} , {res}77{txt} , {res}78{txt} , {res}79{txt} , {res}80{txt} , {res}81{txt} , {res}82{txt} , {res}83{txt} , {res}84{txt} , {res}85{txt} , {res}86{txt} , {res}87{txt} , {res}88{txt} , {res}89{txt} , {res}90{txt} , {res}91{txt} , {res}92{txt} , {res}93{txt} , {res}94{txt} , {res}95{txt} , {res}96{txt} , {res}97{txt} , {res}98{txt} , {res}99
{hline 40}

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          1           5           .          5          5

Estimation of Neighbors of the House leader hmajwhip Based on the Network - housenonedwgt



{hline 40}
{txt}  Network: {res}housenonedwgt
{hline 40}
{txt}    Ego        : {res}5
{txt}    Neighbors  : {res}{res}1{txt} , {res}2{txt} , {res}3{txt} , {res}4{txt} , {res}7{txt} , {res}8{txt} , {res}9{txt} , {res}10{txt} , {res}11{txt} , {res}12{txt} , {res}13{txt} , {res}14{txt} , {res}16{txt} , {res}17{txt} , {res}19{txt} , {res}21{txt} , {res}22{txt} , {res}26{txt} , {res}27{txt} , {res}28{txt} , {res}31{txt} , {res}33{txt} , {res}34{txt} , {res}35{txt} , {res}36{txt} , {res}39{txt} , {res}40{txt} , {res}41{txt} , {res}42{txt} , {res}43{txt} , {res}45{txt} , {res}46{txt} , {res}47{txt} , {res}48{txt} , {res}49{txt} , {res}50{txt} , {res}51{txt} , {res}52{txt} , {res}53{txt} , {res}54{txt} , {res}55{txt} , {res}56{txt} , {res}57{txt} , {res}58{txt} , {res}59{txt} , {res}60{txt} , {res}61{txt} , {res}62{txt} , {res}63{txt} , {res}64{txt} , {res}65{txt} , {res}66{txt} , {res}68{txt} , {res}69{txt} , {res}70{txt} , {res}72{txt} , {res}73{txt} , {res}75{txt} , {res}76{txt} , {res}77{txt} , {res}78{txt} , {res}80{txt} , {res}81{txt} , {res}82{txt} , {res}83{txt} , {res}84{txt} , {res}85{txt} , {res}86{txt} , {res}87{txt} , {res}88{txt} , {res}89{txt} , {res}90{txt} , {res}91{txt} , {res}92{txt} , {res}93{txt} , {res}94{txt} , {res}95{txt} , {res}96{txt} , {res}97{txt} , {res}98{txt} , {res}99{txt} , {res}100
{hline 40}

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          1           3           .          3          3

Estimation of Neighbors of the House leader hminldr Based on the Network - housenonedwgt



{hline 40}
{txt}  Network: {res}housenonedwgt
{hline 40}
{txt}    Ego        : {res}3
{txt}    Neighbors  : {res}{res}2{txt} , {res}4{txt} , {res}5{txt} , {res}6{txt} , {res}7{txt} , {res}9{txt} , {res}10{txt} , {res}11{txt} , {res}12{txt} , {res}13{txt} , {res}14{txt} , {res}15{txt} , {res}16{txt} , {res}17{txt} , {res}18{txt} , {res}19{txt} , {res}20{txt} , {res}21{txt} , {res}23{txt} , {res}24{txt} , {res}25{txt} , {res}26{txt} , {res}27{txt} , {res}28{txt} , {res}29{txt} , {res}30{txt} , {res}31{txt} , {res}32{txt} , {res}33{txt} , {res}34{txt} , {res}35{txt} , {res}36{txt} , {res}37{txt} , {res}38{txt} , {res}40{txt} , {res}41{txt} , {res}43{txt} , {res}44{txt} , {res}45{txt} , {res}46{txt} , {res}47{txt} , {res}48{txt} , {res}49{txt} , {res}50{txt} , {res}51{txt} , {res}52{txt} , {res}53{txt} , {res}54{txt} , {res}55{txt} , {res}56{txt} , {res}59{txt} , {res}60{txt} , {res}61{txt} , {res}62{txt} , {res}63{txt} , {res}64{txt} , {res}65{txt} , {res}66{txt} , {res}67{txt} , {res}68{txt} , {res}69{txt} , {res}70{txt} , {res}72{txt} , {res}73{txt} , {res}74{txt} , {res}75{txt} , {res}78{txt} , {res}80{txt} , {res}81{txt} , {res}82{txt} , {res}83{txt} , {res}84{txt} , {res}86{txt} , {res}87{txt} , {res}88{txt} , {res}89{txt} , {res}90{txt} , {res}91{txt} , {res}92{txt} , {res}93{txt} , {res}94{txt} , {res}95{txt} , {res}96{txt} , {res}97{txt} , {res}98{txt} , {res}99
{hline 40}

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          1          40           .         40         40

Estimation of Neighbors of the House leader hminwhip Based on the Network - housenonedwgt



{hline 40}
{txt}  Network: {res}housenonedwgt
{hline 40}
{txt}    Ego        : {res}40
{txt}    Neighbors  : {res}{res}1{txt} , {res}2{txt} , {res}3{txt} , {res}4{txt} , {res}5{txt} , {res}6{txt} , {res}7{txt} , {res}8{txt} , {res}9{txt} , {res}10{txt} , {res}11{txt} , {res}12{txt} , {res}13{txt} , {res}14{txt} , {res}15{txt} , {res}16{txt} , {res}17{txt} , {res}18{txt} , {res}19{txt} , {res}20{txt} , {res}23{txt} , {res}24{txt} , {res}25{txt} , {res}27{txt} , {res}28{txt} , {res}29{txt} , {res}30{txt} , {res}31{txt} , {res}32{txt} , {res}33{txt} , {res}34{txt} , {res}37{txt} , {res}38{txt} , {res}41{txt} , {res}42{txt} , {res}43{txt} , {res}44{txt} , {res}45{txt} , {res}46{txt} , {res}47{txt} , {res}49{txt} , {res}53{txt} , {res}54{txt} , {res}56{txt} , {res}57{txt} , {res}58{txt} , {res}59{txt} , {res}61{txt} , {res}62{txt} , {res}63{txt} , {res}64{txt} , {res}65{txt} , {res}66{txt} , {res}67{txt} , {res}68{txt} , {res}69{txt} , {res}70{txt} , {res}72{txt} , {res}73{txt} , {res}74{txt} , {res}75{txt} , {res}76{txt} , {res}77{txt} , {res}78{txt} , {res}79{txt} , {res}80{txt} , {res}81{txt} , {res}82{txt} , {res}84{txt} , {res}86{txt} , {res}87{txt} , {res}88{txt} , {res}89{txt} , {res}90{txt} , {res}91{txt} , {res}92{txt} , {res}93{txt} , {res}94{txt} , {res}95{txt} , {res}96{txt} , {res}97{txt} , {res}98{txt} , {res}99
{hline 40}

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          1           7           .          7          7

Estimation of Neighbors of the House leader hedchair Based on the Network - housenonedwgt



{hline 40}
{txt}  Network: {res}housenonedwgt
{hline 40}
{txt}    Ego        : {res}7
{txt}    Neighbors  : {res}{res}1{txt} , {res}2{txt} , {res}3{txt} , {res}4{txt} , {res}5{txt} , {res}8{txt} , {res}9{txt} , {res}10{txt} , {res}11{txt} , {res}12{txt} , {res}13{txt} , {res}14{txt} , {res}15{txt} , {res}16{txt} , {res}17{txt} , {res}18{txt} , {res}19{txt} , {res}21{txt} , {res}22{txt} , {res}23{txt} , {res}26{txt} , {res}27{txt} , {res}28{txt} , {res}31{txt} , {res}33{txt} , {res}34{txt} , {res}35{txt} , {res}36{txt} , {res}39{txt} , {res}40{txt} , {res}41{txt} , {res}42{txt} , {res}43{txt} , {res}45{txt} , {res}46{txt} , {res}47{txt} , {res}48{txt} , {res}49{txt} , {res}50{txt} , {res}51{txt} , {res}52{txt} , {res}53{txt} , {res}54{txt} , {res}55{txt} , {res}56{txt} , {res}57{txt} , {res}58{txt} , {res}59{txt} , {res}60{txt} , {res}61{txt} , {res}62{txt} , {res}63{txt} , {res}64{txt} , {res}65{txt} , {res}66{txt} , {res}67{txt} , {res}68{txt} , {res}69{txt} , {res}70{txt} , {res}72{txt} , {res}73{txt} , {res}75{txt} , {res}76{txt} , {res}77{txt} , {res}78{txt} , {res}79{txt} , {res}80{txt} , {res}81{txt} , {res}82{txt} , {res}83{txt} , {res}84{txt} , {res}85{txt} , {res}86{txt} , {res}87{txt} , {res}88{txt} , {res}89{txt} , {res}90{txt} , {res}91{txt} , {res}92{txt} , {res}93{txt} , {res}94{txt} , {res}95{txt} , {res}96{txt} , {res}97{txt} , {res}98{txt} , {res}99{txt} , {res}100
{hline 40}

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          1          95           .         95         95

Estimation of Neighbors of the House leader hedvicechair Based on the Network - housenonedwgt



{hline 40}
{txt}  Network: {res}housenonedwgt
{hline 40}
{txt}    Ego        : {res}95
{txt}    Neighbors  : {res}{res}1{txt} , {res}2{txt} , {res}3{txt} , {res}5{txt} , {res}7{txt} , {res}8{txt} , {res}9{txt} , {res}10{txt} , {res}11{txt} , {res}12{txt} , {res}14{txt} , {res}16{txt} , {res}17{txt} , {res}21{txt} , {res}22{txt} , {res}26{txt} , {res}27{txt} , {res}28{txt} , {res}33{txt} , {res}34{txt} , {res}35{txt} , {res}36{txt} , {res}39{txt} , {res}40{txt} , {res}41{txt} , {res}42{txt} , {res}43{txt} , {res}44{txt} , {res}45{txt} , {res}46{txt} , {res}47{txt} , {res}48{txt} , {res}49{txt} , {res}50{txt} , {res}51{txt} , {res}52{txt} , {res}53{txt} , {res}55{txt} , {res}56{txt} , {res}57{txt} , {res}58{txt} , {res}59{txt} , {res}60{txt} , {res}61{txt} , {res}62{txt} , {res}63{txt} , {res}64{txt} , {res}65{txt} , {res}66{txt} , {res}68{txt} , {res}69{txt} , {res}70{txt} , {res}72{txt} , {res}73{txt} , {res}75{txt} , {res}76{txt} , {res}77{txt} , {res}78{txt} , {res}80{txt} , {res}81{txt} , {res}82{txt} , {res}83{txt} , {res}84{txt} , {res}85{txt} , {res}86{txt} , {res}87{txt} , {res}88{txt} , {res}89{txt} , {res}90{txt} , {res}91{txt} , {res}92{txt} , {res}93{txt} , {res}94{txt} , {res}96{txt} , {res}97{txt} , {res}98{txt} , {res}99{txt} , {res}100
{hline 40}

Estimation of Reachability Network Based On - housenonedwgt


Summary of the Reachability Network Estimated From - housenonedwgt

{txt}[symmetric]
           1     2     3     4     5     6     7     8     9    10    11    12    13    14    15    16    17    18    19    20    21    22    23
      {c TLC}{hline 139}
    1 {c |}  {res}  0                                                                                                                                    
{txt}    2 {c |}  {res}  1     0                                                                                                                              
{txt}    3 {c |}  {res}  1     1     0                                                                                                                        
{txt}    4 {c |}  {res}  1     1     1     0                                                                                                                  
{txt}    5 {c |}  {res}  1     1     1     1     0                                                                                                            
{txt}    6 {c |}  {res}  1     1     1     1     1     0                                                                                                      
{txt}    7 {c |}  {res}  1     1     1     1     1     1     0                                                                                                
{txt}    8 {c |}  {res}  1     1     1     1     1     1     1     0                                                                                          
{txt}    9 {c |}  {res}  1     1     1     1     1     1     1     1     0                                                                                    
{txt}   10 {c |}  {res}  1     1     1     1     1     1     1     1     1     0                                                                              
{txt}   11 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     0                                                                        
{txt}   12 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     0                                                                  
{txt}   13 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     0                                                            
{txt}   14 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     0                                                      
{txt}   15 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     0                                                
{txt}   16 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0                                          
{txt}   17 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0                                    
{txt}   18 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0                              
{txt}   19 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0                        
{txt}   20 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0                  
{txt}   21 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0            
{txt}   22 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0      
{txt}   23 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0
{txt}   24 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   25 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   26 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   27 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   28 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   29 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   30 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   31 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   32 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   33 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   34 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   35 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   36 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   37 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   38 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   39 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   40 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   41 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   42 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   43 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   44 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   45 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   46 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   47 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   48 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   49 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   50 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   51 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   52 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   53 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   54 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   55 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   56 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   57 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   58 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   59 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   60 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   61 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   62 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   63 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   64 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   65 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   66 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   67 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   68 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   69 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   70 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   71 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   72 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   73 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   74 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   75 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   76 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   77 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   78 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   79 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   80 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   81 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   82 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   83 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   84 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   85 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   86 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   87 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   88 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   89 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   90 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   91 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   92 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   93 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   94 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   95 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   96 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   97 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   98 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   99 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}  100 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}      {c BLC}{hline 139}
          24    25    26    27    28    29    30    31    32    33    34    35    36    37    38    39    40    41    42    43    44    45    46
       {hline 139}
   24    {res}  0                                                                                                                                    
{txt}   25    {res}  1     0                                                                                                                              
{txt}   26    {res}  1     1     0                                                                                                                        
{txt}   27    {res}  1     1     1     0                                                                                                                  
{txt}   28    {res}  1     1     1     1     0                                                                                                            
{txt}   29    {res}  1     1     1     1     1     0                                                                                                      
{txt}   30    {res}  1     1     1     1     1     1     0                                                                                                
{txt}   31    {res}  1     1     1     1     1     1     1     0                                                                                          
{txt}   32    {res}  1     1     1     1     1     1     1     1     0                                                                                    
{txt}   33    {res}  1     1     1     1     1     1     1     1     1     0                                                                              
{txt}   34    {res}  1     1     1     1     1     1     1     1     1     1     0                                                                        
{txt}   35    {res}  1     1     1     1     1     1     1     1     1     1     1     0                                                                  
{txt}   36    {res}  1     1     1     1     1     1     1     1     1     1     1     1     0                                                            
{txt}   37    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     0                                                      
{txt}   38    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     0                                                
{txt}   39    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0                                          
{txt}   40    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0                                    
{txt}   41    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0                              
{txt}   42    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0                        
{txt}   43    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0                  
{txt}   44    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0            
{txt}   45    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0      
{txt}   46    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0
{txt}   47    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   48    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   49    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   50    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   51    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   52    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   53    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   54    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   55    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   56    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   57    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   58    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   59    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   60    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   61    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   62    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   63    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   64    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   65    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   66    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   67    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   68    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   69    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   70    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   71    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   72    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   73    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   74    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   75    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   76    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   77    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   78    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   79    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   80    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   81    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   82    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   83    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   84    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   85    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   86    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   87    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   88    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   89    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   90    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   91    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   92    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   93    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   94    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   95    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   96    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   97    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   98    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   99    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}  100    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}       {hline 139}
          47    48    49    50    51    52    53    54    55    56    57    58    59    60    61    62    63    64    65    66    67    68    69
       {hline 139}
   47    {res}  0                                                                                                                                    
{txt}   48    {res}  1     0                                                                                                                              
{txt}   49    {res}  1     1     0                                                                                                                        
{txt}   50    {res}  1     1     1     0                                                                                                                  
{txt}   51    {res}  1     1     1     1     0                                                                                                            
{txt}   52    {res}  1     1     1     1     1     0                                                                                                      
{txt}   53    {res}  1     1     1     1     1     1     0                                                                                                
{txt}   54    {res}  1     1     1     1     1     1     1     0                                                                                          
{txt}   55    {res}  1     1     1     1     1     1     1     1     0                                                                                    
{txt}   56    {res}  1     1     1     1     1     1     1     1     1     0                                                                              
{txt}   57    {res}  1     1     1     1     1     1     1     1     1     1     0                                                                        
{txt}   58    {res}  1     1     1     1     1     1     1     1     1     1     1     0                                                                  
{txt}   59    {res}  1     1     1     1     1     1     1     1     1     1     1     1     0                                                            
{txt}   60    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     0                                                      
{txt}   61    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     0                                                
{txt}   62    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0                                          
{txt}   63    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0                                    
{txt}   64    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0                              
{txt}   65    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0                        
{txt}   66    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0                  
{txt}   67    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0            
{txt}   68    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0      
{txt}   69    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0
{txt}   70    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   71    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   72    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   73    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   74    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   75    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   76    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   77    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   78    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   79    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   80    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   81    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   82    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   83    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   84    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   85    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   86    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   87    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   88    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   89    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   90    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   91    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   92    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   93    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   94    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   95    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   96    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   97    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   98    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   99    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}  100    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}       {hline 139}
          70    71    72    73    74    75    76    77    78    79    80    81    82    83    84    85    86    87    88    89    90    91    92
       {hline 139}
   70    {res}  0                                                                                                                                    
{txt}   71    {res}  1     0                                                                                                                              
{txt}   72    {res}  1     1     0                                                                                                                        
{txt}   73    {res}  1     1     1     0                                                                                                                  
{txt}   74    {res}  1     1     1     1     0                                                                                                            
{txt}   75    {res}  1     1     1     1     1     0                                                                                                      
{txt}   76    {res}  1     1     1     1     1     1     0                                                                                                
{txt}   77    {res}  1     1     1     1     1     1     1     0                                                                                          
{txt}   78    {res}  1     1     1     1     1     1     1     1     0                                                                                    
{txt}   79    {res}  1     1     1     1     1     1     1     1     1     0                                                                              
{txt}   80    {res}  1     1     1     1     1     1     1     1     1     1     0                                                                        
{txt}   81    {res}  1     1     1     1     1     1     1     1     1     1     1     0                                                                  
{txt}   82    {res}  1     1     1     1     1     1     1     1     1     1     1     1     0                                                            
{txt}   83    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     0                                                      
{txt}   84    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     0                                                
{txt}   85    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0                                          
{txt}   86    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0                                    
{txt}   87    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0                              
{txt}   88    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0                        
{txt}   89    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0                  
{txt}   90    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0            
{txt}   91    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0      
{txt}   92    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0
{txt}   93    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   94    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   95    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   96    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   97    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   98    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   99    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}  100    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}       {hline 139}
          93    94    95    96    97    98    99   100
       {hline 49}{c TRC}
   93    {res}  0                                          {txt}  {c |}
   94    {res}  1     0                                    {txt}  {c |}
   95    {res}  1     1     0                              {txt}  {c |}
   96    {res}  1     1     1     0                        {txt}  {c |}
   97    {res}  1     1     1     1     0                  {txt}  {c |}
   98    {res}  1     1     1     1     1     0            {txt}  {c |}
   99    {res}  1     1     1     1     1     1     0      {txt}  {c |}
  100    {res}  1     1     1     1     1     1     1     0{txt}  {c |}
       {hline 49}{c BRC}

{res}Estimation of Closeness Measures for the Network - housenonedwgt

{hline 40}
{txt}  Network name: {res}housenonedwgt
{hline 40}
{txt}    Closeness centrality

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 7}close {c |}{res}        100    .8281039    .0948352   .5469613        .99
{txt}{space 9}far {c |}{res}        100      121.34    15.98498        100        181
{txt}{space 8}near {c |}{res}        100    .0083647    .0009579   .0055249        .01

Estimation of Degree Centrality Measures for the Network - housenonedwgt

{hline 40}
{txt}  Network name: {res}housenonedwgt
{hline 40}
{txt}    Degree distribution

     degree {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
   .2323232 {c |}{res}          1        1.00        1.00
{txt}   .4444444 {c |}{res}          1        1.00        2.00
{txt}   .7171717 {c |}{res}          1        1.00        3.00
{txt}   .7878788 {c |}{res}          1        1.00        4.00
{txt}   .7979798 {c |}{res}          1        1.00        5.00
{txt}   1.131313 {c |}{res}          1        1.00        6.00
{txt}   1.191919 {c |}{res}          1        1.00        7.00
{txt}    1.20202 {c |}{res}          1        1.00        8.00
{txt}   1.242424 {c |}{res}          1        1.00        9.00
{txt}   1.252525 {c |}{res}          1        1.00       10.00
{txt}   1.323232 {c |}{res}          2        2.00       12.00
{txt}   1.373737 {c |}{res}          1        1.00       13.00
{txt}   1.393939 {c |}{res}          2        2.00       15.00
{txt}   1.464646 {c |}{res}          1        1.00       16.00
{txt}   1.474747 {c |}{res}          1        1.00       17.00
{txt}   1.535354 {c |}{res}          1        1.00       18.00
{txt}   1.545455 {c |}{res}          1        1.00       19.00
{txt}   1.585859 {c |}{res}          1        1.00       20.00
{txt}   1.616162 {c |}{res}          1        1.00       21.00
{txt}   1.626263 {c |}{res}          1        1.00       22.00
{txt}   1.636364 {c |}{res}          2        2.00       24.00
{txt}   1.646465 {c |}{res}          1        1.00       25.00
{txt}   1.676768 {c |}{res}          1        1.00       26.00
{txt}   1.777778 {c |}{res}          1        1.00       27.00
{txt}   1.868687 {c |}{res}          2        2.00       29.00
{txt}   1.888889 {c |}{res}          2        2.00       31.00
{txt}   1.919192 {c |}{res}          1        1.00       32.00
{txt}   1.979798 {c |}{res}          1        1.00       33.00
{txt}   2.010101 {c |}{res}          1        1.00       34.00
{txt}   2.020202 {c |}{res}          1        1.00       35.00
{txt}   2.141414 {c |}{res}          3        3.00       38.00
{txt}   2.191919 {c |}{res}          1        1.00       39.00
{txt}   2.212121 {c |}{res}          1        1.00       40.00
{txt}   2.262626 {c |}{res}          2        2.00       42.00
{txt}   2.383838 {c |}{res}          1        1.00       43.00
{txt}   2.414141 {c |}{res}          2        2.00       45.00
{txt}   2.434343 {c |}{res}          1        1.00       46.00
{txt}   2.515152 {c |}{res}          1        1.00       47.00
{txt}   2.525253 {c |}{res}          1        1.00       48.00
{txt}    2.59596 {c |}{res}          1        1.00       49.00
{txt}   2.616162 {c |}{res}          1        1.00       50.00
{txt}   2.626263 {c |}{res}          2        2.00       52.00
{txt}   2.727273 {c |}{res}          1        1.00       53.00
{txt}   2.767677 {c |}{res}          1        1.00       54.00
{txt}   2.787879 {c |}{res}          1        1.00       55.00
{txt}    2.79798 {c |}{res}          1        1.00       56.00
{txt}   2.808081 {c |}{res}          1        1.00       57.00
{txt}   2.838384 {c |}{res}          1        1.00       58.00
{txt}   2.858586 {c |}{res}          2        2.00       60.00
{txt}   2.868687 {c |}{res}          2        2.00       62.00
{txt}    2.89899 {c |}{res}          2        2.00       64.00
{txt}   2.929293 {c |}{res}          1        1.00       65.00
{txt}   2.959596 {c |}{res}          1        1.00       66.00
{txt}   2.989899 {c |}{res}          1        1.00       67.00
{txt}   3.040404 {c |}{res}          1        1.00       68.00
{txt}   3.070707 {c |}{res}          1        1.00       69.00
{txt}   3.191919 {c |}{res}          1        1.00       70.00
{txt}   3.242424 {c |}{res}          2        2.00       72.00
{txt}    3.30303 {c |}{res}          1        1.00       73.00
{txt}   3.333333 {c |}{res}          1        1.00       74.00
{txt}   3.484848 {c |}{res}          1        1.00       75.00
{txt}    3.50505 {c |}{res}          1        1.00       76.00
{txt}   3.565657 {c |}{res}          1        1.00       77.00
{txt}   3.606061 {c |}{res}          1        1.00       78.00
{txt}   3.636364 {c |}{res}          1        1.00       79.00
{txt}   3.656566 {c |}{res}          1        1.00       80.00
{txt}   3.686869 {c |}{res}          1        1.00       81.00
{txt}    3.69697 {c |}{res}          1        1.00       82.00
{txt}   3.858586 {c |}{res}          1        1.00       83.00
{txt}   3.888889 {c |}{res}          1        1.00       84.00
{txt}   3.909091 {c |}{res}          1        1.00       85.00
{txt}   3.939394 {c |}{res}          2        2.00       87.00
{txt}   4.070707 {c |}{res}          1        1.00       88.00
{txt}   4.343434 {c |}{res}          1        1.00       89.00
{txt}   4.383838 {c |}{res}          1        1.00       90.00
{txt}    4.40404 {c |}{res}          1        1.00       91.00
{txt}   4.434343 {c |}{res}          1        1.00       92.00
{txt}   4.454545 {c |}{res}          1        1.00       93.00
{txt}   4.666667 {c |}{res}          1        1.00       94.00
{txt}   4.737374 {c |}{res}          1        1.00       95.00
{txt}   4.808081 {c |}{res}          1        1.00       96.00
{txt}   4.959596 {c |}{res}          1        1.00       97.00
{txt}   5.111111 {c |}{res}          1        1.00       98.00
{txt}   5.535354 {c |}{res}          1        1.00       99.00
{txt}    5.89899 {c |}{res}          1        1.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        100      100.00

{txt}   Degree centralization:: {res}3.300556586270872

Estimation of Betweenness Centrality Measures for the Network - housenonedwgt

{hline 40}
{txt}  Network name: {res}housenonedwgt
{hline 40}
{txt}    Betweenness centrality
{txt}    (standardized)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}between {c |}{res}        100    .0046052    .0034175   8.96e-06   .0145835

Estimation of Geodesic Paths for the Network - housenonedwgt

{hline 40}
{txt}  Network name: {res}housenonedwgt
{txt}  Network of shortest paths: {res}geodesic
{hline 40}
{txt}    Nodes: {res}100
{txt}    Symmetrized : {res}1
    {hline 36}
{txt}    Paths (largest component) : {res}4950
{txt}    Diameter (largest component): {res}2
{txt}    Average shortest path (largest component): {res}1.225656565656566

Estimation of the Number of Components in the Network - housenonedwgt

{hline 40}
{txt}  Network name: {res}housenonedwgt
{txt}  Components: {res}1

{txt}housenonedw {c |}
gt_componen {c |}
          t {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}        100      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        100      100.00
 
 

Estimation of the Largest Component in the Network - housenonedwgt

{hline 40}
{txt}  Network name: {res}housenonedwgt
{txt}  Components: {res}1

{txt}housenonedw {c |}
     gt_lgc {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}        100      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        100      100.00
 
 

Estimation of Eigenvector Centrality within the Network - housenonedwgt

{hline 40}
{txt}  Network name: {res}housenonedwgt
{hline 40}
{txt}    Eigenvector centrality

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
houseno~cent {c |}{res}        100    .0977956    .0209865   .0208974    .120216


The following results are for the network named houseedwgt.



{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}              43
{txt}{col 9}from master{col 30}{res}               0{txt}  
{col 9}from using{col 30}{res}              43{txt}  

{col 5}matched{col 30}{res}              57{txt}  
{col 5}{hline 41}

{res}Summary of the Network - houseedwgt

{hline 50}
{txt}   Network name: {res} houseedwgt
{txt}   Network id: {res} 6
{txt}   Directed: {res}false
{txt}   Nodes: {res}57
{txt}   Edges: {res}389
{txt}   Minimum value: {res} 0
{txt}   Maximum value: {res} 4
{txt}   Density: {res} .243734335839599

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          1          17           .         17         17

Estimation of Neighbors of the House leader hprotemp Based on the Network - houseedwgt



{hline 40}
{txt}  Network: {res}houseedwgt
{hline 40}
{txt}    Ego        : {res}17
{txt}    Neighbors  : {res}{res}3{txt} , {res}9{txt} , {res}12{txt} , {res}20{txt} , {res}22{txt} , {res}28{txt} , {res}30{txt} , {res}32{txt} , {res}38{txt} , {res}39{txt} , {res}43{txt} , {res}49{txt} , {res}53
{hline 40}

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          1          30           .         30         30

Estimation of Neighbors of the House leader hmajldr Based on the Network - houseedwgt



{hline 40}
{txt}  Network: {res}houseedwgt
{hline 40}
{txt}    Ego        : {res}30
{txt}    Neighbors  : {res}{res}3{txt} , {res}9{txt} , {res}12{txt} , {res}17{txt} , {res}20{txt} , {res}22{txt} , {res}28{txt} , {res}32{txt} , {res}38{txt} , {res}39{txt} , {res}43{txt} , {res}49{txt} , {res}53
{hline 40}

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          0
{err}House leader hmajwhip has no neighbors in the network houseedwgt

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          1           1           .          1          1

Estimation of Neighbors of the House leader hminldr Based on the Network - houseedwgt



{hline 40}
{txt}  Network: {res}houseedwgt
{hline 40}
{txt}    Ego        : {res}1
{txt}    Neighbors  : {res}{res}2{txt} , {res}5{txt} , {res}8{txt} , {res}9{txt} , {res}12{txt} , {res}16{txt} , {res}20{txt} , {res}21{txt} , {res}31{txt} , {res}36{txt} , {res}40{txt} , {res}44{txt} , {res}48{txt} , {res}56{txt} , {res}57
{hline 40}

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          0
{err}House leader hminwhip has no neighbors in the network houseedwgt

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          1           3           .          3          3

Estimation of Neighbors of the House leader hedchair Based on the Network - houseedwgt



{hline 40}
{txt}  Network: {res}houseedwgt
{hline 40}
{txt}    Ego        : {res}3
{txt}    Neighbors  : {res}{res}4{txt} , {res}9{txt} , {res}10{txt} , {res}12{txt} , {res}17{txt} , {res}20{txt} , {res}22{txt} , {res}26{txt} , {res}27{txt} , {res}28{txt} , {res}30{txt} , {res}32{txt} , {res}34{txt} , {res}38{txt} , {res}39{txt} , {res}42{txt} , {res}43{txt} , {res}44{txt} , {res}45{txt} , {res}47{txt} , {res}49{txt} , {res}51{txt} , {res}52{txt} , {res}53{txt} , {res}54{txt} , {res}55
{hline 40}

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          1          54           .         54         54

Estimation of Neighbors of the House leader hedvicechair Based on the Network - houseedwgt



{hline 40}
{txt}  Network: {res}houseedwgt
{hline 40}
{txt}    Ego        : {res}54
{txt}    Neighbors  : {res}{res}3{txt} , {res}9{txt} , {res}10{txt} , {res}42{txt} , {res}43{txt} , {res}44{txt} , {res}45{txt} , {res}49
{hline 40}

Estimation of Reachability Network Based On - houseedwgt


Summary of the Reachability Network Estimated From - houseedwgt

{txt}[symmetric]
         1    2    3    4    5    6    7    8    9   10   11   12   13   14   15   16   17   18   19   20   21   22   23   24   25   26   27   28
     {c TLC}{hline 141}
   1 {c |}  {res} 0                                                                                                                                       
{txt}   2 {c |}  {res} 1    0                                                                                                                                  
{txt}   3 {c |}  {res} 1    1    0                                                                                                                             
{txt}   4 {c |}  {res} 1    1    1    0                                                                                                                        
{txt}   5 {c |}  {res} 1    1    1    1    0                                                                                                                   
{txt}   6 {c |}  {res} 1    1    1    1    1    0                                                                                                              
{txt}   7 {c |}  {res} 1    1    1    1    1    1    0                                                                                                         
{txt}   8 {c |}  {res} 1    1    1    1    1    1    1    0                                                                                                    
{txt}   9 {c |}  {res} 1    1    1    1    1    1    1    1    0                                                                                               
{txt}  10 {c |}  {res} 1    1    1    1    1    1    1    1    1    0                                                                                          
{txt}  11 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    0                                                                                     
{txt}  12 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    0                                                                                
{txt}  13 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    0                                                                           
{txt}  14 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    0                                                                      
{txt}  15 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                                                                 
{txt}  16 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                                                            
{txt}  17 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                                                       
{txt}  18 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                                                  
{txt}  19 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                                             
{txt}  20 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                                        
{txt}  21 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                                   
{txt}  22 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                              
{txt}  23 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                         
{txt}  24 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                    
{txt}  25 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0               
{txt}  26 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0          
{txt}  27 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0     
{txt}  28 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0
{txt}  29 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  30 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  31 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  32 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  33 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  34 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  35 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  36 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  37 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  38 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  39 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  40 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  41 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  42 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  43 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  44 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  45 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  46 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  47 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  48 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  49 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  50 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  51 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  52 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  53 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  54 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  55 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  56 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  57 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}     {c BLC}{hline 141}
        29   30   31   32   33   34   35   36   37   38   39   40   41   42   43   44   45   46   47   48   49   50   51   52   53   54   55   56
      {hline 141}
  29    {res} 0                                                                                                                                       
{txt}  30    {res} 1    0                                                                                                                                  
{txt}  31    {res} 1    1    0                                                                                                                             
{txt}  32    {res} 1    1    1    0                                                                                                                        
{txt}  33    {res} 1    1    1    1    0                                                                                                                   
{txt}  34    {res} 1    1    1    1    1    0                                                                                                              
{txt}  35    {res} 1    1    1    1    1    1    0                                                                                                         
{txt}  36    {res} 1    1    1    1    1    1    1    0                                                                                                    
{txt}  37    {res} 1    1    1    1    1    1    1    1    0                                                                                               
{txt}  38    {res} 1    1    1    1    1    1    1    1    1    0                                                                                          
{txt}  39    {res} 1    1    1    1    1    1    1    1    1    1    0                                                                                     
{txt}  40    {res} 1    1    1    1    1    1    1    1    1    1    1    0                                                                                
{txt}  41    {res} 1    1    1    1    1    1    1    1    1    1    1    1    0                                                                           
{txt}  42    {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    0                                                                      
{txt}  43    {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                                                                 
{txt}  44    {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                                                            
{txt}  45    {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                                                       
{txt}  46    {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                                                  
{txt}  47    {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                                             
{txt}  48    {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                                        
{txt}  49    {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                                   
{txt}  50    {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                              
{txt}  51    {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                         
{txt}  52    {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                    
{txt}  53    {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0               
{txt}  54    {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0          
{txt}  55    {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0     
{txt}  56    {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0
{txt}  57    {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}      {hline 141}
        57
      {hline 6}{c TRC}
  57    {res} 0{txt}  {c |}
      {hline 6}{c BRC}

{res}Estimation of Closeness Measures for the Network - houseedwgt

{hline 40}
{txt}  Network name: {res}houseedwgt
{hline 40}
{txt}    Closeness centrality

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 7}close {c |}{res}         57    .5112764     .090133   .3146068   .7466667
{txt}{space 9}far {c |}{res}         57    113.1579    21.72539         75        178
{txt}{space 8}near {c |}{res}         57    .0091299    .0016095    .005618   .0133333

Estimation of Degree Centrality Measures for the Network - houseedwgt

{hline 40}
{txt}  Network name: {res}houseedwgt
{hline 40}
{txt}    Degree distribution

     degree {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
   .0178571 {c |}{res}          1        1.75        1.75
{txt}   .0357143 {c |}{res}          5        8.77       10.53
{txt}   .0714286 {c |}{res}          1        1.75       12.28
{txt}   .1071429 {c |}{res}          3        5.26       17.54
{txt}   .1428571 {c |}{res}          4        7.02       24.56
{txt}   .1607143 {c |}{res}          6       10.53       35.09
{txt}   .1785714 {c |}{res}          2        3.51       38.60
{txt}   .1964286 {c |}{res}          3        5.26       43.86
{txt}   .2321429 {c |}{res}          4        7.02       50.88
{txt}        .25 {c |}{res}          1        1.75       52.63
{txt}   .2678571 {c |}{res}          9       15.79       68.42
{txt}   .2857143 {c |}{res}          2        3.51       71.93
{txt}   .3035714 {c |}{res}          1        1.75       73.68
{txt}   .3392857 {c |}{res}          1        1.75       75.44
{txt}       .375 {c |}{res}          1        1.75       77.19
{txt}   .4285714 {c |}{res}          3        5.26       82.46
{txt}   .4464286 {c |}{res}          1        1.75       84.21
{txt}   .5178571 {c |}{res}          1        1.75       85.96
{txt}       .625 {c |}{res}          1        1.75       87.72
{txt}   .6428571 {c |}{res}          2        3.51       91.23
{txt}   .6607143 {c |}{res}          2        3.51       94.74
{txt}   .6964286 {c |}{res}          2        3.51       98.25
{txt}   .9821429 {c |}{res}          1        1.75      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}         57      100.00

{txt}   Degree centralization:: {res}.725

Estimation of Betweenness Centrality Measures for the Network - houseedwgt

{hline 40}
{txt}  Network name: {res}houseedwgt
{hline 40}
{txt}    Betweenness centrality
{txt}    (standardized)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}between {c |}{res}         57    .0371155    .0716691          0   .3570728

Estimation of Geodesic Paths for the Network - houseedwgt

{hline 40}
{txt}  Network name: {res}houseedwgt
{txt}  Network of shortest paths: {res}geodesic_1
{hline 40}
{txt}    Nodes: {res}57
{txt}    Symmetrized : {res}1
    {hline 36}
{txt}    Paths (largest component) : {res}1596
{txt}    Diameter (largest component): {res}5
{txt}    Average shortest path (largest component): {res}2.020676691729324

Estimation of the Number of Components in the Network - houseedwgt

{hline 40}
{txt}  Network name: {res}houseedwgt
{txt}  Components: {res}1

{txt}houseedwgt_ {c |}
  component {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}         57      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}         57      100.00
 
 

Estimation of the Largest Component in the Network - houseedwgt

{hline 40}
{txt}  Network name: {res}houseedwgt
{txt}  Components: {res}1

{txt}houseedwgt_ {c |}
        lgc {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}         57      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}         57      100.00
 
 

Estimation of Eigenvector Centrality within the Network - houseedwgt

{hline 40}
{txt}  Network name: {res}houseedwgt
{hline 40}
{txt}    Eigenvector centrality

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
houseed~cent {c |}{res}         57    .1118915    .0715113   .0030895   .2864549


The following results are for the network named housenonedunwgt.



{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             100{txt}  
{col 5}{hline 41}

{res}Summary of the Network - housenonedunwgt

{hline 50}
{txt}   Network name: {res} housenonedunwgt
{txt}   Network id: {res} 8
{txt}   Directed: {res}false
{txt}   Nodes: {res}100
{txt}   Edges: {res}3833
{txt}   Minimum value: {res} 0
{txt}   Maximum value: {res} 1
{txt}   Density: {res} .7743434343434343

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          1          28           .         28         28

Estimation of Neighbors of the House leader hprotemp Based on the Network - housenonedunwgt



{hline 40}
{txt}  Network: {res}housenonedunwgt
{hline 40}
{txt}    Ego        : {res}28
{txt}    Neighbors  : {res}{res}1{txt} , {res}2{txt} , {res}3{txt} , {res}4{txt} , {res}5{txt} , {res}7{txt} , {res}8{txt} , {res}9{txt} , {res}10{txt} , {res}11{txt} , {res}12{txt} , {res}13{txt} , {res}14{txt} , {res}15{txt} , {res}16{txt} , {res}17{txt} , {res}18{txt} , {res}19{txt} , {res}20{txt} , {res}21{txt} , {res}22{txt} , {res}23{txt} , {res}25{txt} , {res}26{txt} , {res}27{txt} , {res}31{txt} , {res}33{txt} , {res}34{txt} , {res}35{txt} , {res}36{txt} , {res}39{txt} , {res}40{txt} , {res}41{txt} , {res}43{txt} , {res}45{txt} , {res}46{txt} , {res}47{txt} , {res}48{txt} , {res}49{txt} , {res}50{txt} , {res}51{txt} , {res}52{txt} , {res}53{txt} , {res}54{txt} , {res}55{txt} , {res}56{txt} , {res}57{txt} , {res}58{txt} , {res}59{txt} , {res}60{txt} , {res}61{txt} , {res}62{txt} , {res}63{txt} , {res}64{txt} , {res}65{txt} , {res}66{txt} , {res}67{txt} , {res}68{txt} , {res}69{txt} , {res}70{txt} , {res}72{txt} , {res}73{txt} , {res}75{txt} , {res}76{txt} , {res}77{txt} , {res}78{txt} , {res}79{txt} , {res}80{txt} , {res}81{txt} , {res}82{txt} , {res}83{txt} , {res}84{txt} , {res}85{txt} , {res}86{txt} , {res}87{txt} , {res}88{txt} , {res}89{txt} , {res}90{txt} , {res}91{txt} , {res}92{txt} , {res}93{txt} , {res}94{txt} , {res}95{txt} , {res}96{txt} , {res}97{txt} , {res}98{txt} , {res}99{txt} , {res}100
{hline 40}

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          1          55           .         55         55

Estimation of Neighbors of the House leader hmajldr Based on the Network - housenonedunwgt



{hline 40}
{txt}  Network: {res}housenonedunwgt
{hline 40}
{txt}    Ego        : {res}55
{txt}    Neighbors  : {res}{res}1{txt} , {res}2{txt} , {res}3{txt} , {res}4{txt} , {res}5{txt} , {res}7{txt} , {res}8{txt} , {res}9{txt} , {res}10{txt} , {res}11{txt} , {res}13{txt} , {res}14{txt} , {res}15{txt} , {res}17{txt} , {res}18{txt} , {res}19{txt} , {res}21{txt} , {res}22{txt} , {res}26{txt} , {res}27{txt} , {res}28{txt} , {res}31{txt} , {res}33{txt} , {res}34{txt} , {res}35{txt} , {res}36{txt} , {res}39{txt} , {res}41{txt} , {res}42{txt} , {res}43{txt} , {res}45{txt} , {res}46{txt} , {res}47{txt} , {res}48{txt} , {res}49{txt} , {res}50{txt} , {res}51{txt} , {res}52{txt} , {res}54{txt} , {res}56{txt} , {res}57{txt} , {res}58{txt} , {res}59{txt} , {res}60{txt} , {res}62{txt} , {res}63{txt} , {res}64{txt} , {res}65{txt} , {res}67{txt} , {res}68{txt} , {res}69{txt} , {res}70{txt} , {res}72{txt} , {res}75{txt} , {res}76{txt} , {res}77{txt} , {res}78{txt} , {res}79{txt} , {res}80{txt} , {res}81{txt} , {res}82{txt} , {res}83{txt} , {res}84{txt} , {res}85{txt} , {res}86{txt} , {res}87{txt} , {res}88{txt} , {res}89{txt} , {res}90{txt} , {res}91{txt} , {res}92{txt} , {res}93{txt} , {res}94{txt} , {res}95{txt} , {res}96{txt} , {res}97{txt} , {res}98{txt} , {res}99
{hline 40}

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          1           5           .          5          5

Estimation of Neighbors of the House leader hmajwhip Based on the Network - housenonedunwgt



{hline 40}
{txt}  Network: {res}housenonedunwgt
{hline 40}
{txt}    Ego        : {res}5
{txt}    Neighbors  : {res}{res}1{txt} , {res}2{txt} , {res}3{txt} , {res}4{txt} , {res}7{txt} , {res}8{txt} , {res}9{txt} , {res}10{txt} , {res}11{txt} , {res}12{txt} , {res}13{txt} , {res}14{txt} , {res}16{txt} , {res}17{txt} , {res}19{txt} , {res}21{txt} , {res}22{txt} , {res}26{txt} , {res}27{txt} , {res}28{txt} , {res}31{txt} , {res}33{txt} , {res}34{txt} , {res}35{txt} , {res}36{txt} , {res}39{txt} , {res}40{txt} , {res}41{txt} , {res}42{txt} , {res}43{txt} , {res}45{txt} , {res}46{txt} , {res}47{txt} , {res}48{txt} , {res}49{txt} , {res}50{txt} , {res}51{txt} , {res}52{txt} , {res}53{txt} , {res}54{txt} , {res}55{txt} , {res}56{txt} , {res}57{txt} , {res}58{txt} , {res}59{txt} , {res}60{txt} , {res}61{txt} , {res}62{txt} , {res}63{txt} , {res}64{txt} , {res}65{txt} , {res}66{txt} , {res}68{txt} , {res}69{txt} , {res}70{txt} , {res}72{txt} , {res}73{txt} , {res}75{txt} , {res}76{txt} , {res}77{txt} , {res}78{txt} , {res}80{txt} , {res}81{txt} , {res}82{txt} , {res}83{txt} , {res}84{txt} , {res}85{txt} , {res}86{txt} , {res}87{txt} , {res}88{txt} , {res}89{txt} , {res}90{txt} , {res}91{txt} , {res}92{txt} , {res}93{txt} , {res}94{txt} , {res}95{txt} , {res}96{txt} , {res}97{txt} , {res}98{txt} , {res}99{txt} , {res}100
{hline 40}

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          1           3           .          3          3

Estimation of Neighbors of the House leader hminldr Based on the Network - housenonedunwgt



{hline 40}
{txt}  Network: {res}housenonedunwgt
{hline 40}
{txt}    Ego        : {res}3
{txt}    Neighbors  : {res}{res}2{txt} , {res}4{txt} , {res}5{txt} , {res}6{txt} , {res}7{txt} , {res}9{txt} , {res}10{txt} , {res}11{txt} , {res}12{txt} , {res}13{txt} , {res}14{txt} , {res}15{txt} , {res}16{txt} , {res}17{txt} , {res}18{txt} , {res}19{txt} , {res}20{txt} , {res}21{txt} , {res}23{txt} , {res}24{txt} , {res}25{txt} , {res}26{txt} , {res}27{txt} , {res}28{txt} , {res}29{txt} , {res}30{txt} , {res}31{txt} , {res}32{txt} , {res}33{txt} , {res}34{txt} , {res}35{txt} , {res}36{txt} , {res}37{txt} , {res}38{txt} , {res}40{txt} , {res}41{txt} , {res}43{txt} , {res}44{txt} , {res}45{txt} , {res}46{txt} , {res}47{txt} , {res}48{txt} , {res}49{txt} , {res}50{txt} , {res}51{txt} , {res}52{txt} , {res}53{txt} , {res}54{txt} , {res}55{txt} , {res}56{txt} , {res}59{txt} , {res}60{txt} , {res}61{txt} , {res}62{txt} , {res}63{txt} , {res}64{txt} , {res}65{txt} , {res}66{txt} , {res}67{txt} , {res}68{txt} , {res}69{txt} , {res}70{txt} , {res}72{txt} , {res}73{txt} , {res}74{txt} , {res}75{txt} , {res}78{txt} , {res}80{txt} , {res}81{txt} , {res}82{txt} , {res}83{txt} , {res}84{txt} , {res}86{txt} , {res}87{txt} , {res}88{txt} , {res}89{txt} , {res}90{txt} , {res}91{txt} , {res}92{txt} , {res}93{txt} , {res}94{txt} , {res}95{txt} , {res}96{txt} , {res}97{txt} , {res}98{txt} , {res}99
{hline 40}

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          1          40           .         40         40

Estimation of Neighbors of the House leader hminwhip Based on the Network - housenonedunwgt



{hline 40}
{txt}  Network: {res}housenonedunwgt
{hline 40}
{txt}    Ego        : {res}40
{txt}    Neighbors  : {res}{res}1{txt} , {res}2{txt} , {res}3{txt} , {res}4{txt} , {res}5{txt} , {res}6{txt} , {res}7{txt} , {res}8{txt} , {res}9{txt} , {res}10{txt} , {res}11{txt} , {res}12{txt} , {res}13{txt} , {res}14{txt} , {res}15{txt} , {res}16{txt} , {res}17{txt} , {res}18{txt} , {res}19{txt} , {res}20{txt} , {res}23{txt} , {res}24{txt} , {res}25{txt} , {res}27{txt} , {res}28{txt} , {res}29{txt} , {res}30{txt} , {res}31{txt} , {res}32{txt} , {res}33{txt} , {res}34{txt} , {res}37{txt} , {res}38{txt} , {res}41{txt} , {res}42{txt} , {res}43{txt} , {res}44{txt} , {res}45{txt} , {res}46{txt} , {res}47{txt} , {res}49{txt} , {res}53{txt} , {res}54{txt} , {res}56{txt} , {res}57{txt} , {res}58{txt} , {res}59{txt} , {res}61{txt} , {res}62{txt} , {res}63{txt} , {res}64{txt} , {res}65{txt} , {res}66{txt} , {res}67{txt} , {res}68{txt} , {res}69{txt} , {res}70{txt} , {res}72{txt} , {res}73{txt} , {res}74{txt} , {res}75{txt} , {res}76{txt} , {res}77{txt} , {res}78{txt} , {res}79{txt} , {res}80{txt} , {res}81{txt} , {res}82{txt} , {res}84{txt} , {res}86{txt} , {res}87{txt} , {res}88{txt} , {res}89{txt} , {res}90{txt} , {res}91{txt} , {res}92{txt} , {res}93{txt} , {res}94{txt} , {res}95{txt} , {res}96{txt} , {res}97{txt} , {res}98{txt} , {res}99
{hline 40}

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          1           7           .          7          7

Estimation of Neighbors of the House leader hedchair Based on the Network - housenonedunwgt



{hline 40}
{txt}  Network: {res}housenonedunwgt
{hline 40}
{txt}    Ego        : {res}7
{txt}    Neighbors  : {res}{res}1{txt} , {res}2{txt} , {res}3{txt} , {res}4{txt} , {res}5{txt} , {res}8{txt} , {res}9{txt} , {res}10{txt} , {res}11{txt} , {res}12{txt} , {res}13{txt} , {res}14{txt} , {res}15{txt} , {res}16{txt} , {res}17{txt} , {res}18{txt} , {res}19{txt} , {res}21{txt} , {res}22{txt} , {res}23{txt} , {res}26{txt} , {res}27{txt} , {res}28{txt} , {res}31{txt} , {res}33{txt} , {res}34{txt} , {res}35{txt} , {res}36{txt} , {res}39{txt} , {res}40{txt} , {res}41{txt} , {res}42{txt} , {res}43{txt} , {res}45{txt} , {res}46{txt} , {res}47{txt} , {res}48{txt} , {res}49{txt} , {res}50{txt} , {res}51{txt} , {res}52{txt} , {res}53{txt} , {res}54{txt} , {res}55{txt} , {res}56{txt} , {res}57{txt} , {res}58{txt} , {res}59{txt} , {res}60{txt} , {res}61{txt} , {res}62{txt} , {res}63{txt} , {res}64{txt} , {res}65{txt} , {res}66{txt} , {res}67{txt} , {res}68{txt} , {res}69{txt} , {res}70{txt} , {res}72{txt} , {res}73{txt} , {res}75{txt} , {res}76{txt} , {res}77{txt} , {res}78{txt} , {res}79{txt} , {res}80{txt} , {res}81{txt} , {res}82{txt} , {res}83{txt} , {res}84{txt} , {res}85{txt} , {res}86{txt} , {res}87{txt} , {res}88{txt} , {res}89{txt} , {res}90{txt} , {res}91{txt} , {res}92{txt} , {res}93{txt} , {res}94{txt} , {res}95{txt} , {res}96{txt} , {res}97{txt} , {res}98{txt} , {res}99{txt} , {res}100
{hline 40}

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          1          95           .         95         95

Estimation of Neighbors of the House leader hedvicechair Based on the Network - housenonedunwgt



{hline 40}
{txt}  Network: {res}housenonedunwgt
{hline 40}
{txt}    Ego        : {res}95
{txt}    Neighbors  : {res}{res}1{txt} , {res}2{txt} , {res}3{txt} , {res}5{txt} , {res}7{txt} , {res}8{txt} , {res}9{txt} , {res}10{txt} , {res}11{txt} , {res}12{txt} , {res}14{txt} , {res}16{txt} , {res}17{txt} , {res}21{txt} , {res}22{txt} , {res}26{txt} , {res}27{txt} , {res}28{txt} , {res}33{txt} , {res}34{txt} , {res}35{txt} , {res}36{txt} , {res}39{txt} , {res}40{txt} , {res}41{txt} , {res}42{txt} , {res}43{txt} , {res}44{txt} , {res}45{txt} , {res}46{txt} , {res}47{txt} , {res}48{txt} , {res}49{txt} , {res}50{txt} , {res}51{txt} , {res}52{txt} , {res}53{txt} , {res}55{txt} , {res}56{txt} , {res}57{txt} , {res}58{txt} , {res}59{txt} , {res}60{txt} , {res}61{txt} , {res}62{txt} , {res}63{txt} , {res}64{txt} , {res}65{txt} , {res}66{txt} , {res}68{txt} , {res}69{txt} , {res}70{txt} , {res}72{txt} , {res}73{txt} , {res}75{txt} , {res}76{txt} , {res}77{txt} , {res}78{txt} , {res}80{txt} , {res}81{txt} , {res}82{txt} , {res}83{txt} , {res}84{txt} , {res}85{txt} , {res}86{txt} , {res}87{txt} , {res}88{txt} , {res}89{txt} , {res}90{txt} , {res}91{txt} , {res}92{txt} , {res}93{txt} , {res}94{txt} , {res}96{txt} , {res}97{txt} , {res}98{txt} , {res}99{txt} , {res}100
{hline 40}

Estimation of Reachability Network Based On - housenonedunwgt


Summary of the Reachability Network Estimated From - housenonedunwgt

{txt}[symmetric]
           1     2     3     4     5     6     7     8     9    10    11    12    13    14    15    16    17    18    19    20    21    22    23
      {c TLC}{hline 139}
    1 {c |}  {res}  0                                                                                                                                    
{txt}    2 {c |}  {res}  1     0                                                                                                                              
{txt}    3 {c |}  {res}  1     1     0                                                                                                                        
{txt}    4 {c |}  {res}  1     1     1     0                                                                                                                  
{txt}    5 {c |}  {res}  1     1     1     1     0                                                                                                            
{txt}    6 {c |}  {res}  1     1     1     1     1     0                                                                                                      
{txt}    7 {c |}  {res}  1     1     1     1     1     1     0                                                                                                
{txt}    8 {c |}  {res}  1     1     1     1     1     1     1     0                                                                                          
{txt}    9 {c |}  {res}  1     1     1     1     1     1     1     1     0                                                                                    
{txt}   10 {c |}  {res}  1     1     1     1     1     1     1     1     1     0                                                                              
{txt}   11 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     0                                                                        
{txt}   12 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     0                                                                  
{txt}   13 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     0                                                            
{txt}   14 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     0                                                      
{txt}   15 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     0                                                
{txt}   16 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0                                          
{txt}   17 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0                                    
{txt}   18 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0                              
{txt}   19 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0                        
{txt}   20 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0                  
{txt}   21 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0            
{txt}   22 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0      
{txt}   23 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0
{txt}   24 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   25 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   26 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   27 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   28 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   29 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   30 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   31 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   32 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   33 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   34 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   35 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   36 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   37 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   38 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   39 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   40 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   41 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   42 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   43 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   44 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   45 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   46 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   47 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   48 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   49 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   50 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   51 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   52 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   53 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   54 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   55 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   56 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   57 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   58 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   59 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   60 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   61 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   62 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   63 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   64 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   65 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   66 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   67 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   68 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   69 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   70 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   71 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   72 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   73 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   74 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   75 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   76 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   77 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   78 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   79 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   80 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   81 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   82 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   83 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   84 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   85 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   86 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   87 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   88 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   89 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   90 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   91 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   92 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   93 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   94 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   95 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   96 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   97 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   98 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   99 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}  100 {c |}  {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}      {c BLC}{hline 139}
          24    25    26    27    28    29    30    31    32    33    34    35    36    37    38    39    40    41    42    43    44    45    46
       {hline 139}
   24    {res}  0                                                                                                                                    
{txt}   25    {res}  1     0                                                                                                                              
{txt}   26    {res}  1     1     0                                                                                                                        
{txt}   27    {res}  1     1     1     0                                                                                                                  
{txt}   28    {res}  1     1     1     1     0                                                                                                            
{txt}   29    {res}  1     1     1     1     1     0                                                                                                      
{txt}   30    {res}  1     1     1     1     1     1     0                                                                                                
{txt}   31    {res}  1     1     1     1     1     1     1     0                                                                                          
{txt}   32    {res}  1     1     1     1     1     1     1     1     0                                                                                    
{txt}   33    {res}  1     1     1     1     1     1     1     1     1     0                                                                              
{txt}   34    {res}  1     1     1     1     1     1     1     1     1     1     0                                                                        
{txt}   35    {res}  1     1     1     1     1     1     1     1     1     1     1     0                                                                  
{txt}   36    {res}  1     1     1     1     1     1     1     1     1     1     1     1     0                                                            
{txt}   37    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     0                                                      
{txt}   38    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     0                                                
{txt}   39    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0                                          
{txt}   40    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0                                    
{txt}   41    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0                              
{txt}   42    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0                        
{txt}   43    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0                  
{txt}   44    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0            
{txt}   45    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0      
{txt}   46    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0
{txt}   47    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   48    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   49    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   50    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   51    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   52    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   53    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   54    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   55    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   56    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   57    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   58    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   59    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   60    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   61    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   62    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   63    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   64    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   65    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   66    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   67    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   68    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   69    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   70    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   71    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   72    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   73    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   74    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   75    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   76    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   77    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   78    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   79    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   80    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   81    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   82    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   83    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   84    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   85    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   86    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   87    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   88    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   89    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   90    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   91    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   92    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   93    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   94    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   95    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   96    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   97    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   98    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   99    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}  100    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}       {hline 139}
          47    48    49    50    51    52    53    54    55    56    57    58    59    60    61    62    63    64    65    66    67    68    69
       {hline 139}
   47    {res}  0                                                                                                                                    
{txt}   48    {res}  1     0                                                                                                                              
{txt}   49    {res}  1     1     0                                                                                                                        
{txt}   50    {res}  1     1     1     0                                                                                                                  
{txt}   51    {res}  1     1     1     1     0                                                                                                            
{txt}   52    {res}  1     1     1     1     1     0                                                                                                      
{txt}   53    {res}  1     1     1     1     1     1     0                                                                                                
{txt}   54    {res}  1     1     1     1     1     1     1     0                                                                                          
{txt}   55    {res}  1     1     1     1     1     1     1     1     0                                                                                    
{txt}   56    {res}  1     1     1     1     1     1     1     1     1     0                                                                              
{txt}   57    {res}  1     1     1     1     1     1     1     1     1     1     0                                                                        
{txt}   58    {res}  1     1     1     1     1     1     1     1     1     1     1     0                                                                  
{txt}   59    {res}  1     1     1     1     1     1     1     1     1     1     1     1     0                                                            
{txt}   60    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     0                                                      
{txt}   61    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     0                                                
{txt}   62    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0                                          
{txt}   63    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0                                    
{txt}   64    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0                              
{txt}   65    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0                        
{txt}   66    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0                  
{txt}   67    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0            
{txt}   68    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0      
{txt}   69    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0
{txt}   70    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   71    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   72    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   73    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   74    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   75    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   76    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   77    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   78    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   79    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   80    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   81    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   82    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   83    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   84    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   85    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   86    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   87    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   88    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   89    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   90    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   91    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   92    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   93    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   94    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   95    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   96    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   97    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   98    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   99    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}  100    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}       {hline 139}
          70    71    72    73    74    75    76    77    78    79    80    81    82    83    84    85    86    87    88    89    90    91    92
       {hline 139}
   70    {res}  0                                                                                                                                    
{txt}   71    {res}  1     0                                                                                                                              
{txt}   72    {res}  1     1     0                                                                                                                        
{txt}   73    {res}  1     1     1     0                                                                                                                  
{txt}   74    {res}  1     1     1     1     0                                                                                                            
{txt}   75    {res}  1     1     1     1     1     0                                                                                                      
{txt}   76    {res}  1     1     1     1     1     1     0                                                                                                
{txt}   77    {res}  1     1     1     1     1     1     1     0                                                                                          
{txt}   78    {res}  1     1     1     1     1     1     1     1     0                                                                                    
{txt}   79    {res}  1     1     1     1     1     1     1     1     1     0                                                                              
{txt}   80    {res}  1     1     1     1     1     1     1     1     1     1     0                                                                        
{txt}   81    {res}  1     1     1     1     1     1     1     1     1     1     1     0                                                                  
{txt}   82    {res}  1     1     1     1     1     1     1     1     1     1     1     1     0                                                            
{txt}   83    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     0                                                      
{txt}   84    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     0                                                
{txt}   85    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0                                          
{txt}   86    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0                                    
{txt}   87    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0                              
{txt}   88    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0                        
{txt}   89    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0                  
{txt}   90    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0            
{txt}   91    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0      
{txt}   92    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     0
{txt}   93    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   94    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   95    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   96    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   97    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   98    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}   99    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}  100    {res}  1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1     1
{txt}       {hline 139}
          93    94    95    96    97    98    99   100
       {hline 49}{c TRC}
   93    {res}  0                                          {txt}  {c |}
   94    {res}  1     0                                    {txt}  {c |}
   95    {res}  1     1     0                              {txt}  {c |}
   96    {res}  1     1     1     0                        {txt}  {c |}
   97    {res}  1     1     1     1     0                  {txt}  {c |}
   98    {res}  1     1     1     1     1     0            {txt}  {c |}
   99    {res}  1     1     1     1     1     1     0      {txt}  {c |}
  100    {res}  1     1     1     1     1     1     1     0{txt}  {c |}
       {hline 49}{c BRC}

{res}Estimation of Closeness Measures for the Network - housenonedunwgt

{hline 40}
{txt}  Network name: {res}housenonedunwgt
{hline 40}
{txt}    Closeness centrality

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 7}close {c |}{res}        100    .8281039    .0948352   .5469613        .99
{txt}{space 9}far {c |}{res}        100      121.34    15.98498        100        181
{txt}{space 8}near {c |}{res}        100    .0083647    .0009579   .0055249        .01

Estimation of Degree Centrality Measures for the Network - housenonedunwgt

{hline 40}
{txt}  Network name: {res}housenonedunwgt
{hline 40}
{txt}    Degree distribution

     degree {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
   .1717172 {c |}{res}          1        1.00        1.00
{txt}   .3232323 {c |}{res}          1        1.00        2.00
{txt}   .3535354 {c |}{res}          1        1.00        3.00
{txt}   .3939394 {c |}{res}          1        1.00        4.00
{txt}   .4040404 {c |}{res}          1        1.00        5.00
{txt}   .4141414 {c |}{res}          1        1.00        6.00
{txt}   .4242424 {c |}{res}          1        1.00        7.00
{txt}   .4444444 {c |}{res}          1        1.00        8.00
{txt}   .4646465 {c |}{res}          1        1.00        9.00
{txt}   .5050505 {c |}{res}          1        1.00       10.00
{txt}   .5252525 {c |}{res}          1        1.00       11.00
{txt}   .5353535 {c |}{res}          1        1.00       12.00
{txt}   .5454546 {c |}{res}          1        1.00       13.00
{txt}   .6262626 {c |}{res}          1        1.00       14.00
{txt}   .6464646 {c |}{res}          2        2.00       16.00
{txt}   .6868687 {c |}{res}          1        1.00       17.00
{txt}   .6969697 {c |}{res}          2        2.00       19.00
{txt}   .7070707 {c |}{res}          2        2.00       21.00
{txt}   .7171717 {c |}{res}          4        4.00       25.00
{txt}   .7272727 {c |}{res}          2        2.00       27.00
{txt}   .7373737 {c |}{res}          1        1.00       28.00
{txt}   .7474747 {c |}{res}          5        5.00       33.00
{txt}   .7575758 {c |}{res}          3        3.00       36.00
{txt}   .7676768 {c |}{res}          1        1.00       37.00
{txt}   .7777778 {c |}{res}          5        5.00       42.00
{txt}   .7878788 {c |}{res}          3        3.00       45.00
{txt}   .7979798 {c |}{res}          4        4.00       49.00
{txt}   .8080808 {c |}{res}          1        1.00       50.00
{txt}   .8282828 {c |}{res}          3        3.00       53.00
{txt}   .8383839 {c |}{res}          4        4.00       57.00
{txt}   .8484849 {c |}{res}          5        5.00       62.00
{txt}   .8585858 {c |}{res}          5        5.00       67.00
{txt}   .8686869 {c |}{res}          5        5.00       72.00
{txt}   .8787879 {c |}{res}          4        4.00       76.00
{txt}   .8888889 {c |}{res}          7        7.00       83.00
{txt}   .8989899 {c |}{res}          1        1.00       84.00
{txt}   .9090909 {c |}{res}          3        3.00       87.00
{txt}   .9191919 {c |}{res}          2        2.00       89.00
{txt}   .9292929 {c |}{res}          2        2.00       91.00
{txt}   .9393939 {c |}{res}          3        3.00       94.00
{txt}    .949495 {c |}{res}          1        1.00       95.00
{txt}    .969697 {c |}{res}          3        3.00       98.00
{txt}    .979798 {c |}{res}          1        1.00       99.00
{txt}    .989899 {c |}{res}          1        1.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        100      100.00

{txt}   Degree centralization:: {res}.2199546485260771

Estimation of Betweenness Centrality Measures for the Network - housenonedunwgt

{hline 40}
{txt}  Network name: {res}housenonedunwgt
{hline 40}
{txt}    Betweenness centrality
{txt}    (standardized)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}between {c |}{res}        100    .0046052    .0034175   8.96e-06   .0145835

Estimation of Geodesic Paths for the Network - housenonedunwgt

{hline 40}
{txt}  Network name: {res}housenonedunwgt
{txt}  Network of shortest paths: {res}geodesic_2
{hline 40}
{txt}    Nodes: {res}100
{txt}    Symmetrized : {res}1
    {hline 36}
{txt}    Paths (largest component) : {res}4950
{txt}    Diameter (largest component): {res}2
{txt}    Average shortest path (largest component): {res}1.225656565656566

Estimation of the Number of Components in the Network - housenonedunwgt

{hline 40}
{txt}  Network name: {res}housenonedunwgt
{txt}  Components: {res}1

{txt}housenonedu {c |}
nwgt_compon {c |}
        ent {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}        100      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        100      100.00
 
 

Estimation of the Largest Component in the Network - housenonedunwgt

{hline 40}
{txt}  Network name: {res}housenonedunwgt
{txt}  Components: {res}1

{txt}housenonedu {c |}
   nwgt_lgc {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}        100      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        100      100.00
 
 

Estimation of Eigenvector Centrality within the Network - housenonedunwgt

{hline 40}
{txt}  Network name: {res}housenonedunwgt
{hline 40}
{txt}    Eigenvector centrality

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
houseno~cent {c |}{res}        100    .0977956    .0209865   .0208974    .120216


The following results are for the network named houseedunwgt.



{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}              43
{txt}{col 9}from master{col 30}{res}               0{txt}  
{col 9}from using{col 30}{res}              43{txt}  

{col 5}matched{col 30}{res}              57{txt}  
{col 5}{hline 41}

{res}Summary of the Network - houseedunwgt

{hline 50}
{txt}   Network name: {res} houseedunwgt
{txt}   Network id: {res} 10
{txt}   Directed: {res}false
{txt}   Nodes: {res}57
{txt}   Edges: {res}389
{txt}   Minimum value: {res} 0
{txt}   Maximum value: {res} 1
{txt}   Density: {res} .243734335839599

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          1          17           .         17         17

Estimation of Neighbors of the House leader hprotemp Based on the Network - houseedunwgt



{hline 40}
{txt}  Network: {res}houseedunwgt
{hline 40}
{txt}    Ego        : {res}17
{txt}    Neighbors  : {res}{res}3{txt} , {res}9{txt} , {res}12{txt} , {res}20{txt} , {res}22{txt} , {res}28{txt} , {res}30{txt} , {res}32{txt} , {res}38{txt} , {res}39{txt} , {res}43{txt} , {res}49{txt} , {res}53
{hline 40}

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          1          30           .         30         30

Estimation of Neighbors of the House leader hmajldr Based on the Network - houseedunwgt



{hline 40}
{txt}  Network: {res}houseedunwgt
{hline 40}
{txt}    Ego        : {res}30
{txt}    Neighbors  : {res}{res}3{txt} , {res}9{txt} , {res}12{txt} , {res}17{txt} , {res}20{txt} , {res}22{txt} , {res}28{txt} , {res}32{txt} , {res}38{txt} , {res}39{txt} , {res}43{txt} , {res}49{txt} , {res}53
{hline 40}

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          0
{err}House leader hmajwhip has no neighbors in the network houseedunwgt

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          1           1           .          1          1

Estimation of Neighbors of the House leader hminldr Based on the Network - houseedunwgt



{hline 40}
{txt}  Network: {res}houseedunwgt
{hline 40}
{txt}    Ego        : {res}1
{txt}    Neighbors  : {res}{res}2{txt} , {res}5{txt} , {res}8{txt} , {res}9{txt} , {res}12{txt} , {res}16{txt} , {res}20{txt} , {res}21{txt} , {res}31{txt} , {res}36{txt} , {res}40{txt} , {res}44{txt} , {res}48{txt} , {res}56{txt} , {res}57
{hline 40}

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          0
{err}House leader hminwhip has no neighbors in the network houseedunwgt

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          1           3           .          3          3

Estimation of Neighbors of the House leader hedchair Based on the Network - houseedunwgt



{hline 40}
{txt}  Network: {res}houseedunwgt
{hline 40}
{txt}    Ego        : {res}3
{txt}    Neighbors  : {res}{res}4{txt} , {res}9{txt} , {res}10{txt} , {res}12{txt} , {res}17{txt} , {res}20{txt} , {res}22{txt} , {res}26{txt} , {res}27{txt} , {res}28{txt} , {res}30{txt} , {res}32{txt} , {res}34{txt} , {res}38{txt} , {res}39{txt} , {res}42{txt} , {res}43{txt} , {res}44{txt} , {res}45{txt} , {res}47{txt} , {res}49{txt} , {res}51{txt} , {res}52{txt} , {res}53{txt} , {res}54{txt} , {res}55
{hline 40}

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          1          54           .         54         54

Estimation of Neighbors of the House leader hedvicechair Based on the Network - houseedunwgt



{hline 40}
{txt}  Network: {res}houseedunwgt
{hline 40}
{txt}    Ego        : {res}54
{txt}    Neighbors  : {res}{res}3{txt} , {res}9{txt} , {res}10{txt} , {res}42{txt} , {res}43{txt} , {res}44{txt} , {res}45{txt} , {res}49
{hline 40}

Estimation of Reachability Network Based On - houseedunwgt


Summary of the Reachability Network Estimated From - houseedunwgt

{txt}[symmetric]
         1    2    3    4    5    6    7    8    9   10   11   12   13   14   15   16   17   18   19   20   21   22   23   24   25   26   27   28
     {c TLC}{hline 141}
   1 {c |}  {res} 0                                                                                                                                       
{txt}   2 {c |}  {res} 1    0                                                                                                                                  
{txt}   3 {c |}  {res} 1    1    0                                                                                                                             
{txt}   4 {c |}  {res} 1    1    1    0                                                                                                                        
{txt}   5 {c |}  {res} 1    1    1    1    0                                                                                                                   
{txt}   6 {c |}  {res} 1    1    1    1    1    0                                                                                                              
{txt}   7 {c |}  {res} 1    1    1    1    1    1    0                                                                                                         
{txt}   8 {c |}  {res} 1    1    1    1    1    1    1    0                                                                                                    
{txt}   9 {c |}  {res} 1    1    1    1    1    1    1    1    0                                                                                               
{txt}  10 {c |}  {res} 1    1    1    1    1    1    1    1    1    0                                                                                          
{txt}  11 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    0                                                                                     
{txt}  12 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    0                                                                                
{txt}  13 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    0                                                                           
{txt}  14 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    0                                                                      
{txt}  15 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                                                                 
{txt}  16 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                                                            
{txt}  17 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                                                       
{txt}  18 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                                                  
{txt}  19 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                                             
{txt}  20 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                                        
{txt}  21 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                                   
{txt}  22 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                              
{txt}  23 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                         
{txt}  24 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                    
{txt}  25 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0               
{txt}  26 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0          
{txt}  27 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0     
{txt}  28 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0
{txt}  29 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  30 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  31 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  32 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  33 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  34 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  35 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  36 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  37 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  38 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  39 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  40 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  41 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  42 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  43 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  44 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  45 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  46 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  47 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  48 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  49 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  50 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  51 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  52 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  53 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  54 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  55 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  56 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  57 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}     {c BLC}{hline 141}
        29   30   31   32   33   34   35   36   37   38   39   40   41   42   43   44   45   46   47   48   49   50   51   52   53   54   55   56
      {hline 141}
  29    {res} 0                                                                                                                                       
{txt}  30    {res} 1    0                                                                                                                                  
{txt}  31    {res} 1    1    0                                                                                                                             
{txt}  32    {res} 1    1    1    0                                                                                                                        
{txt}  33    {res} 1    1    1    1    0                                                                                                                   
{txt}  34    {res} 1    1    1    1    1    0                                                                                                              
{txt}  35    {res} 1    1    1    1    1    1    0                                                                                                         
{txt}  36    {res} 1    1    1    1    1    1    1    0                                                                                                    
{txt}  37    {res} 1    1    1    1    1    1    1    1    0                                                                                               
{txt}  38    {res} 1    1    1    1    1    1    1    1    1    0                                                                                          
{txt}  39    {res} 1    1    1    1    1    1    1    1    1    1    0                                                                                     
{txt}  40    {res} 1    1    1    1    1    1    1    1    1    1    1    0                                                                                
{txt}  41    {res} 1    1    1    1    1    1    1    1    1    1    1    1    0                                                                           
{txt}  42    {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    0                                                                      
{txt}  43    {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                                                                 
{txt}  44    {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                                                            
{txt}  45    {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                                                       
{txt}  46    {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                                                  
{txt}  47    {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                                             
{txt}  48    {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                                        
{txt}  49    {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                                   
{txt}  50    {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                              
{txt}  51    {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                         
{txt}  52    {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                    
{txt}  53    {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0               
{txt}  54    {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0          
{txt}  55    {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0     
{txt}  56    {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0
{txt}  57    {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}      {hline 141}
        57
      {hline 6}{c TRC}
  57    {res} 0{txt}  {c |}
      {hline 6}{c BRC}

{res}Estimation of Closeness Measures for the Network - houseedunwgt

{hline 40}
{txt}  Network name: {res}houseedunwgt
{hline 40}
{txt}    Closeness centrality

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 7}close {c |}{res}         57    .5112764     .090133   .3146068   .7466667
{txt}{space 9}far {c |}{res}         57    113.1579    21.72539         75        178
{txt}{space 8}near {c |}{res}         57    .0091299    .0016095    .005618   .0133333

Estimation of Degree Centrality Measures for the Network - houseedunwgt

{hline 40}
{txt}  Network name: {res}houseedunwgt
{hline 40}
{txt}    Degree distribution

     degree {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
   .0178571 {c |}{res}          1        1.75        1.75
{txt}   .0357143 {c |}{res}          5        8.77       10.53
{txt}   .0714286 {c |}{res}          2        3.51       14.04
{txt}   .1071429 {c |}{res}          2        3.51       17.54
{txt}   .1428571 {c |}{res}          5        8.77       26.32
{txt}   .1607143 {c |}{res}          9       15.79       42.11
{txt}   .1785714 {c |}{res}          1        1.75       43.86
{txt}   .1964286 {c |}{res}          1        1.75       45.61
{txt}   .2321429 {c |}{res}          6       10.53       56.14
{txt}        .25 {c |}{res}          1        1.75       57.89
{txt}   .2678571 {c |}{res}          8       14.04       71.93
{txt}   .2857143 {c |}{res}          1        1.75       73.68
{txt}   .3035714 {c |}{res}          2        3.51       77.19
{txt}   .3214286 {c |}{res}          1        1.75       78.95
{txt}   .3928571 {c |}{res}          4        7.02       85.96
{txt}   .4464286 {c |}{res}          1        1.75       87.72
{txt}   .4642857 {c |}{res}          2        3.51       91.23
{txt}   .5178571 {c |}{res}          2        3.51       94.74
{txt}   .5357143 {c |}{res}          1        1.75       96.49
{txt}   .5892857 {c |}{res}          1        1.75       98.25
{txt}   .6964286 {c |}{res}          1        1.75      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}         57      100.00

{txt}   Degree centralization:: {res}.4691558441558442

Estimation of Betweenness Centrality Measures for the Network - houseedunwgt

{hline 40}
{txt}  Network name: {res}houseedunwgt
{hline 40}
{txt}    Betweenness centrality
{txt}    (standardized)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}between {c |}{res}         57    .0371155    .0716691          0   .3570728

Estimation of Geodesic Paths for the Network - houseedunwgt

{hline 40}
{txt}  Network name: {res}houseedunwgt
{txt}  Network of shortest paths: {res}geodesic_3
{hline 40}
{txt}    Nodes: {res}57
{txt}    Symmetrized : {res}1
    {hline 36}
{txt}    Paths (largest component) : {res}1596
{txt}    Diameter (largest component): {res}5
{txt}    Average shortest path (largest component): {res}2.020676691729324

Estimation of the Number of Components in the Network - houseedunwgt

{hline 40}
{txt}  Network name: {res}houseedunwgt
{txt}  Components: {res}1

{txt}houseedunwg {c |}
t_component {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}         57      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}         57      100.00
 
 

Estimation of the Largest Component in the Network - houseedunwgt

{hline 40}
{txt}  Network name: {res}houseedunwgt
{txt}  Components: {res}1

{txt}houseedunwg {c |}
      t_lgc {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}         57      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}         57      100.00
 
 

Estimation of Eigenvector Centrality within the Network - houseedunwgt

{hline 40}
{txt}  Network name: {res}houseedunwgt
{hline 40}
{txt}    Eigenvector centrality

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
houseed~cent {c |}{res}         57    .1118915    .0715113   .0030895   .2864549
{txt}
{com}. 
. loc wgt1 `: word 1 of $housewgt'
{txt}
{com}. loc wgt2 `: word 2 of $housewgt'
{txt}
{com}. loc unwgt1 `: word 1 of $houseunwgt'
{txt}
{com}. loc unwgt2 `: word 2 of $houseunwgt'
{txt}
{com}. 
. // Print info about networks for correlation
. di as res _n "Correlation between the `wgt1' and `wgt2' networks" _n 
{res}
Correlation between the housenonedwgt and houseedwgt networks

{txt}
{com}. 
. // Estimate correlations between Non-Education and Education related networks in
. // the house with weighted ties
. cap noi nwcorrelate $housewgt, permutations(5000)
{res}{err}Networks of different size.
{txt}
{com}. 
. // Saves the correlation visualization
. cap noi gr save `"$results/graphs/stata/`wgt1'_`wgt2'-correlation.gph"', replace
{txt}(note: file /Users/billy/Desktop/kyLegislation/results/graphs/stata/housenonedwgt_houseedwgt-correlation.gph not found)
{res}{txt}(file ~/Desktop/kyLegislation/results/graphs/stata/housenonedwgt_houseedwgt-correlation.gph saved)

{com}. 
. // Print info about networks for correlation
. di as res _n "Correlation between the `unwgt1' and `unwgt2' networks" _n 
{res}
Correlation between the housenonedunwgt and houseedunwgt networks

{txt}
{com}. 
. // Same as above but with unweighted ties
. cap noi nwcorrelate $houseunwgt, permutations(5000)
{res}{err}Networks of different size.
{txt}
{com}. 
. // Saves the correlation visualization
. cap noi gr save `"$results/graphs/stata/`unwgt1'_`unwgt2'-correlation.gph"', replace
{txt}(note: file /Users/billy/Desktop/kyLegislation/results/graphs/stata/housenonedunwgt_houseedunwgt-correlation.gph not found)
{res}{txt}(file ~/Desktop/kyLegislation/results/graphs/stata/housenonedunwgt_houseedunwgt-correlation.gph saved)

{com}. 
. // Clear the data out of Stata's memory
. clear
{txt}
{com}. 
. // Load the weighted non-education network
. nwload `wgt1'
{res}{txt}
{com}. 
. // Join the political party data
. $mrghouse
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             100{txt}  
{col 5}{hline 41}

{com}. 
. // Print info about correlation
. di as res _n "Correlation between `wgt1' and political party affiliation" _n 
{res}
Correlation between housenonedwgt and political party affiliation

{txt}
{com}. 
. // Correlation between the house non-education weighted network and political party
. cap noi nwcorrelate `wgt1', attribute(party) permutations(5000)
{res}{hline 40}
{txt}  Network name: {res}housenonedwgt
{txt}  Attribute: {res}same_party
{hline 40}
{txt}    Correlation: {res}.4252263603430441
{txt}    P-value: {res}0
{txt}
{com}. 
. // Saves the correlation visualization
. cap noi gr save `"$results/graphs/stata/`wgt1'_party-correlation.gph"', replace
{txt}(note: file /Users/billy/Desktop/kyLegislation/results/graphs/stata/housenonedwgt_party-correlation.gph not found)
{res}{txt}(file ~/Desktop/kyLegislation/results/graphs/stata/housenonedwgt_party-correlation.gph saved)

{com}. 
. // Clear the data out of Stata's memory
. clear
{txt}
{com}. 
. // Load the weighted education network
. nwload `wgt2'
{res}{txt}
{com}. 
. // Join the political party data
. $mrghouse
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}              43
{txt}{col 9}from master{col 30}{res}               0{txt}  
{col 9}from using{col 30}{res}              43{txt}  

{col 5}matched{col 30}{res}              57{txt}  
{col 5}{hline 41}

{com}. 
. // Print info about correlation
. di as res _n "Correlation between `wgt2' and political party affiliation" _n 
{res}
Correlation between houseedwgt and political party affiliation

{txt}
{com}. 
. // Correlation between the house education weighted network and political party
. cap noi nwcorrelate `wgt2', attribute(party) permutations(5000)
{res}{err}Networks of different size.
{txt}
{com}.         
. // Saves the correlation visualization
. cap noi gr save `"$results/graphs/stata/`wgt2'_party-correlation.gph"', replace
{txt}(note: file /Users/billy/Desktop/kyLegislation/results/graphs/stata/houseedwgt_party-correlation.gph not found)
{res}{txt}(file ~/Desktop/kyLegislation/results/graphs/stata/houseedwgt_party-correlation.gph saved)

{com}. 
. // Clear the data out of Stata's memory
. clear
{txt}
{com}. 
. // Load the unweighted non-education network
. nwload `unwgt1'
{res}{txt}
{com}. 
. // Join the political party data
. $mrghouse
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             100{txt}  
{col 5}{hline 41}

{com}. 
. // Print info about correlation
. di as res _n "Correlation between `unwgt1' and political party affiliation" _n 
{res}
Correlation between housenonedunwgt and political party affiliation

{txt}
{com}. 
. // Correlation between the house non-education unweighted network and political party
. cap noi nwcorrelate `unwgt1', attribute(party) permutations(5000)
{res}{hline 40}
{txt}  Network name: {res}housenonedunwgt
{txt}  Attribute: {res}same_party
{hline 40}
{txt}    Correlation: {res}.3688833683625878
{txt}    P-value: {res}0
{txt}
{com}. 
. // Saves the correlation visualization
. cap noi gr save `"$results/graphs/stata/`unwgt1'_party-correlation.gph"', replace
{txt}(note: file /Users/billy/Desktop/kyLegislation/results/graphs/stata/housenonedunwgt_party-correlation.gph not found)
{res}{txt}(file ~/Desktop/kyLegislation/results/graphs/stata/housenonedunwgt_party-correlation.gph saved)

{com}. 
. // Clear the data out of Stata's memory
. clear
{txt}
{com}. 
. // Load the unweighted education network
. nwload `unwgt2'
{res}{txt}
{com}. 
. // Join the political party data
. $mrghouse
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}              43
{txt}{col 9}from master{col 30}{res}               0{txt}  
{col 9}from using{col 30}{res}              43{txt}  

{col 5}matched{col 30}{res}              57{txt}  
{col 5}{hline 41}

{com}. 
. // Print info about correlation
. di as res _n "Correlation between `unwgt2' and political party affiliation" _n 
{res}
Correlation between houseedunwgt and political party affiliation

{txt}
{com}. 
. // Correlation between the house education unweighted network and political party
. cap noi nwcorrelate `unwgt2', attribute(party) permutations(5000)
{res}{err}Networks of different size.
{txt}
{com}.         
. // Saves the correlation visualization
. cap noi gr save `"$results/graphs/stata/`unwgt2'_party-correlation.gph"', replace
{txt}(note: file /Users/billy/Desktop/kyLegislation/results/graphs/stata/houseedunwgt_party-correlation.gph not found)
{res}{txt}(file ~/Desktop/kyLegislation/results/graphs/stata/houseedunwgt_party-correlation.gph saved)

{com}. 
. // Save new file with all the networks generated from the analysis
. nwsave $analysis/houseAnalyzedNetworks, replace
{res}{txt}file ~/Desktop/kyLegislation/data/clean/analysis/houseAnalyzedNetworks.dta saved

{com}. 
. // Drop all networks from memory
. nwclear
{txt}
{com}. 
. // Close the log file
. log c house
      {txt}name:  {res}house
       {txt}log:  {res}/Users/billy/Desktop/kyLegislation/results/analysisLogs/houseResults.txt
  {txt}log type:  {res}text
 {txt}closed on:  {res}14 Jul 2018, 18:42:12
{txt}{.-}

{com}. 
. // Open log file to store results
. log using `"$results/analysisLogs/senateResults.txt"', replace text name(senate)
{txt}(note: file /Users/billy/Desktop/kyLegislation/results/analysisLogs/senateResults.txt not found)
{.-}
      name:  {res}senate
       {txt}log:  {res}/Users/billy/Desktop/kyLegislation/results/analysisLogs/senateResults.txt
  {txt}log type:  {res}text
 {txt}opened on:  {res}14 Jul 2018, 18:42:12
{txt}
{com}.         
. // Loads networks into Mata and also adds Stata variables in not useful format
. nwuse `"$analysis/senateNetworks"', nwclear

{txt}{it:Loading successful}
{res}{txt}(4 networks)
{hline 20}
      {res}senatenonedwgt
      {res}senatenonedunwgt
      {res}senateedwgt
      {res}senateedunwgt
{txt}
{com}. 
. // Need to load each network individually and then join the attributes to the
. // data in order to label the nodes and look at party affiliations
. foreach network in $senatewgt $senateunwgt {c -(}
{txt}  2{com}. 
.         // Clear the data out of Stata's memory
.         clear
{txt}  3{com}. 
.         // Display the network being iterated on
.         di as res "The following results are for the network named `network'." _n
{txt}  4{com}. 
.         // Loads the network
.         nwload `network'
{txt}  5{com}. 
.         // Joins the name and party attributes
.         $mrgsenate
{txt}  6{com}.         
.         // Print info prior to results
.         di as res _n "Summary of the Network - `network'" _n
{txt}  7{com}.         
.         // Summary of the network
.         nwsummarize `network'
{txt}  8{com}. 
.         // Iterate over the senate leadership macros
.         foreach leader in $senateldrshp {c -(}
{txt}  9{com}.         
.                 // Execute the command for this leader
.                 $`leader'
{txt} 10{com}.                 
.                 // Set the value of the node id for this leader
.                 loc leaderid `r(mean)'
{txt} 11{com}.         
.                 // Test whether or not this individual has any neighbors
.                 if `r(N)' != 0 {c -(}
{txt} 12{com}.         
.                         // Print info prior to results
.                         di as res _n "Estimation of Neighbors of the Senate leader `leader' Based on the Network - `network'" _n
{txt} 13{com}. 
.                         // Extract the neighbors of this leader
.                         nwneighbor `network', ego(`leaderid')
{txt} 14{com}.                         
.                 {c )-} // End IF Block for node with neighbors
{txt} 15{com}.                 
.                 // Or print a message with info
.                 else di as err "Senate leader `leader' has no neighbors in the network `network'"
{txt} 16{com}. 
.         {c )-} // End Loop over the leadership positions to estimate neighbors
{txt} 17{com}.         
.         // Print info prior to results
.         di as res _n "Estimation of Reachability Network Based On - `network'" _n
{txt} 18{com}.         
.         // Estimate reachability network from this network
.         nwreach `network', name(`network'_reach) 
{txt} 19{com}. 
.         // Print info prior to results
.         di as res _n "Summary of the Reachability Network Estimated From - `network'" _n
{txt} 20{com}.         
.         // Summarize the reachability of the network
.         nwsummarize `network'_reach, matonly
{txt} 21{com}.         
.         // Print info prior to results
.         di as res _n "Estimation of Closeness Measures for the Network - `network'" _n
{txt} 22{com}.         
.         // Estimate closeness metrics
.         nwcloseness `network', generate(close far near) unconnected(max)
{txt} 23{com}.         
.         // Estimate Katz distance metric
.         // nwkatz `network', generate(katz)
. 
.         // Print info prior to results
.         di as res _n "Estimation of Degree Centrality Measures for the Network - `network'" _n
{txt} 24{com}.         
.         // Estimate degree centrality metric for unweighted networks
.         if regexm(`"`network'"', "un") nwdegree `network', generate(degree) isolates standardize
{txt} 25{com}. 
.         // Estimates degree centrality metric for weighted networks
.         else nwdegree `network', generate(degree) isolates standardize valued
{txt} 26{com}.         
.         // Print info prior to results
.         di as res _n "Estimation of Betweenness Centrality Measures for the Network - `network'" _n
{txt} 27{com}.         
.         // Estimate betweenness centrality
.         nwbetween `network', generate(between) standardize
{txt} 28{com}.         
.         // Print info prior to results
.         di as res _n "Estimation of Geodesic Paths for the Network - `network'" _n
{txt} 29{com}.         
.         // Estimates shortest paths between nodes
.         nwgeodesic `network', unconnected(max) 
{txt} 30{com}.         
.         // Print info prior to results
.         di as res _n "Estimation of the Number of Components in the Network - `network'" _n
{txt} 31{com}.         
.         // Estimates number of components in network
.         nwcomponents `network', generate(`network'_component)
{txt} 32{com}.         
.         // Print info prior to results
.         di as res _n "Estimation of the Largest Component in the Network - `network'" _n
{txt} 33{com}.         
.         // Estimates members of the largest component
.         nwcomponents `network', lgc generate(`network'_lgc)
{txt} 34{com}.         
.         // Print info prior to results
.         di as res _n "Estimation of Eigenvector Centrality within the Network - `network'" _n
{txt} 35{com}. 
.         // Estimates the eigenvector centrality
.         nwevcent `network', generate(`network'_eigencent)
{txt} 36{com}.         
. {c )-} // End Loop over house networks
{res}The following results are for the network named senatenonedwgt.


{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}              38{txt}  
{col 5}{hline 41}

{res}Summary of the Network - senatenonedwgt

{hline 50}
{txt}   Network name: {res} senatenonedwgt
{txt}   Network id: {res} 4
{txt}   Directed: {res}false
{txt}   Nodes: {res}38
{txt}   Edges: {res}479
{txt}   Minimum value: {res} 0
{txt}   Maximum value: {res} 12
{txt}   Density: {res} .6813655761024182

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          1          22           .         22         22

Estimation of Neighbors of the Senate leader spres Based on the Network - senatenonedwgt



{hline 40}
{txt}  Network: {res}senatenonedwgt
{hline 40}
{txt}    Ego        : {res}22
{txt}    Neighbors  : {res}{res}3{txt} , {res}23{txt} , {res}26{txt} , {res}32
{hline 40}

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          1          14           .         14         14

Estimation of Neighbors of the Senate leader sprotemp Based on the Network - senatenonedwgt



{hline 40}
{txt}  Network: {res}senatenonedwgt
{hline 40}
{txt}    Ego        : {res}14
{txt}    Neighbors  : {res}{res}1{txt} , {res}2{txt} , {res}3{txt} , {res}4{txt} , {res}5{txt} , {res}6{txt} , {res}7{txt} , {res}11{txt} , {res}12{txt} , {res}15{txt} , {res}17{txt} , {res}18{txt} , {res}21{txt} , {res}23{txt} , {res}26{txt} , {res}27{txt} , {res}28{txt} , {res}29{txt} , {res}31{txt} , {res}32{txt} , {res}33{txt} , {res}35{txt} , {res}36{txt} , {res}37{txt} , {res}38
{hline 40}

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          1          23           .         23         23

Estimation of Neighbors of the Senate leader smajldr Based on the Network - senatenonedwgt



{hline 40}
{txt}  Network: {res}senatenonedwgt
{hline 40}
{txt}    Ego        : {res}23
{txt}    Neighbors  : {res}{res}1{txt} , {res}2{txt} , {res}3{txt} , {res}4{txt} , {res}5{txt} , {res}6{txt} , {res}7{txt} , {res}11{txt} , {res}12{txt} , {res}14{txt} , {res}15{txt} , {res}17{txt} , {res}18{txt} , {res}19{txt} , {res}20{txt} , {res}21{txt} , {res}22{txt} , {res}26{txt} , {res}27{txt} , {res}28{txt} , {res}29{txt} , {res}31{txt} , {res}32{txt} , {res}33{txt} , {res}34{txt} , {res}35{txt} , {res}36{txt} , {res}37{txt} , {res}38
{hline 40}

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          1           5           .          5          5

Estimation of Neighbors of the Senate leader smajwhip Based on the Network - senatenonedwgt



{hline 40}
{txt}  Network: {res}senatenonedwgt
{hline 40}
{txt}    Ego        : {res}5
{txt}    Neighbors  : {res}{res}1{txt} , {res}2{txt} , {res}3{txt} , {res}4{txt} , {res}6{txt} , {res}7{txt} , {res}8{txt} , {res}11{txt} , {res}12{txt} , {res}14{txt} , {res}15{txt} , {res}17{txt} , {res}18{txt} , {res}20{txt} , {res}21{txt} , {res}23{txt} , {res}24{txt} , {res}25{txt} , {res}26{txt} , {res}27{txt} , {res}28{txt} , {res}29{txt} , {res}31{txt} , {res}32{txt} , {res}33{txt} , {res}34{txt} , {res}35{txt} , {res}36{txt} , {res}37{txt} , {res}38
{hline 40}

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          1          15           .         15         15

Estimation of Neighbors of the Senate leader sminldr Based on the Network - senatenonedwgt



{hline 40}
{txt}  Network: {res}senatenonedwgt
{hline 40}
{txt}    Ego        : {res}15
{txt}    Neighbors  : {res}{res}1{txt} , {res}2{txt} , {res}3{txt} , {res}4{txt} , {res}5{txt} , {res}6{txt} , {res}7{txt} , {res}11{txt} , {res}12{txt} , {res}14{txt} , {res}17{txt} , {res}18{txt} , {res}21{txt} , {res}23{txt} , {res}25{txt} , {res}26{txt} , {res}27{txt} , {res}28{txt} , {res}29{txt} , {res}31{txt} , {res}32{txt} , {res}33{txt} , {res}35{txt} , {res}36{txt} , {res}37{txt} , {res}38
{hline 40}

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          1           2           .          2          2

Estimation of Neighbors of the Senate leader sminwhip Based on the Network - senatenonedwgt



{hline 40}
{txt}  Network: {res}senatenonedwgt
{hline 40}
{txt}    Ego        : {res}2
{txt}    Neighbors  : {res}{res}1{txt} , {res}3{txt} , {res}4{txt} , {res}5{txt} , {res}6{txt} , {res}7{txt} , {res}8{txt} , {res}11{txt} , {res}12{txt} , {res}14{txt} , {res}15{txt} , {res}16{txt} , {res}17{txt} , {res}18{txt} , {res}21{txt} , {res}23{txt} , {res}24{txt} , {res}25{txt} , {res}26{txt} , {res}27{txt} , {res}28{txt} , {res}29{txt} , {res}31{txt} , {res}32{txt} , {res}33{txt} , {res}35{txt} , {res}36{txt} , {res}37{txt} , {res}38
{hline 40}

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          1          32           .         32         32

Estimation of Neighbors of the Senate leader sedchair Based on the Network - senatenonedwgt



{hline 40}
{txt}  Network: {res}senatenonedwgt
{hline 40}
{txt}    Ego        : {res}32
{txt}    Neighbors  : {res}{res}1{txt} , {res}2{txt} , {res}3{txt} , {res}4{txt} , {res}5{txt} , {res}6{txt} , {res}7{txt} , {res}11{txt} , {res}12{txt} , {res}14{txt} , {res}15{txt} , {res}17{txt} , {res}18{txt} , {res}21{txt} , {res}22{txt} , {res}23{txt} , {res}24{txt} , {res}26{txt} , {res}27{txt} , {res}28{txt} , {res}29{txt} , {res}31{txt} , {res}33{txt} , {res}34{txt} , {res}35{txt} , {res}36{txt} , {res}37{txt} , {res}38
{hline 40}

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          0
{err}Senate leader sedvicechair has no neighbors in the network senatenonedwgt

{res}Estimation of Reachability Network Based On - senatenonedwgt


Summary of the Reachability Network Estimated From - senatenonedwgt

{txt}[symmetric]
         1    2    3    4    5    6    7    8    9   10   11   12   13   14   15   16   17   18   19   20   21   22   23   24   25   26   27   28
     {c TLC}{hline 141}
   1 {c |}  {res} 0                                                                                                                                       
{txt}   2 {c |}  {res} 1    0                                                                                                                                  
{txt}   3 {c |}  {res} 1    1    0                                                                                                                             
{txt}   4 {c |}  {res} 1    1    1    0                                                                                                                        
{txt}   5 {c |}  {res} 1    1    1    1    0                                                                                                                   
{txt}   6 {c |}  {res} 1    1    1    1    1    0                                                                                                              
{txt}   7 {c |}  {res} 1    1    1    1    1    1    0                                                                                                         
{txt}   8 {c |}  {res} 1    1    1    1    1    1    1    0                                                                                                    
{txt}   9 {c |}  {res} 1    1    1    1    1    1    1    1    0                                                                                               
{txt}  10 {c |}  {res} 1    1    1    1    1    1    1    1    1    0                                                                                          
{txt}  11 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    0                                                                                     
{txt}  12 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    0                                                                                
{txt}  13 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    0                                                                           
{txt}  14 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    0                                                                      
{txt}  15 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                                                                 
{txt}  16 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                                                            
{txt}  17 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                                                       
{txt}  18 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                                                  
{txt}  19 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                                             
{txt}  20 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                                        
{txt}  21 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                                   
{txt}  22 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                              
{txt}  23 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                         
{txt}  24 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                    
{txt}  25 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0               
{txt}  26 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0          
{txt}  27 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0     
{txt}  28 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0
{txt}  29 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  30 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  31 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  32 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  33 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  34 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  35 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  36 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  37 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  38 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}     {c BLC}{hline 141}
        29   30   31   32   33   34   35   36   37   38
      {hline 51}{c TRC}
  29    {res} 0                                             {txt}  {c |}
  30    {res} 1    0                                        {txt}  {c |}
  31    {res} 1    1    0                                   {txt}  {c |}
  32    {res} 1    1    1    0                              {txt}  {c |}
  33    {res} 1    1    1    1    0                         {txt}  {c |}
  34    {res} 1    1    1    1    1    0                    {txt}  {c |}
  35    {res} 1    1    1    1    1    1    0               {txt}  {c |}
  36    {res} 1    1    1    1    1    1    1    0          {txt}  {c |}
  37    {res} 1    1    1    1    1    1    1    1    0     {txt}  {c |}
  38    {res} 1    1    1    1    1    1    1    1    1    0{txt}  {c |}
      {hline 51}{c BRC}

{res}Estimation of Closeness Measures for the Network - senatenonedwgt

{hline 40}
{txt}  Network name: {res}senatenonedwgt
{hline 40}
{txt}    Closeness centrality

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 7}close {c |}{res}         38    .7738484     .124029   .4868421       .925
{txt}{space 9}far {c |}{res}         38    49.26316    9.463112         40         76
{txt}{space 8}near {c |}{res}         38    .0209148    .0033521   .0131579       .025

Estimation of Degree Centrality Measures for the Network - senatenonedwgt

{hline 40}
{txt}  Network name: {res}senatenonedwgt
{hline 40}
{txt}    Degree distribution

     degree {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
   .0540541 {c |}{res}          1        2.63        2.63
{txt}   .1081081 {c |}{res}          1        2.63        5.26
{txt}   .3243243 {c |}{res}          1        2.63        7.89
{txt}   .4054054 {c |}{res}          1        2.63       10.53
{txt}   .5135135 {c |}{res}          1        2.63       13.16
{txt}   .6756757 {c |}{res}          1        2.63       15.79
{txt}   .8378378 {c |}{res}          1        2.63       18.42
{txt}   .8648649 {c |}{res}          1        2.63       21.05
{txt}   .9189189 {c |}{res}          1        2.63       23.68
{txt}    .972973 {c |}{res}          1        2.63       26.32
{txt}   1.324324 {c |}{res}          1        2.63       28.95
{txt}   1.351351 {c |}{res}          2        5.26       34.21
{txt}   1.432432 {c |}{res}          1        2.63       36.84
{txt}   1.486486 {c |}{res}          1        2.63       39.47
{txt}   1.540541 {c |}{res}          1        2.63       42.11
{txt}   1.702703 {c |}{res}          1        2.63       44.74
{txt}    1.72973 {c |}{res}          1        2.63       47.37
{txt}   1.864865 {c |}{res}          1        2.63       50.00
{txt}   1.945946 {c |}{res}          2        5.26       55.26
{txt}          2 {c |}{res}          1        2.63       57.89
{txt}   2.054054 {c |}{res}          1        2.63       60.53
{txt}   2.216216 {c |}{res}          1        2.63       63.16
{txt}   2.243243 {c |}{res}          1        2.63       65.79
{txt}   2.378378 {c |}{res}          1        2.63       68.42
{txt}    2.54054 {c |}{res}          1        2.63       71.05
{txt}   2.648649 {c |}{res}          1        2.63       73.68
{txt}   2.675676 {c |}{res}          1        2.63       76.32
{txt}   3.054054 {c |}{res}          1        2.63       78.95
{txt}   3.297297 {c |}{res}          1        2.63       81.58
{txt}   3.378378 {c |}{res}          1        2.63       84.21
{txt}   3.405406 {c |}{res}          1        2.63       86.84
{txt}   3.432432 {c |}{res}          1        2.63       89.47
{txt}   3.513514 {c |}{res}          1        2.63       92.11
{txt}   3.594594 {c |}{res}          1        2.63       94.74
{txt}   3.864865 {c |}{res}          1        2.63       97.37
{txt}   3.918919 {c |}{res}          1        2.63      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}         38      100.00

{txt}   Degree centralization:: {res}2.093093093093093

Estimation of Betweenness Centrality Measures for the Network - senatenonedwgt

{hline 40}
{txt}  Network name: {res}senatenonedwgt
{hline 40}
{txt}    Betweenness centrality
{txt}    (standardized)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}between {c |}{res}         38    .0184131     .023642          0   .1345403

Estimation of Geodesic Paths for the Network - senatenonedwgt

{hline 40}
{txt}  Network name: {res}senatenonedwgt
{txt}  Network of shortest paths: {res}geodesic
{hline 40}
{txt}    Nodes: {res}38
{txt}    Symmetrized : {res}1
    {hline 36}
{txt}    Paths (largest component) : {res}703
{txt}    Diameter (largest component): {res}3
{txt}    Average shortest path (largest component): {res}1.331436699857752

Estimation of the Number of Components in the Network - senatenonedwgt

{hline 40}
{txt}  Network name: {res}senatenonedwgt
{txt}  Components: {res}1

{txt}senatenoned {c |}
wgt_compone {c |}
         nt {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}         38      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}         38      100.00
 
 

Estimation of the Largest Component in the Network - senatenonedwgt

{hline 40}
{txt}  Network name: {res}senatenonedwgt
{txt}  Components: {res}1

{txt}senatenoned {c |}
    wgt_lgc {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}         38      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}         38      100.00
 
 

Estimation of Eigenvector Centrality within the Network - senatenonedwgt

{hline 40}
{txt}  Network name: {res}senatenonedwgt
{hline 40}
{txt}    Eigenvector centrality

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
senaten~cent {c |}{res}         38    .1540153    .0516258   .0083573   .1995542
The following results are for the network named senateedwgt.


{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}              17
{txt}{col 9}from master{col 30}{res}               0{txt}  
{col 9}from using{col 30}{res}              17{txt}  

{col 5}matched{col 30}{res}              21{txt}  
{col 5}{hline 41}

{res}Summary of the Network - senateedwgt

{hline 50}
{txt}   Network name: {res} senateedwgt
{txt}   Network id: {res} 6
{txt}   Directed: {res}false
{txt}   Nodes: {res}21
{txt}   Edges: {res}61
{txt}   Minimum value: {res} 0
{txt}   Maximum value: {res} 3
{txt}   Density: {res} .2904761904761905

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          0
{err}Senate leader spres has no neighbors in the network senateedwgt

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          0
{err}Senate leader sprotemp has no neighbors in the network senateedwgt

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          1          12           .         12         12

Estimation of Neighbors of the Senate leader smajldr Based on the Network - senateedwgt



{hline 40}
{txt}  Network: {res}senateedwgt
{hline 40}
{txt}    Ego        : {res}12
{txt}    Neighbors  : {res}{res}3{txt} , {res}11{txt} , {res}15{txt} , {res}16
{hline 40}

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          1           3           .          3          3

Estimation of Neighbors of the Senate leader smajwhip Based on the Network - senateedwgt



{hline 40}
{txt}  Network: {res}senateedwgt
{hline 40}
{txt}    Ego        : {res}3
{txt}    Neighbors  : {res}{res}4{txt} , {res}6{txt} , {res}10{txt} , {res}11{txt} , {res}12{txt} , {res}15{txt} , {res}16{txt} , {res}17{txt} , {res}18{txt} , {res}20{txt} , {res}21
{hline 40}

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          0
{err}Senate leader sminldr has no neighbors in the network senateedwgt

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          1           1           .          1          1

Estimation of Neighbors of the Senate leader sminwhip Based on the Network - senateedwgt



{hline 40}
{txt}  Network: {res}senateedwgt
{hline 40}
{txt}    Ego        : {res}1
{txt}    Neighbors  : {res}{res}7{txt} , {res}9{txt} , {res}14{txt} , {res}18
{hline 40}

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          1          15           .         15         15

Estimation of Neighbors of the Senate leader sedchair Based on the Network - senateedwgt



{hline 40}
{txt}  Network: {res}senateedwgt
{hline 40}
{txt}    Ego        : {res}15
{txt}    Neighbors  : {res}{res}3{txt} , {res}6{txt} , {res}11{txt} , {res}12{txt} , {res}16{txt} , {res}18{txt} , {res}19
{hline 40}

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          0
{err}Senate leader sedvicechair has no neighbors in the network senateedwgt

{res}Estimation of Reachability Network Based On - senateedwgt


Summary of the Reachability Network Estimated From - senateedwgt

{txt}[symmetric]
         1    2    3    4    5    6    7    8    9   10   11   12   13   14   15   16   17   18   19   20   21
     {c TLC}{hline 106}{c TRC}
   1 {c |}  {res} 0                                                                                                    {txt}  {c |}
   2 {c |}  {res} 1    0                                                                                               {txt}  {c |}
   3 {c |}  {res} 1    1    0                                                                                          {txt}  {c |}
   4 {c |}  {res} 1    1    1    0                                                                                     {txt}  {c |}
   5 {c |}  {res} 1    1    1    1    0                                                                                {txt}  {c |}
   6 {c |}  {res} 1    1    1    1    1    0                                                                           {txt}  {c |}
   7 {c |}  {res} 1    1    1    1    1    1    0                                                                      {txt}  {c |}
   8 {c |}  {res} 1    1    1    1    1    1    1    0                                                                 {txt}  {c |}
   9 {c |}  {res} 1    1    1    1    1    1    1    1    0                                                            {txt}  {c |}
  10 {c |}  {res} 1    1    1    1    1    1    1    1    1    0                                                       {txt}  {c |}
  11 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    0                                                  {txt}  {c |}
  12 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    0                                             {txt}  {c |}
  13 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    0                                        {txt}  {c |}
  14 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    0                                   {txt}  {c |}
  15 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                              {txt}  {c |}
  16 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                         {txt}  {c |}
  17 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                    {txt}  {c |}
  18 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0               {txt}  {c |}
  19 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0          {txt}  {c |}
  20 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0     {txt}  {c |}
  21 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0{txt}  {c |}
     {c BLC}{hline 106}{c BRC}

{res}Estimation of Closeness Measures for the Network - senateedwgt

{hline 40}
{txt}  Network name: {res}senateedwgt
{hline 40}
{txt}    Closeness centrality

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 7}close {c |}{res}         21    .5542745      .10324   .3571429   .8695652
{txt}{space 9}far {c |}{res}         21     37.2381     6.86225         23         56
{txt}{space 8}near {c |}{res}         21    .0277137     .005162   .0178571   .0434783

Estimation of Degree Centrality Measures for the Network - senateedwgt

{hline 40}
{txt}  Network name: {res}senateedwgt
{hline 40}
{txt}    Degree distribution

     degree {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
        .05 {c |}{res}          2        9.52        9.52
{txt}        .15 {c |}{res}          3       14.29       23.81
{txt}         .2 {c |}{res}          5       23.81       47.62
{txt}        .25 {c |}{res}          1        4.76       52.38
{txt}         .3 {c |}{res}          2        9.52       61.90
{txt}         .4 {c |}{res}          1        4.76       66.67
{txt}        .45 {c |}{res}          1        4.76       71.43
{txt}        .55 {c |}{res}          3       14.29       85.71
{txt}        .65 {c |}{res}          1        4.76       90.48
{txt}         .9 {c |}{res}          1        4.76       95.24
{txt}       1.15 {c |}{res}          1        4.76      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}         21      100.00

{txt}   Degree centralization:: {res}.8710526315789474

Estimation of Betweenness Centrality Measures for the Network - senateedwgt

{hline 40}
{txt}  Network name: {res}senateedwgt
{hline 40}
{txt}    Betweenness centrality
{txt}    (standardized)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}between {c |}{res}         21    .0907268    .2689314          0   1.221053

Estimation of Geodesic Paths for the Network - senateedwgt

{hline 40}
{txt}  Network name: {res}senateedwgt
{txt}  Network of shortest paths: {res}geodesic_1
{hline 40}
{txt}    Nodes: {res}21
{txt}    Symmetrized : {res}1
    {hline 36}
{txt}    Paths (largest component) : {res}210
{txt}    Diameter (largest component): {res}4
{txt}    Average shortest path (largest component): {res}1.861904761904762

Estimation of the Number of Components in the Network - senateedwgt

{hline 40}
{txt}  Network name: {res}senateedwgt
{txt}  Components: {res}1

{txt}senateedwgt {c |}
 _component {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}         21      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}         21      100.00
 
 

Estimation of the Largest Component in the Network - senateedwgt

{hline 40}
{txt}  Network name: {res}senateedwgt
{txt}  Components: {res}1

{txt}senateedwgt {c |}
       _lgc {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}         21      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}         21      100.00
 
 

Estimation of Eigenvector Centrality within the Network - senateedwgt

{hline 40}
{txt}  Network name: {res}senateedwgt
{hline 40}
{txt}    Eigenvector centrality

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
senatee~cent {c |}{res}         21    .1843403    .1196645   .0108352   .4115078
The following results are for the network named senatenonedunwgt.


{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}              38{txt}  
{col 5}{hline 41}

{res}Summary of the Network - senatenonedunwgt

{hline 50}
{txt}   Network name: {res} senatenonedunwgt
{txt}   Network id: {res} 8
{txt}   Directed: {res}false
{txt}   Nodes: {res}38
{txt}   Edges: {res}479
{txt}   Minimum value: {res} 0
{txt}   Maximum value: {res} 1
{txt}   Density: {res} .6813655761024182

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          1          22           .         22         22

Estimation of Neighbors of the Senate leader spres Based on the Network - senatenonedunwgt



{hline 40}
{txt}  Network: {res}senatenonedunwgt
{hline 40}
{txt}    Ego        : {res}22
{txt}    Neighbors  : {res}{res}3{txt} , {res}23{txt} , {res}26{txt} , {res}32
{hline 40}

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          1          14           .         14         14

Estimation of Neighbors of the Senate leader sprotemp Based on the Network - senatenonedunwgt



{hline 40}
{txt}  Network: {res}senatenonedunwgt
{hline 40}
{txt}    Ego        : {res}14
{txt}    Neighbors  : {res}{res}1{txt} , {res}2{txt} , {res}3{txt} , {res}4{txt} , {res}5{txt} , {res}6{txt} , {res}7{txt} , {res}11{txt} , {res}12{txt} , {res}15{txt} , {res}17{txt} , {res}18{txt} , {res}21{txt} , {res}23{txt} , {res}26{txt} , {res}27{txt} , {res}28{txt} , {res}29{txt} , {res}31{txt} , {res}32{txt} , {res}33{txt} , {res}35{txt} , {res}36{txt} , {res}37{txt} , {res}38
{hline 40}

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          1          23           .         23         23

Estimation of Neighbors of the Senate leader smajldr Based on the Network - senatenonedunwgt



{hline 40}
{txt}  Network: {res}senatenonedunwgt
{hline 40}
{txt}    Ego        : {res}23
{txt}    Neighbors  : {res}{res}1{txt} , {res}2{txt} , {res}3{txt} , {res}4{txt} , {res}5{txt} , {res}6{txt} , {res}7{txt} , {res}11{txt} , {res}12{txt} , {res}14{txt} , {res}15{txt} , {res}17{txt} , {res}18{txt} , {res}19{txt} , {res}20{txt} , {res}21{txt} , {res}22{txt} , {res}26{txt} , {res}27{txt} , {res}28{txt} , {res}29{txt} , {res}31{txt} , {res}32{txt} , {res}33{txt} , {res}34{txt} , {res}35{txt} , {res}36{txt} , {res}37{txt} , {res}38
{hline 40}

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          1           5           .          5          5

Estimation of Neighbors of the Senate leader smajwhip Based on the Network - senatenonedunwgt



{hline 40}
{txt}  Network: {res}senatenonedunwgt
{hline 40}
{txt}    Ego        : {res}5
{txt}    Neighbors  : {res}{res}1{txt} , {res}2{txt} , {res}3{txt} , {res}4{txt} , {res}6{txt} , {res}7{txt} , {res}8{txt} , {res}11{txt} , {res}12{txt} , {res}14{txt} , {res}15{txt} , {res}17{txt} , {res}18{txt} , {res}20{txt} , {res}21{txt} , {res}23{txt} , {res}24{txt} , {res}25{txt} , {res}26{txt} , {res}27{txt} , {res}28{txt} , {res}29{txt} , {res}31{txt} , {res}32{txt} , {res}33{txt} , {res}34{txt} , {res}35{txt} , {res}36{txt} , {res}37{txt} , {res}38
{hline 40}

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          1          15           .         15         15

Estimation of Neighbors of the Senate leader sminldr Based on the Network - senatenonedunwgt



{hline 40}
{txt}  Network: {res}senatenonedunwgt
{hline 40}
{txt}    Ego        : {res}15
{txt}    Neighbors  : {res}{res}1{txt} , {res}2{txt} , {res}3{txt} , {res}4{txt} , {res}5{txt} , {res}6{txt} , {res}7{txt} , {res}11{txt} , {res}12{txt} , {res}14{txt} , {res}17{txt} , {res}18{txt} , {res}21{txt} , {res}23{txt} , {res}25{txt} , {res}26{txt} , {res}27{txt} , {res}28{txt} , {res}29{txt} , {res}31{txt} , {res}32{txt} , {res}33{txt} , {res}35{txt} , {res}36{txt} , {res}37{txt} , {res}38
{hline 40}

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          1           2           .          2          2

Estimation of Neighbors of the Senate leader sminwhip Based on the Network - senatenonedunwgt



{hline 40}
{txt}  Network: {res}senatenonedunwgt
{hline 40}
{txt}    Ego        : {res}2
{txt}    Neighbors  : {res}{res}1{txt} , {res}3{txt} , {res}4{txt} , {res}5{txt} , {res}6{txt} , {res}7{txt} , {res}8{txt} , {res}11{txt} , {res}12{txt} , {res}14{txt} , {res}15{txt} , {res}16{txt} , {res}17{txt} , {res}18{txt} , {res}21{txt} , {res}23{txt} , {res}24{txt} , {res}25{txt} , {res}26{txt} , {res}27{txt} , {res}28{txt} , {res}29{txt} , {res}31{txt} , {res}32{txt} , {res}33{txt} , {res}35{txt} , {res}36{txt} , {res}37{txt} , {res}38
{hline 40}

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          1          32           .         32         32

Estimation of Neighbors of the Senate leader sedchair Based on the Network - senatenonedunwgt



{hline 40}
{txt}  Network: {res}senatenonedunwgt
{hline 40}
{txt}    Ego        : {res}32
{txt}    Neighbors  : {res}{res}1{txt} , {res}2{txt} , {res}3{txt} , {res}4{txt} , {res}5{txt} , {res}6{txt} , {res}7{txt} , {res}11{txt} , {res}12{txt} , {res}14{txt} , {res}15{txt} , {res}17{txt} , {res}18{txt} , {res}21{txt} , {res}22{txt} , {res}23{txt} , {res}24{txt} , {res}26{txt} , {res}27{txt} , {res}28{txt} , {res}29{txt} , {res}31{txt} , {res}33{txt} , {res}34{txt} , {res}35{txt} , {res}36{txt} , {res}37{txt} , {res}38
{hline 40}

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          0
{err}Senate leader sedvicechair has no neighbors in the network senatenonedunwgt

{res}Estimation of Reachability Network Based On - senatenonedunwgt


Summary of the Reachability Network Estimated From - senatenonedunwgt

{txt}[symmetric]
         1    2    3    4    5    6    7    8    9   10   11   12   13   14   15   16   17   18   19   20   21   22   23   24   25   26   27   28
     {c TLC}{hline 141}
   1 {c |}  {res} 0                                                                                                                                       
{txt}   2 {c |}  {res} 1    0                                                                                                                                  
{txt}   3 {c |}  {res} 1    1    0                                                                                                                             
{txt}   4 {c |}  {res} 1    1    1    0                                                                                                                        
{txt}   5 {c |}  {res} 1    1    1    1    0                                                                                                                   
{txt}   6 {c |}  {res} 1    1    1    1    1    0                                                                                                              
{txt}   7 {c |}  {res} 1    1    1    1    1    1    0                                                                                                         
{txt}   8 {c |}  {res} 1    1    1    1    1    1    1    0                                                                                                    
{txt}   9 {c |}  {res} 1    1    1    1    1    1    1    1    0                                                                                               
{txt}  10 {c |}  {res} 1    1    1    1    1    1    1    1    1    0                                                                                          
{txt}  11 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    0                                                                                     
{txt}  12 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    0                                                                                
{txt}  13 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    0                                                                           
{txt}  14 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    0                                                                      
{txt}  15 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                                                                 
{txt}  16 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                                                            
{txt}  17 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                                                       
{txt}  18 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                                                  
{txt}  19 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                                             
{txt}  20 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                                        
{txt}  21 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                                   
{txt}  22 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                              
{txt}  23 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                         
{txt}  24 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                    
{txt}  25 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0               
{txt}  26 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0          
{txt}  27 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0     
{txt}  28 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0
{txt}  29 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  30 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  31 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  32 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  33 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  34 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  35 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  36 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  37 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}  38 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1
{txt}     {c BLC}{hline 141}
        29   30   31   32   33   34   35   36   37   38
      {hline 51}{c TRC}
  29    {res} 0                                             {txt}  {c |}
  30    {res} 1    0                                        {txt}  {c |}
  31    {res} 1    1    0                                   {txt}  {c |}
  32    {res} 1    1    1    0                              {txt}  {c |}
  33    {res} 1    1    1    1    0                         {txt}  {c |}
  34    {res} 1    1    1    1    1    0                    {txt}  {c |}
  35    {res} 1    1    1    1    1    1    0               {txt}  {c |}
  36    {res} 1    1    1    1    1    1    1    0          {txt}  {c |}
  37    {res} 1    1    1    1    1    1    1    1    0     {txt}  {c |}
  38    {res} 1    1    1    1    1    1    1    1    1    0{txt}  {c |}
      {hline 51}{c BRC}

{res}Estimation of Closeness Measures for the Network - senatenonedunwgt

{hline 40}
{txt}  Network name: {res}senatenonedunwgt
{hline 40}
{txt}    Closeness centrality

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 7}close {c |}{res}         38    .7738484     .124029   .4868421       .925
{txt}{space 9}far {c |}{res}         38    49.26316    9.463112         40         76
{txt}{space 8}near {c |}{res}         38    .0209148    .0033521   .0131579       .025

Estimation of Degree Centrality Measures for the Network - senatenonedunwgt

{hline 40}
{txt}  Network name: {res}senatenonedunwgt
{hline 40}
{txt}    Degree distribution

     degree {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
   .0540541 {c |}{res}          1        2.63        2.63
{txt}   .1081081 {c |}{res}          1        2.63        5.26
{txt}   .1891892 {c |}{res}          1        2.63        7.89
{txt}   .3513514 {c |}{res}          2        5.26       13.16
{txt}   .4054054 {c |}{res}          1        2.63       15.79
{txt}   .4594595 {c |}{res}          1        2.63       18.42
{txt}   .5405405 {c |}{res}          1        2.63       21.05
{txt}   .5675676 {c |}{res}          1        2.63       23.68
{txt}   .5945946 {c |}{res}          2        5.26       28.95
{txt}   .6486486 {c |}{res}          1        2.63       31.58
{txt}   .6756757 {c |}{res}          3        7.89       39.47
{txt}   .7027027 {c |}{res}          3        7.89       47.37
{txt}   .7297297 {c |}{res}          1        2.63       50.00
{txt}   .7567568 {c |}{res}          2        5.26       55.26
{txt}   .7837838 {c |}{res}          3        7.89       63.16
{txt}   .8108108 {c |}{res}          1        2.63       65.79
{txt}   .8378378 {c |}{res}          2        5.26       71.05
{txt}   .8648649 {c |}{res}          4       10.53       81.58
{txt}   .8918919 {c |}{res}          3        7.89       89.47
{txt}   .9189189 {c |}{res}          4       10.53      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}         38      100.00

{txt}   Degree centralization:: {res}.2507507507507508

Estimation of Betweenness Centrality Measures for the Network - senatenonedunwgt

{hline 40}
{txt}  Network name: {res}senatenonedunwgt
{hline 40}
{txt}    Betweenness centrality
{txt}    (standardized)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}between {c |}{res}         38    .0184131     .023642          0   .1345403

Estimation of Geodesic Paths for the Network - senatenonedunwgt

{hline 40}
{txt}  Network name: {res}senatenonedunwgt
{txt}  Network of shortest paths: {res}geodesic_2
{hline 40}
{txt}    Nodes: {res}38
{txt}    Symmetrized : {res}1
    {hline 36}
{txt}    Paths (largest component) : {res}703
{txt}    Diameter (largest component): {res}3
{txt}    Average shortest path (largest component): {res}1.331436699857752

Estimation of the Number of Components in the Network - senatenonedunwgt

{hline 40}
{txt}  Network name: {res}senatenonedunwgt
{txt}  Components: {res}1

{txt}senatenoned {c |}
unwgt_compo {c |}
       nent {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}         38      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}         38      100.00
 
 

Estimation of the Largest Component in the Network - senatenonedunwgt

{hline 40}
{txt}  Network name: {res}senatenonedunwgt
{txt}  Components: {res}1

{txt}senatenoned {c |}
  unwgt_lgc {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}         38      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}         38      100.00
 
 

Estimation of Eigenvector Centrality within the Network - senatenonedunwgt

{hline 40}
{txt}  Network name: {res}senatenonedunwgt
{hline 40}
{txt}    Eigenvector centrality

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
senaten~cent {c |}{res}         38    .1540153    .0516258   .0083573   .1995542
The following results are for the network named senateedunwgt.


{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}              17
{txt}{col 9}from master{col 30}{res}               0{txt}  
{col 9}from using{col 30}{res}              17{txt}  

{col 5}matched{col 30}{res}              21{txt}  
{col 5}{hline 41}

{res}Summary of the Network - senateedunwgt

{hline 50}
{txt}   Network name: {res} senateedunwgt
{txt}   Network id: {res} 10
{txt}   Directed: {res}false
{txt}   Nodes: {res}21
{txt}   Edges: {res}61
{txt}   Minimum value: {res} 0
{txt}   Maximum value: {res} 1
{txt}   Density: {res} .2904761904761905

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          0
{err}Senate leader spres has no neighbors in the network senateedunwgt

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          0
{err}Senate leader sprotemp has no neighbors in the network senateedunwgt

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          1          12           .         12         12

Estimation of Neighbors of the Senate leader smajldr Based on the Network - senateedunwgt



{hline 40}
{txt}  Network: {res}senateedunwgt
{hline 40}
{txt}    Ego        : {res}12
{txt}    Neighbors  : {res}{res}3{txt} , {res}11{txt} , {res}15{txt} , {res}16
{hline 40}

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          1           3           .          3          3

Estimation of Neighbors of the Senate leader smajwhip Based on the Network - senateedunwgt



{hline 40}
{txt}  Network: {res}senateedunwgt
{hline 40}
{txt}    Ego        : {res}3
{txt}    Neighbors  : {res}{res}4{txt} , {res}6{txt} , {res}10{txt} , {res}11{txt} , {res}12{txt} , {res}15{txt} , {res}16{txt} , {res}17{txt} , {res}18{txt} , {res}20{txt} , {res}21
{hline 40}

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          0
{err}Senate leader sminldr has no neighbors in the network senateedunwgt

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          1           1           .          1          1

Estimation of Neighbors of the Senate leader sminwhip Based on the Network - senateedunwgt



{hline 40}
{txt}  Network: {res}senateedunwgt
{hline 40}
{txt}    Ego        : {res}1
{txt}    Neighbors  : {res}{res}7{txt} , {res}9{txt} , {res}14{txt} , {res}18
{hline 40}

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          1          15           .         15         15

Estimation of Neighbors of the Senate leader sedchair Based on the Network - senateedunwgt



{hline 40}
{txt}  Network: {res}senateedunwgt
{hline 40}
{txt}    Ego        : {res}15
{txt}    Neighbors  : {res}{res}3{txt} , {res}6{txt} , {res}11{txt} , {res}12{txt} , {res}16{txt} , {res}18{txt} , {res}19
{hline 40}

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}_nodeid {c |}{res}          0
{err}Senate leader sedvicechair has no neighbors in the network senateedunwgt

{res}Estimation of Reachability Network Based On - senateedunwgt


Summary of the Reachability Network Estimated From - senateedunwgt

{txt}[symmetric]
         1    2    3    4    5    6    7    8    9   10   11   12   13   14   15   16   17   18   19   20   21
     {c TLC}{hline 106}{c TRC}
   1 {c |}  {res} 0                                                                                                    {txt}  {c |}
   2 {c |}  {res} 1    0                                                                                               {txt}  {c |}
   3 {c |}  {res} 1    1    0                                                                                          {txt}  {c |}
   4 {c |}  {res} 1    1    1    0                                                                                     {txt}  {c |}
   5 {c |}  {res} 1    1    1    1    0                                                                                {txt}  {c |}
   6 {c |}  {res} 1    1    1    1    1    0                                                                           {txt}  {c |}
   7 {c |}  {res} 1    1    1    1    1    1    0                                                                      {txt}  {c |}
   8 {c |}  {res} 1    1    1    1    1    1    1    0                                                                 {txt}  {c |}
   9 {c |}  {res} 1    1    1    1    1    1    1    1    0                                                            {txt}  {c |}
  10 {c |}  {res} 1    1    1    1    1    1    1    1    1    0                                                       {txt}  {c |}
  11 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    0                                                  {txt}  {c |}
  12 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    0                                             {txt}  {c |}
  13 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    0                                        {txt}  {c |}
  14 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    0                                   {txt}  {c |}
  15 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                              {txt}  {c |}
  16 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                         {txt}  {c |}
  17 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0                    {txt}  {c |}
  18 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0               {txt}  {c |}
  19 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0          {txt}  {c |}
  20 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0     {txt}  {c |}
  21 {c |}  {res} 1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    1    0{txt}  {c |}
     {c BLC}{hline 106}{c BRC}

{res}Estimation of Closeness Measures for the Network - senateedunwgt

{hline 40}
{txt}  Network name: {res}senateedunwgt
{hline 40}
{txt}    Closeness centrality

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 7}close {c |}{res}         21    .5542745      .10324   .3571429   .8695652
{txt}{space 9}far {c |}{res}         21     37.2381     6.86225         23         56
{txt}{space 8}near {c |}{res}         21    .0277137     .005162   .0178571   .0434783

Estimation of Degree Centrality Measures for the Network - senateedunwgt

{hline 40}
{txt}  Network name: {res}senateedunwgt
{hline 40}
{txt}    Degree distribution

     degree {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
        .05 {c |}{res}          2        9.52        9.52
{txt}        .15 {c |}{res}          3       14.29       23.81
{txt}         .2 {c |}{res}          5       23.81       47.62
{txt}        .25 {c |}{res}          2        9.52       57.14
{txt}         .3 {c |}{res}          2        9.52       66.67
{txt}        .35 {c |}{res}          1        4.76       71.43
{txt}         .4 {c |}{res}          2        9.52       80.95
{txt}        .45 {c |}{res}          2        9.52       90.48
{txt}        .55 {c |}{res}          1        4.76       95.24
{txt}        .85 {c |}{res}          1        4.76      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}         21      100.00

{txt}   Degree centralization:: {res}.618421052631579

Estimation of Betweenness Centrality Measures for the Network - senateedunwgt

{hline 40}
{txt}  Network name: {res}senateedunwgt
{hline 40}
{txt}    Betweenness centrality
{txt}    (standardized)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}between {c |}{res}         21    .0907268    .2689314          0   1.221053

Estimation of Geodesic Paths for the Network - senateedunwgt

{hline 40}
{txt}  Network name: {res}senateedunwgt
{txt}  Network of shortest paths: {res}geodesic_3
{hline 40}
{txt}    Nodes: {res}21
{txt}    Symmetrized : {res}1
    {hline 36}
{txt}    Paths (largest component) : {res}210
{txt}    Diameter (largest component): {res}4
{txt}    Average shortest path (largest component): {res}1.861904761904762

Estimation of the Number of Components in the Network - senateedunwgt

{hline 40}
{txt}  Network name: {res}senateedunwgt
{txt}  Components: {res}1

{txt}senateedunw {c |}
gt_componen {c |}
          t {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}         21      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}         21      100.00
 
 

Estimation of the Largest Component in the Network - senateedunwgt

{hline 40}
{txt}  Network name: {res}senateedunwgt
{txt}  Components: {res}1

{txt}senateedunw {c |}
     gt_lgc {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}         21      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}         21      100.00
 
 

Estimation of Eigenvector Centrality within the Network - senateedunwgt

{hline 40}
{txt}  Network name: {res}senateedunwgt
{hline 40}
{txt}    Eigenvector centrality

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
senatee~cent {c |}{res}         21    .1843403    .1196645   .0108352   .4115078
{txt}
{com}. 
. loc wgt1 `: word 1 of $senatewgt'
{txt}
{com}. loc wgt2 `: word 2 of $senatewgt'
{txt}
{com}. loc unwgt1 `: word 1 of $senateunwgt'
{txt}
{com}. loc unwgt2 `: word 2 of $senateunwgt'
{txt}
{com}. 
. // Print info about networks for correlation
. di as res _n "Correlation between the `wgt1' and `wgt2' networks" _n 
{res}
Correlation between the senatenonedwgt and senateedwgt networks

{txt}
{com}. 
. // Estimate correlations between Non-Education and Education related networks in
. // the senate with weighted ties
. cap noi nwcorrelate `wgt1' `wgt2', permutations(5000)
{res}{err}Networks of different size.
{txt}
{com}. 
. // Saves the correlation visualization
. cap noi gr save `"$results/graphs/stata/`wgt1'_`wgt2'-correlation.gph"', replace
{txt}(note: file /Users/billy/Desktop/kyLegislation/results/graphs/stata/senatenonedwgt_senateedwgt-correlation.gph not found)
{res}{txt}(file ~/Desktop/kyLegislation/results/graphs/stata/senatenonedwgt_senateedwgt-correlation.gph saved)

{com}. 
. // Print info about networks for correlation
. di as res _n "Correlation between the `unwgt1' and `unwgt2' networks" _n 
{res}
Correlation between the senatenonedunwgt and senateedunwgt networks

{txt}
{com}. 
. // Same as above but with unweighted ties
. cap noi nwcorrelate `unwgt1' `unwgt2', permutations(5000)
{res}{err}Networks of different size.
{txt}
{com}. 
. // Saves the correlation visualization
. cap noi gr save `"$results/graphs/stata/`unwgt1'_`unwgt2'-correlation.gph"', replace
{txt}(note: file /Users/billy/Desktop/kyLegislation/results/graphs/stata/senatenonedunwgt_senateedunwgt-correlation.gph not found)
{res}{txt}(file ~/Desktop/kyLegislation/results/graphs/stata/senatenonedunwgt_senateedunwgt-correlation.gph saved)

{com}. 
. // Clear the data out of Stata's memory
. clear
{txt}
{com}. 
. // Load the weighted non-education network
. nwload `wgt1'
{res}{txt}
{com}. 
. // Join the political party data
. $mrgsenate
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}              38{txt}  
{col 5}{hline 41}

{com}. 
. // Print info about correlation
. di as res _n "Correlation between `wgt1' and political party affiliation" _n 
{res}
Correlation between senatenonedwgt and political party affiliation

{txt}
{com}. 
. // Correlation between the senate non-education weighted network and political party
. cap noi nwcorrelate `wgt1', attribute(party) permutations(5000)
{res}{hline 40}
{txt}  Network name: {res}senatenonedwgt
{txt}  Attribute: {res}same_party
{hline 40}
{txt}    Correlation: {res}.2061948673505476
{txt}    P-value: {res}.006
{txt}
{com}. 
. // Saves the correlation visualization
. cap noi gr save `"$results/graphs/stata/`wgt1'_party-correlation.gph"', replace
{txt}(note: file /Users/billy/Desktop/kyLegislation/results/graphs/stata/senatenonedwgt_party-correlation.gph not found)
{res}{txt}(file ~/Desktop/kyLegislation/results/graphs/stata/senatenonedwgt_party-correlation.gph saved)

{com}. 
. // Clear the data out of Stata's memory
. clear
{txt}
{com}. 
. // Load the weighted education network
. nwload `wgt2'
{res}{txt}
{com}. 
. // Join the political party data
. $mrgsenate
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}              17
{txt}{col 9}from master{col 30}{res}               0{txt}  
{col 9}from using{col 30}{res}              17{txt}  

{col 5}matched{col 30}{res}              21{txt}  
{col 5}{hline 41}

{com}. 
. // Print info about correlation
. di as res _n "Correlation between `wgt2' and political party affiliation" _n 
{res}
Correlation between senateedwgt and political party affiliation

{txt}
{com}. 
. // Correlation between the senate education weighted network and political party
. cap noi nwcorrelate `wgt2', attribute(party) permutations(5000)
{res}{err}Networks of different size.
{txt}
{com}.         
. // Saves the correlation visualization
. cap noi gr save `"$results/graphs/stata/`wgt2'_party-correlation.gph"', replace
{txt}(note: file /Users/billy/Desktop/kyLegislation/results/graphs/stata/senateedwgt_party-correlation.gph not found)
{res}{txt}(file ~/Desktop/kyLegislation/results/graphs/stata/senateedwgt_party-correlation.gph saved)

{com}. 
. // Clear the data out of Stata's memory
. clear
{txt}
{com}. 
. // Load the unweighted non-education network
. nwload `unwgt1'
{res}{txt}
{com}. 
. // Join the political party data
. $mrgsenate
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}              38{txt}  
{col 5}{hline 41}

{com}. 
. // Print info about correlation
. di as res _n "Correlation between `unwgt1' and political party affiliation" _n 
{res}
Correlation between senatenonedunwgt and political party affiliation

{txt}
{com}. 
. // Correlation between the senate non-education unweighted network and political party
. cap noi nwcorrelate `unwgt1', attribute(party) permutations(5000)
{res}{hline 40}
{txt}  Network name: {res}senatenonedunwgt
{txt}  Attribute: {res}same_party
{hline 40}
{txt}    Correlation: {res}.1011471419462475
{txt}    P-value: {res}.0878
{txt}
{com}. 
. // Saves the correlation visualization
. cap noi gr save `"$results/graphs/stata/`unwgt1'_party-correlation.gph"', replace
{txt}(note: file /Users/billy/Desktop/kyLegislation/results/graphs/stata/senatenonedunwgt_party-correlation.gph not found)
{res}{txt}(file ~/Desktop/kyLegislation/results/graphs/stata/senatenonedunwgt_party-correlation.gph saved)

{com}. 
. // Clear the data out of Stata's memory
. clear
{txt}
{com}. 
. // Load the unweighted education network
. nwload `unwgt2'
{res}{txt}
{com}. 
. // Join the political party data
. $mrgsenate
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}              17
{txt}{col 9}from master{col 30}{res}               0{txt}  
{col 9}from using{col 30}{res}              17{txt}  

{col 5}matched{col 30}{res}              21{txt}  
{col 5}{hline 41}

{com}. 
. // Print info about correlation
. di as res _n "Correlation between `unwgt2' and political party affiliation" _n 
{res}
Correlation between senateedunwgt and political party affiliation

{txt}
{com}. 
. // Correlation between the senate education unweighted network and political party
. cap noi nwcorrelate `unwgt2', attribute(party) permutations(5000)
{res}{err}Networks of different size.
{txt}
{com}. 
. // Saves the correlation visualization
. cap noi gr save `"$results/graphs/stata/`unwgt2'_party-correlation.gph"', replace
{txt}(note: file /Users/billy/Desktop/kyLegislation/results/graphs/stata/senateedunwgt_party-correlation.gph not found)
{res}{txt}(file ~/Desktop/kyLegislation/results/graphs/stata/senateedunwgt_party-correlation.gph saved)

{com}. 
. // Clear the data out of Stata's memory
. clear
{txt}
{com}. 
. // Save new file with all the networks generated from the analysis
. nwsave $analysis/senateAnalyzedNetworks, replace
{res}{txt}file ~/Desktop/kyLegislation/data/clean/analysis/senateAnalyzedNetworks.dta saved

{com}.                 
. // Close the log file
. log c senate    
      {txt}name:  {res}senate
       {txt}log:  {res}/Users/billy/Desktop/kyLegislation/results/analysisLogs/senateResults.txt
  {txt}log type:  {res}text
 {txt}closed on:  {res}14 Jul 2018, 18:42:22
{txt}{.-}

{com}. 
. // Close the main log file
. log c analyze
      {txt}name:  {res}analyze
       {txt}log:  {res}/Users/billy/Desktop/kyLegislation/logs/analysis.txt
  {txt}log type:  {res}text
 {txt}closed on:  {res}14 Jul 2018, 18:42:22
{txt}{.-}

{com}. 
{txt}end of do-file

{com}. 
. // Run the script that does the visualization
. do `"$src/networkVisualization.do"'
{txt}
{com}. /*
> 
> I'm not sure the weighted and unweighted versions of the graphs should be 
> identical, but guess it makes sense of the ties are treated as binary in most of
> the cases.  This is just a start and more will definitely be needed to generate 
> the final graphs for the poster.
> 
> */
. 
. // Creates a log file
. log using `"$logs/dataviz.txt"', replace text name(visualize)
{txt}{.-}
      name:  {res}visualize
       {txt}log:  {res}/Users/billy/Desktop/kyLegislation/logs/dataviz.txt
  {txt}log type:  {res}text
 {txt}opened on:  {res}14 Jul 2018, 18:42:22
{txt}
{com}. 
. // Defines local macro to add note to graphs
. loc note "2018 Kentucky Legislative Session Data Retrieved from LegiScan"
{txt}
{com}. 
. // Loads networks into Mata and also adds Stata variables in not useful format
. nwuse `"$analysis/senateAnalyzedNetworks"', nwclear

{txt}{it:Loading successful}
{res}{txt}(13 networks)
{hline 20}
      {res}geodesic_2
      {res}geodesic_1
      {res}geodesic
      {res}geodesic_3
      {res}senatenonedwgt_reach
      {res}senatenonedwgt
      {res}senateedwgt_reach
      {res}senatenonedunwgt_reach
      {res}senatenonedunwgt
      {res}senateedunwgt_reach
      {res}senateedwgt
      {res}senateedunwgt
      {res}same_party
{txt}
{com}. 
. loc senatenonedwgt "Senate Weighted Network of Non-Education Legislation"
{txt}
{com}. loc senateedwgt "Senate Weighted Network of Education Legislation"
{txt}
{com}. loc senatenonedunwgt "Senate Unweighted Network of Non-Education Legislation"
{txt}
{com}. loc senateedunwgt "Senate Unweighted Network of Education Legislation"
{txt}
{com}. 
. // Loops over the senate networks
. foreach network in $senatewgt $senateunwgt {c -(}
{txt}  2{com}. 
.         // Clear Stata variables from memory
.         clear
{txt}  3{com}.         
.         // Load the network
.         nwload `network'
{txt}  4{com}. 
.         // Keep only valid records
.         keep if !mi(_nodeid) & !mi(_nodelab)
{txt}  5{com}.         
.         // Join the political party data
.         $mrgsenate
{txt}  6{com}. 
.         // Keep only valid records
.         keep if !mi(_nodeid) & !mi(_nodelab)
{txt}  7{com}.         
.         // Estimates the eigenvector centrality
.         nwevcent `network', generate(`network'_eigencent)
{txt}  8{com}. 
.         // Summary of Eigenvector centrality values
.         su `network'_eigencent, de
{txt}  9{com}.         
.         // Removes names for everyone outside of the top 25% 
.         replace name = "" if `network'_eigencent < `r(p75)'
{txt} 10{com}.         
.         // Change the end of line delimiter to a semicolon
.         #d ;
{txt}delimiter now ;
{com}.                 // Creates graph of the senate networks
>         nwplot `network', xsize(18) ysize(12) name(`network', replace)
>         label(name) labelopt(mlabs(vsmall) mlabc(black) mlabgap(*1.5) mlabpos(12))  
>         color(party, colorpalette(red%50 blue%50) nodeclash(0.75)) 
>         size(`network'_eigencent, sizebin(10) legendoff) edgefactor(0.75) 
>         arcstyle(curved) arcsplines(50) arcbend(0.35) 
>         layout(mds, iterations(5000))   nodefactor(1.5) 
>         edgecolor(, edgecolorpalette(orange%15)) 
>         ti(`"``network''"', span c(black) size(medlarge) pos(11) ring(7)) 
>         note(`"`note'"', c(black) size(vsmall) span pos(7) ring(7)) 
>         plotr(margin(zero) ic(ltbluishgray)) 
>         graphr(margin(zero) ic(ltbluishgray)) 
>         legendopt(pos(1) ring(7) size(small) 
>         region(lc(ltbluishgray) fc(ltbluishgray))) ;
{txt} 11{com}.         // Change end of line delimiter back to carriage return
>         #d cr
{txt}delimiter now cr
{com}. 
.         // Saves the network graph
.         gr save `"$results/graphs/stata/`network'-graph.gph"', replace
{txt} 12{com}.         
.         // Exports the graph as a PDF document
.         gr export `"$results/graphs/pub/`network'-graph.pdf"', as(pdf) replace
{txt} 13{com}.                 
. {c )-} // End Loop over senate networks
{res}{txt}(0 observations deleted)
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}              38{txt}  
{col 5}{hline 41}
(0 observations deleted)
{res}{hline 40}
{txt}  Network name: {res}senatenonedwgt
{hline 40}
{txt}    Eigenvector centrality

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
senatenone~t {c |}{res}         38    .1540153    .0516258   .0083573   .1995542

                  {txt}senatenonedwgt_eigencent
{hline 61}
      Percentiles      Smallest
 1%    {res} .0083573       .0083573
{txt} 5%    {res} .0248665       .0248665
{txt}10%    {res} .0746048       .0382018       {txt}Obs         {res}         38
{txt}25%    {res} .1338073       .0746048       {txt}Sum of Wgt. {res}         38

{txt}50%    {res} .1717331                      {txt}Mean          {res} .1540153
                        {txt}Largest       Std. Dev.     {res} .0516258
{txt}75%    {res} .1914408        .196979
{txt}90%    {res}  .196979       .1995542       {txt}Variance      {res} .0026652
{txt}95%    {res} .1995542       .1995542       {txt}Skewness      {res}-1.412337
{txt}99%    {res} .1995542       .1995542       {txt}Kurtosis      {res} 4.048871
{txt}(27 real changes made)
{res}

{text:Calculating node coordinates...}
{txt}Generating splines...
{res}{text:Plotting network...}
{txt}(note: file /Users/billy/Desktop/kyLegislation/results/graphs/stata/senatenonedwgt-graph.gph not found)
{res}{txt}(file ~/Desktop/kyLegislation/results/graphs/stata/senatenonedwgt-graph.gph saved)
(file ~/Desktop/kyLegislation/results/graphs/pub/senatenonedwgt-graph.pdf written in PDF format)
{res}{txt}(0 observations deleted)
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}              17
{txt}{col 9}from master{col 30}{res}               0{txt}  
{col 9}from using{col 30}{res}              17{txt}  

{col 5}matched{col 30}{res}              21{txt}  
{col 5}{hline 41}
(17 observations deleted)
{res}{txt}{p}
number of observations (_N)  was 21,
now 38
{p_end}
{res}{hline 40}
{txt}  Network name: {res}senateedwgt
{hline 40}
{txt}    Eigenvector centrality

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
senateedwg~t {c |}{res}         21    .1843403    .1196645   .0108352   .4115078

                    {txt}senateedwgt_eigencent
{hline 61}
      Percentiles      Smallest
 1%    {res} .0108352       .0108352
{txt} 5%    {res} .0443001       .0443001
{txt}10%    {res} .0698105       .0698105       {txt}Obs         {res}         21
{txt}25%    {res}  .084322       .0698105       {txt}Sum of Wgt. {res}         21

{txt}50%    {res} .1662687                      {txt}Mean          {res} .1843403
                        {txt}Largest       Std. Dev.     {res} .1196645
{txt}75%    {res} .2951163       .3207801
{txt}90%    {res} .3260594       .3260594       {txt}Variance      {res} .0143196
{txt}95%    {res} .3497331       .3497331       {txt}Skewness      {res} .2705571
{txt}99%    {res} .4115078       .4115078       {txt}Kurtosis      {res} 1.735822
{txt}(15 real changes made)
{res}{txt}(17 missing values generated)
{res}{txt}(17 missing values generated)
{res}

{text:Calculating node coordinates...}
{txt}Generating splines...
{res}{text:Plotting network...}
{txt}(note: file /Users/billy/Desktop/kyLegislation/results/graphs/stata/senateedwgt-graph.gph not found)
{res}{txt}(file ~/Desktop/kyLegislation/results/graphs/stata/senateedwgt-graph.gph saved)
(file ~/Desktop/kyLegislation/results/graphs/pub/senateedwgt-graph.pdf written in PDF format)
{res}{txt}(0 observations deleted)
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}              38{txt}  
{col 5}{hline 41}
(0 observations deleted)
{res}{hline 40}
{txt}  Network name: {res}senatenonedunwgt
{hline 40}
{txt}    Eigenvector centrality

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
senatenone~t {c |}{res}         38    .1540153    .0516258   .0083573   .1995542

                 {txt}senatenonedunwgt_eigencent
{hline 61}
      Percentiles      Smallest
 1%    {res} .0083573       .0083573
{txt} 5%    {res} .0248665       .0248665
{txt}10%    {res} .0746048       .0382018       {txt}Obs         {res}         38
{txt}25%    {res} .1338073       .0746048       {txt}Sum of Wgt. {res}         38

{txt}50%    {res} .1717331                      {txt}Mean          {res} .1540153
                        {txt}Largest       Std. Dev.     {res} .0516258
{txt}75%    {res} .1914408        .196979
{txt}90%    {res}  .196979       .1995542       {txt}Variance      {res} .0026652
{txt}95%    {res} .1995542       .1995542       {txt}Skewness      {res}-1.412337
{txt}99%    {res} .1995542       .1995542       {txt}Kurtosis      {res} 4.048871
{txt}(27 real changes made)
{res}

{text:Calculating node coordinates...}
{txt}Generating splines...
{res}{text:Plotting network...}
{txt}(note: file /Users/billy/Desktop/kyLegislation/results/graphs/stata/senatenonedunwgt-graph.gph not found)
{res}{txt}(file ~/Desktop/kyLegislation/results/graphs/stata/senatenonedunwgt-graph.gph saved)
(file ~/Desktop/kyLegislation/results/graphs/pub/senatenonedunwgt-graph.pdf written in PDF format)
{res}{txt}(0 observations deleted)
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}              17
{txt}{col 9}from master{col 30}{res}               0{txt}  
{col 9}from using{col 30}{res}              17{txt}  

{col 5}matched{col 30}{res}              21{txt}  
{col 5}{hline 41}
(17 observations deleted)
{res}{txt}{p}
number of observations (_N)  was 21,
now 38
{p_end}
{res}{hline 40}
{txt}  Network name: {res}senateedunwgt
{hline 40}
{txt}    Eigenvector centrality

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
senateedun~t {c |}{res}         21    .1843403    .1196645   .0108352   .4115078

                   {txt}senateedunwgt_eigencent
{hline 61}
      Percentiles      Smallest
 1%    {res} .0108352       .0108352
{txt} 5%    {res} .0443001       .0443001
{txt}10%    {res} .0698105       .0698105       {txt}Obs         {res}         21
{txt}25%    {res}  .084322       .0698105       {txt}Sum of Wgt. {res}         21

{txt}50%    {res} .1662687                      {txt}Mean          {res} .1843403
                        {txt}Largest       Std. Dev.     {res} .1196645
{txt}75%    {res} .2951163       .3207801
{txt}90%    {res} .3260594       .3260594       {txt}Variance      {res} .0143196
{txt}95%    {res} .3497331       .3497331       {txt}Skewness      {res} .2705571
{txt}99%    {res} .4115078       .4115078       {txt}Kurtosis      {res} 1.735822
{txt}(15 real changes made)
{res}{txt}(17 missing values generated)
{res}{txt}(17 missing values generated)
{res}

{text:Calculating node coordinates...}
{txt}Generating splines...
{res}{text:Plotting network...}
{txt}(note: file /Users/billy/Desktop/kyLegislation/results/graphs/stata/senateedunwgt-graph.gph not found)
{res}{txt}(file ~/Desktop/kyLegislation/results/graphs/stata/senateedunwgt-graph.gph saved)
(file ~/Desktop/kyLegislation/results/graphs/pub/senateedunwgt-graph.pdf written in PDF format)

{com}. 
. // Loads the house networks
. nwuse `"$analysis/houseAnalyzedNetworks"', nwclear

{txt}{it:Loading successful}
{res}{txt}(13 networks)
{hline 20}
      {res}geodesic_2
      {res}geodesic_1
      {res}geodesic
      {res}geodesic_3
      {res}housenonedwgt_reach
      {res}housenonedwgt
      {res}houseedwgt_reach
      {res}housenonedunwgt_reach
      {res}housenonedunwgt
      {res}houseedunwgt_reach
      {res}houseedwgt
      {res}houseedunwgt
      {res}same_party
{txt}
{com}. 
. loc housenonedwgt "House Weighted Network of Non-Education Legislation"
{txt}
{com}. loc houseedwgt "House Weighted Network of Education Legislation"
{txt}
{com}. loc housenonedunwgt "House Unweighted Network of Non-Education Legislation"
{txt}
{com}. loc houseedunwgt "House Unweighted Network of Education Legislation"
{txt}
{com}. 
. // Loops over house networks
. foreach network in $housewgt {c -(} //$houseunwgt {c -(}
{txt}  2{com}.         
.         // Clear Stata variables from memory
.         clear
{txt}  3{com}.         
.         // Load the network
.         nwload `network'
{txt}  4{com}. 
.         // Keep only valid records
.         keep if !mi(_nodeid) & !mi(_nodelab)
{txt}  5{com}.         
.         // Join the political party data
.         $mrghouse
{txt}  6{com}. 
.         // Estimates the eigenvector centrality
.         nwevcent `network', generate(`network'_eigencent)
{txt}  7{com}.         
.         su `network'_eigencent, de
{txt}  8{com}.         
.         replace name = "" if `network'_eigencent < `r(p75)'
{txt}  9{com}.         
.         // Keep only valid records
.         keep if !mi(_nodeid) & !mi(_nodelab)
{txt} 10{com}.         
.         if ustrregexm(`"`network'"', "noned") == 1 {c -(}
{txt} 11{com}.                 loc edgef 0.25
{txt} 12{com}.                 loc nodef 0.5
{txt} 13{com}.         {c )-}
{txt} 14{com}.         else {c -(}
{txt} 15{com}.                 loc edgef 1.15
{txt} 16{com}.                 loc nodef 1
{txt} 17{com}.         {c )-}
{txt} 18{com}.         
.         #d ;
{txt}delimiter now ;
{com}.                 // Creates graph of the senate networks
>         nwplot `network', xsize(18) ysize(12) name(`network', replace)
>         label(name) labelopt(mlabs(tiny) mlabc(black) mlabgap(*1.25) mlabp(12)) 
>         color(party, colorpalette(red%50 blue%50) nodeclash(1000000))   
>         size(`network'_eigencent, sizebin(10) nodeclash(1000000) legendoff) 
>         edgefactor(`edgef')      
>         arcstyle(curved) arcsplines(15) arcbend(0.35)                                   
>         layout(mds, iterations(5000)) nodefactor(`nodef')       
>         edgecolor(, edgecolorpalette(orange%15)) 
>         ti(`"``network''"', span c(black) size(medlarge) pos(11) ring(7)) 
>         note(`"`note'"', c(black) size(vsmall) span pos(7) ring(7)) 
>         plotr(margin(zero) ic(ltbluishgray)) `aspect' 
>         graphr(margin(zero) ic(ltbluishgray)) 
>         legendopt(pos(1) ring(7) size(small) region(lc(ltbluishgray) fc(ltbluishgray))) ;
{txt} 19{com}.                         #d cr
{txt}delimiter now cr
{com}.         
.         // Saves the network graph
.         gr save `"$results/graphs/stata/`network'-graph.gph"', replace
{txt} 20{com}.         
.         // Exports the graph as a PDF document
.         gr export `"$results/graphs/pub/`network'-graph.pdf"', as(pdf) replace
{txt} 21{com}.         
. {c )-} // End Loop over house networks
{res}{txt}(0 observations deleted)
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             100{txt}  
{col 5}{hline 41}
{res}{hline 40}
{txt}  Network name: {res}housenonedwgt
{hline 40}
{txt}    Eigenvector centrality

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
housenoned~t {c |}{res}        100    .0977956    .0209865   .0208974    .120216

                   {txt}housenonedwgt_eigencent
{hline 61}
      Percentiles      Smallest
 1%    {res} .0302459       .0208974
{txt} 5%    {res} .0479794       .0395943
{txt}10%    {res} .0637798       .0401191       {txt}Obs         {res}        100
{txt}25%    {res} .0924121       .0455271       {txt}Sum of Wgt. {res}        100

{txt}50%    {res} .1038444                      {txt}Mean          {res} .0977956
                        {txt}Largest       Std. Dev.     {res} .0209865
{txt}75%    {res} .1122822       .1183526
{txt}90%    {res} .1147228       .1191005       {txt}Variance      {res} .0004404
{txt}95%    {res} .1180911       .1195892       {txt}Skewness      {res}-1.660775
{txt}99%    {res} .1199026        .120216       {txt}Kurtosis      {res}  5.19637
{txt}(75 real changes made)
(0 observations deleted)
{res}

{text:Calculating node coordinates...}
{txt}Generating splines...
{res}{text:Plotting network...}
{txt}(note: file /Users/billy/Desktop/kyLegislation/results/graphs/stata/housenonedwgt-graph.gph not found)
{res}{txt}(file ~/Desktop/kyLegislation/results/graphs/stata/housenonedwgt-graph.gph saved)
(file ~/Desktop/kyLegislation/results/graphs/pub/housenonedwgt-graph.pdf written in PDF format)
{res}{txt}(0 observations deleted)
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}              43
{txt}{col 9}from master{col 30}{res}               0{txt}  
{col 9}from using{col 30}{res}              43{txt}  

{col 5}matched{col 30}{res}              57{txt}  
{col 5}{hline 41}
{res}{hline 40}
{txt}  Network name: {res}houseedwgt
{hline 40}
{txt}    Eigenvector centrality

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
houseedwgt~t {c |}{res}         57    .1118915    .0715113   .0030895   .2864549

                    {txt}houseedwgt_eigencent
{hline 61}
      Percentiles      Smallest
 1%    {res} .0030895       .0030895
{txt} 5%    {res} .0079053       .0030895
{txt}10%    {res} .0120543       .0079053       {txt}Obs         {res}         57
{txt}25%    {res} .0562747       .0080042       {txt}Sum of Wgt. {res}         57

{txt}50%    {res} .1142837                      {txt}Mean          {res} .1118915
                        {txt}Largest       Std. Dev.     {res} .0715113
{txt}75%    {res} .1488466       .2349757
{txt}90%    {res} .2028353       .2579998       {txt}Variance      {res} .0051139
{txt}95%    {res} .2579998       .2584825       {txt}Skewness      {res} .3754815
{txt}99%    {res} .2864549       .2864549       {txt}Kurtosis      {res} 2.401158
{txt}(43 real changes made)
(43 observations deleted)
{res}

{text:Calculating node coordinates...}
{txt}Generating splines...
{res}{text:Plotting network...}
{txt}(note: file /Users/billy/Desktop/kyLegislation/results/graphs/stata/houseedwgt-graph.gph not found)
{res}{txt}(file ~/Desktop/kyLegislation/results/graphs/stata/houseedwgt-graph.gph saved)
(file ~/Desktop/kyLegislation/results/graphs/pub/houseedwgt-graph.pdf written in PDF format)

{com}. 
. // Close the log file
. log c visualize
      {txt}name:  {res}visualize
       {txt}log:  {res}/Users/billy/Desktop/kyLegislation/logs/dataviz.txt
  {txt}log type:  {res}text
 {txt}closed on:  {res}14 Jul 2018, 18:44:12
{txt}{.-}

{com}. 
{txt}end of do-file

{com}. 
. // Close log file for controller script
. log c master
      {txt}name:  {res}master
       {txt}log:  {res}/Users/billy/Desktop/kyLegislation/logs/master.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}14 Jul 2018, 18:44:12
{txt}{.-}
{smcl}
{txt}{sf}{ul off}